<abi-corpus path='libzfs.so' architecture='elf-amd-x86_64' soname='libzfs.so.4'>
  <elf-needed>
    <dependency name='libzfs_core.so.3'/>
    <dependency name='libuuid.so.1'/>
    <dependency name='librt.so.1'/>
    <dependency name='libblkid.so.1'/>
    <dependency name='libudev.so.1'/>
    <dependency name='libnvpair.so.3'/>
    <dependency name='libtirpc.so.3'/>
    <dependency name='libuutil.so.3'/>
    <dependency name='libm.so.6'/>
    <dependency name='libcrypto.so.1.1'/>
    <dependency name='libz.so.1'/>
    <dependency name='libpthread.so.0'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='bookmark_namecheck' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='cityhash4' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='color_end' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='color_start' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='dataset_namecheck' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='dataset_nestcheck' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='zprop_string_to_index' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_valid_for_type' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_values' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_width' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zvol_volsize_to_reservation' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <elf-variable-symbols>
    <elf-symbol name='fletcher_4_abd_ops' size='24' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fletcher_4_avx2_ops' size='64' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fletcher_4_avx512bw_ops' size='64' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fletcher_4_avx512f_ops' size='64' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fletcher_4_sse2_ops' size='64' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fletcher_4_ssse3_ops' size='64' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fletcher_4_superscalar4_ops' size='64' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fletcher_4_superscalar_ops' size='64' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='libzfs_config_ops' size='16' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spa_feature_table' size='1904' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfeature_checks_disable' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_deleg_perm_tab' size='512' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_history_event_names' size='328' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_max_dataset_nesting' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_userquota_prop_prefixes' size='96' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr version='1.0' address-size='64' path='libshare.c' comp-dir-path='/home/brian/zfs_directio_pr/lib/libshare' language='LANG_C99'>
    <function-decl name='sa_validate_shareopts' mangled-name='sa_validate_shareopts' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sa_validate_shareopts'>
      <parameter type-id='type-id-1' name='options'/>
      <parameter type-id='type-id-1' name='proto'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='sa_errorstr' mangled-name='sa_errorstr' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sa_errorstr'>
      <parameter type-id='type-id-2' name='err'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='sa_commit_shares' mangled-name='sa_commit_shares' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sa_commit_shares'>
      <parameter type-id='type-id-3' name='protocol'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='sa_is_shared' mangled-name='sa_is_shared' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sa_is_shared'>
      <parameter type-id='type-id-3' name='mountpoint'/>
      <parameter type-id='type-id-1' name='protocol'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='sa_disable_share' mangled-name='sa_disable_share' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sa_disable_share'>
      <parameter type-id='type-id-3' name='mountpoint'/>
      <parameter type-id='type-id-1' name='protocol'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='sa_enable_share' mangled-name='sa_enable_share' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sa_enable_share'>
      <parameter type-id='type-id-3' name='zfsname'/>
      <parameter type-id='type-id-3' name='mountpoint'/>
      <parameter type-id='type-id-3' name='shareopts'/>
      <parameter type-id='type-id-1' name='protocol'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <pointer-type-def type-id='type-id-6' size-in-bits='64' id='type-id-1'/>
    <pointer-type-def type-id='type-id-7' size-in-bits='64' id='type-id-3'/>
    <type-decl name='int' size-in-bits='32' id='type-id-2'/>
    <typedef-decl name='boolean_t' type-id='type-id-8' id='type-id-5'/>
    <type-decl name='void' id='type-id-4'/>
    <type-decl name='char' size-in-bits='8' id='type-id-6'/>
    <qualified-type-def type-id='type-id-6' const='yes' id='type-id-7'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-8'>
      <underlying-type type-id='type-id-9'/>
      <enumerator name='B_FALSE' value='0'/>
      <enumerator name='B_TRUE' value='1'/>
    </enum-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='os/linux/smb.c' comp-dir-path='/home/brian/zfs_directio_pr/lib/libshare' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='2040' id='type-id-10'>
      <subrange length='255' type-id='type-id-11' id='type-id-12'/>
    </array-type-def>
    <typedef-decl name='smb_share_t' type-id='type-id-13' id='type-id-14'/>
    <class-decl name='smb_share_s' size-in-bits='36992' is-struct='yes' visibility='default' id='type-id-13'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2040'>
        <var-decl name='path' type-id='type-id-15' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='34808'>
        <var-decl name='comment' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='36864'>
        <var-decl name='guest_ok' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='36928'>
        <var-decl name='next' type-id='type-id-16' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-13' size-in-bits='64' id='type-id-16'/>
    <pointer-type-def type-id='type-id-14' size-in-bits='64' id='type-id-17'/>
    <var-decl name='smb_shares' type-id='type-id-17' visibility='default'/>
    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='32768' id='type-id-15'>
      <subrange length='4096' type-id='type-id-11' id='type-id-18'/>
    </array-type-def>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-11'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../../module/zcommon/cityhash.c' comp-dir-path='/home/brian/zfs_directio_pr/lib/libzfs' language='LANG_C99'>
    <function-decl name='cityhash4' mangled-name='cityhash4' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='cityhash4'>
      <parameter type-id='type-id-19' name='w1'/>
      <parameter type-id='type-id-19' name='w2'/>
      <parameter type-id='type-id-19' name='w3'/>
      <parameter type-id='type-id-19' name='w4'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <typedef-decl name='uint64_t' type-id='type-id-20' id='type-id-19'/>
    <typedef-decl name='__uint64_t' type-id='type-id-11' id='type-id-20'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../../module/zcommon/zfeature_common.c' comp-dir-path='/home/brian/zfs_directio_pr/lib/libzfs' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-21' size-in-bits='15232' id='type-id-22'>
      <subrange length='34' type-id='type-id-11' id='type-id-23'/>
    </array-type-def>
    <typedef-decl name='zfeature_info_t' type-id='type-id-24' id='type-id-21'/>
    <class-decl name='zfeature_info' size-in-bits='448' is-struct='yes' visibility='default' id='type-id-24'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fi_feature' type-id='type-id-25' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fi_uname' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='fi_guid' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='fi_desc' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='fi_flags' type-id='type-id-26' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='fi_zfs_mod_supported' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='fi_type' type-id='type-id-27' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='fi_depends' type-id='type-id-28' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='spa_feature_t' type-id='type-id-29' id='type-id-25'/>
    <enum-decl name='spa_feature' id='type-id-29'>
      <underlying-type type-id='type-id-9'/>
      <enumerator name='SPA_FEATURE_NONE' value='-1'/>
      <enumerator name='SPA_FEATURE_ASYNC_DESTROY' value='0'/>
      <enumerator name='SPA_FEATURE_EMPTY_BPOBJ' value='1'/>
      <enumerator name='SPA_FEATURE_LZ4_COMPRESS' value='2'/>
      <enumerator name='SPA_FEATURE_MULTI_VDEV_CRASH_DUMP' value='3'/>
      <enumerator name='SPA_FEATURE_SPACEMAP_HISTOGRAM' value='4'/>
      <enumerator name='SPA_FEATURE_ENABLED_TXG' value='5'/>
      <enumerator name='SPA_FEATURE_HOLE_BIRTH' value='6'/>
      <enumerator name='SPA_FEATURE_EXTENSIBLE_DATASET' value='7'/>
      <enumerator name='SPA_FEATURE_EMBEDDED_DATA' value='8'/>
      <enumerator name='SPA_FEATURE_BOOKMARKS' value='9'/>
      <enumerator name='SPA_FEATURE_FS_SS_LIMIT' value='10'/>
      <enumerator name='SPA_FEATURE_LARGE_BLOCKS' value='11'/>
      <enumerator name='SPA_FEATURE_LARGE_DNODE' value='12'/>
      <enumerator name='SPA_FEATURE_SHA512' value='13'/>
      <enumerator name='SPA_FEATURE_SKEIN' value='14'/>
      <enumerator name='SPA_FEATURE_EDONR' value='15'/>
      <enumerator name='SPA_FEATURE_USEROBJ_ACCOUNTING' value='16'/>
      <enumerator name='SPA_FEATURE_ENCRYPTION' value='17'/>
      <enumerator name='SPA_FEATURE_PROJECT_QUOTA' value='18'/>
      <enumerator name='SPA_FEATURE_DEVICE_REMOVAL' value='19'/>
      <enumerator name='SPA_FEATURE_OBSOLETE_COUNTS' value='20'/>
      <enumerator name='SPA_FEATURE_POOL_CHECKPOINT' value='21'/>
      <enumerator name='SPA_FEATURE_SPACEMAP_V2' value='22'/>
      <enumerator name='SPA_FEATURE_ALLOCATION_CLASSES' value='23'/>
      <enumerator name='SPA_FEATURE_RESILVER_DEFER' value='24'/>
      <enumerator name='SPA_FEATURE_BOOKMARK_V2' value='25'/>
      <enumerator name='SPA_FEATURE_REDACTION_BOOKMARKS' value='26'/>
      <enumerator name='SPA_FEATURE_REDACTED_DATASETS' value='27'/>
      <enumerator name='SPA_FEATURE_BOOKMARK_WRITTEN' value='28'/>
      <enumerator name='SPA_FEATURE_LOG_SPACEMAP' value='29'/>
      <enumerator name='SPA_FEATURE_LIVELIST' value='30'/>
      <enumerator name='SPA_FEATURE_DEVICE_REBUILD' value='31'/>
      <enumerator name='SPA_FEATURE_ZSTD_COMPRESS' value='32'/>
      <enumerator name='SPA_FEATURE_DRAID' value='33'/>
      <enumerator name='SPA_FEATURES' value='34'/>
    </enum-decl>
    <typedef-decl name='zfeature_flags_t' type-id='type-id-30' id='type-id-26'/>
    <enum-decl name='zfeature_flags' id='type-id-30'>
      <underlying-type type-id='type-id-9'/>
      <enumerator name='ZFEATURE_FLAG_READONLY_COMPAT' value='1'/>
      <enumerator name='ZFEATURE_FLAG_MOS' value='2'/>
      <enumerator name='ZFEATURE_FLAG_ACTIVATE_ON_ENABLE' value='4'/>
      <enumerator name='ZFEATURE_FLAG_PER_DATASET' value='8'/>
    </enum-decl>
    <typedef-decl name='zfeature_type_t' type-id='type-id-31' id='type-id-27'/>
    <enum-decl name='zfeature_type' id='type-id-31'>
      <underlying-type type-id='type-id-9'/>
      <enumerator name='ZFEATURE_TYPE_BOOLEAN' value='0'/>
      <enumerator name='ZFEATURE_TYPE_UINT64_ARRAY' value='1'/>
      <enumerator name='ZFEATURE_NUM_TYPES' value='2'/>
    </enum-decl>
    <qualified-type-def type-id='type-id-25' const='yes' id='type-id-32'/>
    <pointer-type-def type-id='type-id-32' size-in-bits='64' id='type-id-28'/>
    <pointer-type-def type-id='type-id-25' size-in-bits='64' id='type-id-33'/>
    <var-decl name='zfeature_checks_disable' type-id='type-id-5' mangled-name='zfeature_checks_disable' visibility='default' elf-symbol-id='zfeature_checks_disable'/>
    <var-decl name='spa_feature_table' type-id='type-id-22' mangled-name='spa_feature_table' visibility='default' elf-symbol-id='spa_feature_table'/>
    <function-decl name='zpool_feature_init' mangled-name='zpool_feature_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_feature_init'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_mod_supported' mangled-name='zfs_mod_supported' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_mod_supported'>
      <parameter type-id='type-id-3' name='scope'/>
      <parameter type-id='type-id-3' name='name'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zfeature_depends_on' mangled-name='zfeature_depends_on' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfeature_depends_on'>
      <parameter type-id='type-id-25' name='fid'/>
      <parameter type-id='type-id-25' name='check'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zfeature_lookup_name' mangled-name='zfeature_lookup_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfeature_lookup_name'>
      <parameter type-id='type-id-3' name='name'/>
      <parameter type-id='type-id-33' name='res'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfeature_lookup_guid' mangled-name='zfeature_lookup_guid' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfeature_lookup_guid'>
      <parameter type-id='type-id-3' name='guid'/>
      <parameter type-id='type-id-33' name='res'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfeature_is_supported' mangled-name='zfeature_is_supported' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfeature_is_supported'>
      <parameter type-id='type-id-3' name='guid'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zfeature_is_valid_guid' mangled-name='zfeature_is_valid_guid' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfeature_is_valid_guid'>
      <parameter type-id='type-id-3' name='name'/>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../../module/zcommon/zfs_comutil.c' comp-dir-path='/home/brian/zfs_directio_pr/lib/libzfs' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-3' size-in-bits='2624' id='type-id-34'>
      <subrange length='41' type-id='type-id-11' id='type-id-35'/>
    </array-type-def>
    <typedef-decl name='zpool_load_policy_t' type-id='type-id-36' id='type-id-37'/>
    <class-decl name='zpool_load_policy' size-in-bits='256' is-struct='yes' visibility='default' id='type-id-36'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zlp_rewind' type-id='type-id-38' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='zlp_maxmeta' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='zlp_maxdata' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='zlp_txg' type-id='type-id-19' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-37' size-in-bits='64' id='type-id-39'/>
    <var-decl name='zfs_history_event_names' type-id='type-id-34' mangled-name='zfs_history_event_names' visibility='default' elf-symbol-id='zfs_history_event_names'/>
    <function-decl name='zfs_dataset_name_hidden' mangled-name='zfs_dataset_name_hidden' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_dataset_name_hidden'>
      <parameter type-id='type-id-3' name='name'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zfs_spa_version_map' mangled-name='zfs_spa_version_map' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_spa_version_map'>
      <parameter type-id='type-id-2' name='zpl_version'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_zpl_version_map' mangled-name='zfs_zpl_version_map' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_zpl_version_map'>
      <parameter type-id='type-id-2' name='spa_version'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zpool_get_load_policy' mangled-name='zpool_get_load_policy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_get_load_policy'>
      <parameter type-id='type-id-40' name='nvl'/>
      <parameter type-id='type-id-39' name='zlpp'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_special_devs' mangled-name='zfs_special_devs' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_special_devs'>
      <parameter type-id='type-id-40' name='nv'/>
      <parameter type-id='type-id-1' name='type'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zfs_allocatable_devs' mangled-name='zfs_allocatable_devs' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_allocatable_devs'>
      <parameter type-id='type-id-40' name='nv'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-41' size-in-bits='64' id='type-id-40'/>
    <typedef-decl name='uint32_t' type-id='type-id-42' id='type-id-38'/>
    <typedef-decl name='__uint32_t' type-id='type-id-43' id='type-id-42'/>
    <typedef-decl name='nvlist_t' type-id='type-id-44' id='type-id-41'/>
    <class-decl name='nvlist' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-44'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nvl_version' type-id='type-id-45' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='nvl_nvflag' type-id='type-id-38' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nvl_priv' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nvl_flag' type-id='type-id-38' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='nvl_pad' type-id='type-id-45' visibility='default'/>
      </data-member>
    </class-decl>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-43'/>
    <typedef-decl name='int32_t' type-id='type-id-46' id='type-id-45'/>
    <typedef-decl name='__int32_t' type-id='type-id-2' id='type-id-46'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../../module/zcommon/zfs_deleg.c' comp-dir-path='/home/brian/zfs_directio_pr/lib/libzfs' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-47' size-in-bits='infinite' id='type-id-48'>
      <subrange length='infinite' id='type-id-49'/>
    </array-type-def>
    <typedef-decl name='zfs_deleg_perm_tab_t' type-id='type-id-50' id='type-id-47'/>
    <class-decl name='zfs_deleg_perm_tab' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-50'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='z_perm' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='z_note' type-id='type-id-51' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zfs_deleg_note_t' type-id='type-id-52' id='type-id-51'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-52'>
      <underlying-type type-id='type-id-9'/>
      <enumerator name='ZFS_DELEG_NOTE_CREATE' value='0'/>
      <enumerator name='ZFS_DELEG_NOTE_DESTROY' value='1'/>
      <enumerator name='ZFS_DELEG_NOTE_SNAPSHOT' value='2'/>
      <enumerator name='ZFS_DELEG_NOTE_ROLLBACK' value='3'/>
      <enumerator name='ZFS_DELEG_NOTE_CLONE' value='4'/>
      <enumerator name='ZFS_DELEG_NOTE_PROMOTE' value='5'/>
      <enumerator name='ZFS_DELEG_NOTE_RENAME' value='6'/>
      <enumerator name='ZFS_DELEG_NOTE_SEND' value='7'/>
      <enumerator name='ZFS_DELEG_NOTE_RECEIVE' value='8'/>
      <enumerator name='ZFS_DELEG_NOTE_ALLOW' value='9'/>
      <enumerator name='ZFS_DELEG_NOTE_USERPROP' value='10'/>
      <enumerator name='ZFS_DELEG_NOTE_MOUNT' value='11'/>
      <enumerator name='ZFS_DELEG_NOTE_SHARE' value='12'/>
      <enumerator name='ZFS_DELEG_NOTE_USERQUOTA' value='13'/>
      <enumerator name='ZFS_DELEG_NOTE_GROUPQUOTA' value='14'/>
      <enumerator name='ZFS_DELEG_NOTE_USERUSED' value='15'/>
      <enumerator name='ZFS_DELEG_NOTE_GROUPUSED' value='16'/>
      <enumerator name='ZFS_DELEG_NOTE_USEROBJQUOTA' value='17'/>
      <enumerator name='ZFS_DELEG_NOTE_GROUPOBJQUOTA' value='18'/>
      <enumerator name='ZFS_DELEG_NOTE_USEROBJUSED' value='19'/>
      <enumerator name='ZFS_DELEG_NOTE_GROUPOBJUSED' value='20'/>
      <enumerator name='ZFS_DELEG_NOTE_HOLD' value='21'/>
      <enumerator name='ZFS_DELEG_NOTE_RELEASE' value='22'/>
      <enumerator name='ZFS_DELEG_NOTE_DIFF' value='23'/>
      <enumerator name='ZFS_DELEG_NOTE_BOOKMARK' value='24'/>
      <enumerator name='ZFS_DELEG_NOTE_LOAD_KEY' value='25'/>
      <enumerator name='ZFS_DELEG_NOTE_CHANGE_KEY' value='26'/>
      <enumerator name='ZFS_DELEG_NOTE_PROJECTUSED' value='27'/>
      <enumerator name='ZFS_DELEG_NOTE_PROJECTQUOTA' value='28'/>
      <enumerator name='ZFS_DELEG_NOTE_PROJECTOBJUSED' value='29'/>
      <enumerator name='ZFS_DELEG_NOTE_PROJECTOBJQUOTA' value='30'/>
      <enumerator name='ZFS_DELEG_NOTE_NONE' value='31'/>
    </enum-decl>
    <typedef-decl name='zfs_deleg_who_type_t' type-id='type-id-53' id='type-id-54'/>
    <enum-decl name='__anonymous_enum__1' is-anonymous='yes' id='type-id-53'>
      <underlying-type type-id='type-id-9'/>
      <enumerator name='ZFS_DELEG_WHO_UNKNOWN' value='0'/>
      <enumerator name='ZFS_DELEG_USER' value='117'/>
      <enumerator name='ZFS_DELEG_USER_SETS' value='85'/>
      <enumerator name='ZFS_DELEG_GROUP' value='103'/>
      <enumerator name='ZFS_DELEG_GROUP_SETS' value='71'/>
      <enumerator name='ZFS_DELEG_EVERYONE' value='101'/>
      <enumerator name='ZFS_DELEG_EVERYONE_SETS' value='69'/>
      <enumerator name='ZFS_DELEG_CREATE' value='99'/>
      <enumerator name='ZFS_DELEG_CREATE_SETS' value='67'/>
      <enumerator name='ZFS_DELEG_NAMED_SET' value='115'/>
      <enumerator name='ZFS_DELEG_NAMED_SET_SETS' value='83'/>
    </enum-decl>
    <var-decl name='zfs_deleg_perm_tab' type-id='type-id-48' mangled-name='zfs_deleg_perm_tab' visibility='default' elf-symbol-id='zfs_deleg_perm_tab'/>
    <function-decl name='zfs_deleg_whokey' mangled-name='zfs_deleg_whokey' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_deleg_whokey'>
      <parameter type-id='type-id-1' name='attr'/>
      <parameter type-id='type-id-54' name='type'/>
      <parameter type-id='type-id-6' name='inheritchr'/>
      <parameter type-id='type-id-55' name='data'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_deleg_verify_nvlist' mangled-name='zfs_deleg_verify_nvlist' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_deleg_verify_nvlist'>
      <parameter type-id='type-id-40' name='nvp'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_deleg_canonicalize_perm' mangled-name='zfs_deleg_canonicalize_perm' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_deleg_canonicalize_perm'>
      <parameter type-id='type-id-3' name='perm'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <pointer-type-def type-id='type-id-4' size-in-bits='64' id='type-id-55'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../../module/zcommon/zfs_fletcher.c' comp-dir-path='/home/brian/zfs_directio_pr/lib/libzfs' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-19' size-in-bits='256' id='type-id-56'>
      <subrange length='4' type-id='type-id-11' id='type-id-57'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-19' size-in-bits='512' id='type-id-58'>
      <subrange length='8' type-id='type-id-11' id='type-id-59'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-60' size-in-bits='2048' id='type-id-61'>
      <subrange length='4' type-id='type-id-11' id='type-id-57'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-62' size-in-bits='1024' id='type-id-63'>
      <subrange length='4' type-id='type-id-11' id='type-id-57'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-64' size-in-bits='512' id='type-id-65'>
      <subrange length='4' type-id='type-id-11' id='type-id-57'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-66' size-in-bits='1024' id='type-id-67'>
      <subrange length='4' type-id='type-id-11' id='type-id-57'/>
    </array-type-def>
    <typedef-decl name='zio_abd_checksum_func_t' type-id='type-id-68' id='type-id-69'/>
    <class-decl name='zio_abd_checksum_func' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-70'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='acf_init' type-id='type-id-71' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='acf_fini' type-id='type-id-72' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='acf_iter' type-id='type-id-73' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zio_abd_checksum_init_t' type-id='type-id-74' id='type-id-75'/>
    <typedef-decl name='zio_abd_checksum_data_t' type-id='type-id-76' id='type-id-77'/>
    <class-decl name='zio_abd_checksum_data' size-in-bits='256' is-struct='yes' visibility='default' id='type-id-76'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='acd_byteorder' type-id='type-id-78' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='acd_ctx' type-id='type-id-79' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='acd_zcp' type-id='type-id-80' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='acd_private' type-id='type-id-55' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zio_byteorder_t' type-id='type-id-81' id='type-id-78'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-81'>
      <underlying-type type-id='type-id-9'/>
      <enumerator name='ZIO_CHECKSUM_NATIVE' value='0'/>
      <enumerator name='ZIO_CHECKSUM_BYTESWAP' value='1'/>
    </enum-decl>
    <typedef-decl name='fletcher_4_ctx_t' type-id='type-id-82' id='type-id-83'/>
    <union-decl name='fletcher_4_ctx' size-in-bits='2048' visibility='default' id='type-id-82'>
      <data-member access='private'>
        <var-decl name='scalar' type-id='type-id-84' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='superscalar' type-id='type-id-67' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='sse' type-id='type-id-65' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='avx' type-id='type-id-63' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='avx512' type-id='type-id-61' visibility='default'/>
      </data-member>
    </union-decl>
    <typedef-decl name='zio_cksum_t' type-id='type-id-85' id='type-id-84'/>
    <class-decl name='zio_cksum' size-in-bits='256' is-struct='yes' visibility='default' id='type-id-85'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zc_word' type-id='type-id-56' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zfs_fletcher_superscalar_t' type-id='type-id-86' id='type-id-66'/>
    <class-decl name='zfs_fletcher_superscalar' size-in-bits='256' is-struct='yes' visibility='default' id='type-id-86'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='v' type-id='type-id-56' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zfs_fletcher_sse_t' type-id='type-id-87' id='type-id-64'/>
    <class-decl name='zfs_fletcher_sse' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-87'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='v' type-id='type-id-88' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zfs_fletcher_avx_t' type-id='type-id-89' id='type-id-62'/>
    <class-decl name='zfs_fletcher_avx' size-in-bits='256' is-struct='yes' visibility='default' id='type-id-89'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='v' type-id='type-id-56' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zfs_fletcher_avx512_t' type-id='type-id-90' id='type-id-60'/>
    <class-decl name='zfs_fletcher_avx512' size-in-bits='512' is-struct='yes' visibility='default' id='type-id-90'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='v' type-id='type-id-58' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zio_abd_checksum_fini_t' type-id='type-id-74' id='type-id-91'/>
    <typedef-decl name='zio_abd_checksum_iter_t' type-id='type-id-92' id='type-id-93'/>
    <qualified-type-def type-id='type-id-70' const='yes' id='type-id-68'/>
    <pointer-type-def type-id='type-id-83' size-in-bits='64' id='type-id-79'/>
    <pointer-type-def type-id='type-id-77' size-in-bits='64' id='type-id-94'/>
    <pointer-type-def type-id='type-id-91' size-in-bits='64' id='type-id-72'/>
    <pointer-type-def type-id='type-id-75' size-in-bits='64' id='type-id-71'/>
    <pointer-type-def type-id='type-id-93' size-in-bits='64' id='type-id-73'/>
    <pointer-type-def type-id='type-id-84' size-in-bits='64' id='type-id-80'/>
    <var-decl name='fletcher_4_abd_ops' type-id='type-id-69' mangled-name='fletcher_4_abd_ops' visibility='default' elf-symbol-id='fletcher_4_abd_ops'/>
    <function-decl name='fletcher_4_fini' mangled-name='fletcher_4_fini' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fletcher_4_fini'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='fletcher_4_init' mangled-name='fletcher_4_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fletcher_4_init'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='fletcher_4_incremental_byteswap' mangled-name='fletcher_4_incremental_byteswap' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fletcher_4_incremental_byteswap'>
      <parameter type-id='type-id-55' name='buf'/>
      <parameter type-id='type-id-95' name='size'/>
      <parameter type-id='type-id-55' name='data'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fletcher_4_incremental_native' mangled-name='fletcher_4_incremental_native' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fletcher_4_incremental_native'>
      <parameter type-id='type-id-55' name='buf'/>
      <parameter type-id='type-id-95' name='size'/>
      <parameter type-id='type-id-55' name='data'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fletcher_4_byteswap' mangled-name='fletcher_4_byteswap' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fletcher_4_byteswap'>
      <parameter type-id='type-id-55' name='buf'/>
      <parameter type-id='type-id-19' name='size'/>
      <parameter type-id='type-id-55' name='ctx_template'/>
      <parameter type-id='type-id-80' name='zcp'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='fletcher_4_native_varsize' mangled-name='fletcher_4_native_varsize' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fletcher_4_native_varsize'>
      <parameter type-id='type-id-55' name='buf'/>
      <parameter type-id='type-id-19' name='size'/>
      <parameter type-id='type-id-80' name='zcp'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='fletcher_4_native' mangled-name='fletcher_4_native' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fletcher_4_native'>
      <parameter type-id='type-id-55' name='buf'/>
      <parameter type-id='type-id-19' name='size'/>
      <parameter type-id='type-id-55' name='ctx_template'/>
      <parameter type-id='type-id-80' name='zcp'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='fletcher_4_impl_set' mangled-name='fletcher_4_impl_set' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fletcher_4_impl_set'>
      <parameter type-id='type-id-3' name='val'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fletcher_2_byteswap' mangled-name='fletcher_2_byteswap' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fletcher_2_byteswap'>
      <parameter type-id='type-id-55' name='buf'/>
      <parameter type-id='type-id-19' name='size'/>
      <parameter type-id='type-id-55' name='ctx_template'/>
      <parameter type-id='type-id-80' name='zcp'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='fletcher_2_incremental_byteswap' mangled-name='fletcher_2_incremental_byteswap' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fletcher_2_incremental_byteswap'>
      <parameter type-id='type-id-55' name='buf'/>
      <parameter type-id='type-id-95' name='size'/>
      <parameter type-id='type-id-55' name='data'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fletcher_2_native' mangled-name='fletcher_2_native' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fletcher_2_native'>
      <parameter type-id='type-id-55' name='buf'/>
      <parameter type-id='type-id-19' name='size'/>
      <parameter type-id='type-id-55' name='ctx_template'/>
      <parameter type-id='type-id-80' name='zcp'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='fletcher_2_incremental_native' mangled-name='fletcher_2_incremental_native' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fletcher_2_incremental_native'>
      <parameter type-id='type-id-55' name='buf'/>
      <parameter type-id='type-id-95' name='size'/>
      <parameter type-id='type-id-55' name='data'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fletcher_init' mangled-name='fletcher_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fletcher_init'>
      <parameter type-id='type-id-80' name='zcp'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-92'>
      <parameter type-id='type-id-55'/>
      <parameter type-id='type-id-95'/>
      <parameter type-id='type-id-55'/>
      <return type-id='type-id-2'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-74'>
      <parameter type-id='type-id-94'/>
      <return type-id='type-id-4'/>
    </function-type>
    <typedef-decl name='size_t' type-id='type-id-11' id='type-id-95'/>
    <array-type-def dimensions='1' type-id='type-id-19' size-in-bits='128' id='type-id-88'>
      <subrange length='2' type-id='type-id-11' id='type-id-96'/>
    </array-type-def>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../../module/zcommon/zfs_fletcher_avx512.c' comp-dir-path='/home/brian/zfs_directio_pr/lib/libzfs' language='LANG_C99'>
    <typedef-decl name='fletcher_4_ops_t' type-id='type-id-97' id='type-id-98'/>
    <class-decl name='fletcher_4_func' size-in-bits='512' is-struct='yes' visibility='default' id='type-id-97'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='init_native' type-id='type-id-99' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fini_native' type-id='type-id-100' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='compute_native' type-id='type-id-101' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='init_byteswap' type-id='type-id-99' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='fini_byteswap' type-id='type-id-100' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='compute_byteswap' type-id='type-id-101' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='valid' type-id='type-id-102' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='name' type-id='type-id-3' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='fletcher_4_init_f' type-id='type-id-103' id='type-id-99'/>
    <typedef-decl name='fletcher_4_fini_f' type-id='type-id-104' id='type-id-100'/>
    <typedef-decl name='fletcher_4_compute_f' type-id='type-id-105' id='type-id-101'/>
    <qualified-type-def type-id='type-id-98' const='yes' id='type-id-106'/>
    <pointer-type-def type-id='type-id-107' size-in-bits='64' id='type-id-102'/>
    <pointer-type-def type-id='type-id-108' size-in-bits='64' id='type-id-103'/>
    <pointer-type-def type-id='type-id-109' size-in-bits='64' id='type-id-105'/>
    <pointer-type-def type-id='type-id-110' size-in-bits='64' id='type-id-104'/>
    <var-decl name='fletcher_4_avx512f_ops' type-id='type-id-106' mangled-name='fletcher_4_avx512f_ops' visibility='default' elf-symbol-id='fletcher_4_avx512f_ops'/>
    <var-decl name='fletcher_4_avx512bw_ops' type-id='type-id-106' mangled-name='fletcher_4_avx512bw_ops' visibility='default' elf-symbol-id='fletcher_4_avx512bw_ops'/>
    <function-type size-in-bits='64' id='type-id-107'>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-108'>
      <parameter type-id='type-id-79'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-109'>
      <parameter type-id='type-id-79'/>
      <parameter type-id='type-id-55'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-110'>
      <parameter type-id='type-id-79'/>
      <parameter type-id='type-id-80'/>
      <return type-id='type-id-4'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../../module/zcommon/zfs_fletcher_intel.c' comp-dir-path='/home/brian/zfs_directio_pr/lib/libzfs' language='LANG_C99'>
    <var-decl name='fletcher_4_avx2_ops' type-id='type-id-106' mangled-name='fletcher_4_avx2_ops' visibility='default' elf-symbol-id='fletcher_4_avx2_ops'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../../module/zcommon/zfs_fletcher_sse.c' comp-dir-path='/home/brian/zfs_directio_pr/lib/libzfs' language='LANG_C99'>
    <var-decl name='fletcher_4_sse2_ops' type-id='type-id-106' mangled-name='fletcher_4_sse2_ops' visibility='default' elf-symbol-id='fletcher_4_sse2_ops'/>
    <var-decl name='fletcher_4_ssse3_ops' type-id='type-id-106' mangled-name='fletcher_4_ssse3_ops' visibility='default' elf-symbol-id='fletcher_4_ssse3_ops'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../../module/zcommon/zfs_fletcher_superscalar.c' comp-dir-path='/home/brian/zfs_directio_pr/lib/libzfs' language='LANG_C99'>
    <var-decl name='fletcher_4_superscalar_ops' type-id='type-id-106' mangled-name='fletcher_4_superscalar_ops' visibility='default' elf-symbol-id='fletcher_4_superscalar_ops'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../../module/zcommon/zfs_fletcher_superscalar4.c' comp-dir-path='/home/brian/zfs_directio_pr/lib/libzfs' language='LANG_C99'>
    <var-decl name='fletcher_4_superscalar4_ops' type-id='type-id-106' mangled-name='fletcher_4_superscalar4_ops' visibility='default' elf-symbol-id='fletcher_4_superscalar4_ops'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../../module/zcommon/zfs_namecheck.c' comp-dir-path='/home/brian/zfs_directio_pr/lib/libzfs' language='LANG_C99'>
    <typedef-decl name='namecheck_err_t' type-id='type-id-111' id='type-id-112'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-111'>
      <underlying-type type-id='type-id-9'/>
      <enumerator name='NAME_ERR_LEADING_SLASH' value='0'/>
      <enumerator name='NAME_ERR_EMPTY_COMPONENT' value='1'/>
      <enumerator name='NAME_ERR_TRAILING_SLASH' value='2'/>
      <enumerator name='NAME_ERR_INVALCHAR' value='3'/>
      <enumerator name='NAME_ERR_MULTIPLE_DELIMITERS' value='4'/>
      <enumerator name='NAME_ERR_NOLETTER' value='5'/>
      <enumerator name='NAME_ERR_RESERVED' value='6'/>
      <enumerator name='NAME_ERR_DISKLIKE' value='7'/>
      <enumerator name='NAME_ERR_TOOLONG' value='8'/>
      <enumerator name='NAME_ERR_SELF_REF' value='9'/>
      <enumerator name='NAME_ERR_PARENT_REF' value='10'/>
      <enumerator name='NAME_ERR_NO_AT' value='11'/>
      <enumerator name='NAME_ERR_NO_POUND' value='12'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-112' size-in-bits='64' id='type-id-113'/>
    <var-decl name='zfs_max_dataset_nesting' type-id='type-id-2' mangled-name='zfs_max_dataset_nesting' visibility='default' elf-symbol-id='zfs_max_dataset_nesting'/>
    <function-decl name='pool_namecheck' mangled-name='pool_namecheck' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='pool_namecheck'>
      <parameter type-id='type-id-3' name='pool'/>
      <parameter type-id='type-id-113' name='why'/>
      <parameter type-id='type-id-1' name='what'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='mountpoint_namecheck' mangled-name='mountpoint_namecheck' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='mountpoint_namecheck'>
      <parameter type-id='type-id-3' name='path'/>
      <parameter type-id='type-id-113' name='why'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='snapshot_namecheck' mangled-name='snapshot_namecheck' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='snapshot_namecheck'>
      <parameter type-id='type-id-3' name='path'/>
      <parameter type-id='type-id-113' name='why'/>
      <parameter type-id='type-id-1' name='what'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='bookmark_namecheck' mangled-name='bookmark_namecheck' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='bookmark_namecheck'>
      <parameter type-id='type-id-3' name='path'/>
      <parameter type-id='type-id-113' name='why'/>
      <parameter type-id='type-id-1' name='what'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='dataset_namecheck' mangled-name='dataset_namecheck' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dataset_namecheck'>
      <parameter type-id='type-id-3' name='path'/>
      <parameter type-id='type-id-113' name='why'/>
      <parameter type-id='type-id-1' name='what'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='entity_namecheck' mangled-name='entity_namecheck' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='entity_namecheck'>
      <parameter type-id='type-id-3' name='path'/>
      <parameter type-id='type-id-113' name='why'/>
      <parameter type-id='type-id-1' name='what'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='dataset_nestcheck' mangled-name='dataset_nestcheck' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dataset_nestcheck'>
      <parameter type-id='type-id-3' name='path'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='permset_namecheck' mangled-name='permset_namecheck' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='permset_namecheck'>
      <parameter type-id='type-id-3' name='path'/>
      <parameter type-id='type-id-113' name='why'/>
      <parameter type-id='type-id-1' name='what'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_component_namecheck' mangled-name='zfs_component_namecheck' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_component_namecheck'>
      <parameter type-id='type-id-3' name='path'/>
      <parameter type-id='type-id-113' name='why'/>
      <parameter type-id='type-id-1' name='what'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='get_dataset_depth' mangled-name='get_dataset_depth' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='get_dataset_depth'>
      <parameter type-id='type-id-3' name='path'/>
      <return type-id='type-id-2'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../../module/zcommon/zfs_prop.c' comp-dir-path='/home/brian/zfs_directio_pr/lib/libzfs' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-3' size-in-bits='768' id='type-id-114'>
      <subrange length='12' type-id='type-id-11' id='type-id-115'/>
    </array-type-def>
    <typedef-decl name='zprop_type_t' type-id='type-id-116' id='type-id-117'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-116'>
      <underlying-type type-id='type-id-9'/>
      <enumerator name='PROP_TYPE_NUMBER' value='0'/>
      <enumerator name='PROP_TYPE_STRING' value='1'/>
      <enumerator name='PROP_TYPE_INDEX' value='2'/>
    </enum-decl>
    <typedef-decl name='zprop_desc_t' type-id='type-id-118' id='type-id-119'/>
    <class-decl name='__anonymous_struct__' size-in-bits='704' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-119' visibility='default' id='type-id-118'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pd_name' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pd_propnum' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='pd_proptype' type-id='type-id-117' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pd_strdefault' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='pd_numdefault' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='pd_attr' type-id='type-id-120' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='pd_types' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='pd_values' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='pd_colname' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='pd_rightalign' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='pd_visible' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='pd_zfs_mod_supported' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='pd_table' type-id='type-id-121' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='pd_table_size' type-id='type-id-95' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zprop_attr_t' type-id='type-id-122' id='type-id-120'/>
    <enum-decl name='__anonymous_enum__1' is-anonymous='yes' id='type-id-122'>
      <underlying-type type-id='type-id-9'/>
      <enumerator name='PROP_DEFAULT' value='0'/>
      <enumerator name='PROP_READONLY' value='1'/>
      <enumerator name='PROP_INHERIT' value='2'/>
      <enumerator name='PROP_ONETIME' value='3'/>
      <enumerator name='PROP_ONETIME_DEFAULT' value='4'/>
    </enum-decl>
    <typedef-decl name='zprop_index_t' type-id='type-id-123' id='type-id-124'/>
    <class-decl name='zfs_index' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-123'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pi_name' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pi_value' type-id='type-id-19' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-3' size-in-bits='64' id='type-id-125'/>
    <qualified-type-def type-id='type-id-124' const='yes' id='type-id-126'/>
    <pointer-type-def type-id='type-id-126' size-in-bits='64' id='type-id-121'/>
    <pointer-type-def type-id='type-id-119' size-in-bits='64' id='type-id-127'/>
    <var-decl name='zfs_userquota_prop_prefixes' type-id='type-id-114' mangled-name='zfs_userquota_prop_prefixes' visibility='default' elf-symbol-id='zfs_userquota_prop_prefixes'/>
    <function-decl name='zfs_prop_align_right' mangled-name='zfs_prop_align_right' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_align_right'>
      <parameter type-id='type-id-128' name='prop'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zfs_prop_column_name' mangled-name='zfs_prop_column_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_column_name'>
      <parameter type-id='type-id-128' name='prop'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='zfs_prop_is_string' mangled-name='zfs_prop_is_string' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_is_string'>
      <parameter type-id='type-id-128' name='prop'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_prop_values' mangled-name='zfs_prop_values' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_values'>
      <parameter type-id='type-id-128' name='prop'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='zfs_prop_valid_keylocation' mangled-name='zfs_prop_valid_keylocation' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_valid_keylocation'>
      <parameter type-id='type-id-3' name='str'/>
      <parameter type-id='type-id-5' name='encrypted'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zfs_prop_encryption_key_param' mangled-name='zfs_prop_encryption_key_param' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_encryption_key_param'>
      <parameter type-id='type-id-128' name='prop'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zfs_prop_inheritable' mangled-name='zfs_prop_inheritable' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_inheritable'>
      <parameter type-id='type-id-128' name='prop'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zfs_prop_to_name' mangled-name='zfs_prop_to_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_to_name'>
      <parameter type-id='type-id-128' name='prop'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='zfs_prop_default_numeric' mangled-name='zfs_prop_default_numeric' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_default_numeric'>
      <parameter type-id='type-id-128' name='prop'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='zfs_prop_default_string' mangled-name='zfs_prop_default_string' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_default_string'>
      <parameter type-id='type-id-128' name='prop'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='zfs_prop_setonce' mangled-name='zfs_prop_setonce' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_setonce'>
      <parameter type-id='type-id-128' name='prop'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zfs_prop_visible' mangled-name='zfs_prop_visible' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_visible'>
      <parameter type-id='type-id-128' name='prop'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zfs_prop_readonly' mangled-name='zfs_prop_readonly' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_readonly'>
      <parameter type-id='type-id-128' name='prop'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zfs_prop_get_type' mangled-name='zfs_prop_get_type' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_type'>
      <parameter type-id='type-id-128' name='prop'/>
      <return type-id='type-id-117'/>
    </function-decl>
    <function-decl name='zfs_prop_valid_for_type' mangled-name='zfs_prop_valid_for_type' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_valid_for_type'>
      <parameter type-id='type-id-2' name='prop'/>
      <parameter type-id='type-id-129' name='types'/>
      <parameter type-id='type-id-5' name='headcheck'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zfs_prop_random_value' mangled-name='zfs_prop_random_value' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_random_value'>
      <parameter type-id='type-id-128' name='prop'/>
      <parameter type-id='type-id-19' name='seed'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='zfs_prop_index_to_string' mangled-name='zfs_prop_index_to_string' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_index_to_string'>
      <parameter type-id='type-id-128' name='prop'/>
      <parameter type-id='type-id-19' name='index'/>
      <parameter type-id='type-id-125' name='string'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_prop_string_to_index' mangled-name='zfs_prop_string_to_index' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_string_to_index'>
      <parameter type-id='type-id-128' name='prop'/>
      <parameter type-id='type-id-3' name='string'/>
      <parameter type-id='type-id-130' name='index'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_prop_written' mangled-name='zfs_prop_written' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_written'>
      <parameter type-id='type-id-3' name='name'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zfs_prop_userquota' mangled-name='zfs_prop_userquota' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_userquota'>
      <parameter type-id='type-id-3' name='name'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zfs_prop_user' mangled-name='zfs_prop_user' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_user'>
      <parameter type-id='type-id-3' name='name'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zfs_name_to_prop' mangled-name='zfs_name_to_prop' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_name_to_prop'>
      <parameter type-id='type-id-3' name='propname'/>
      <return type-id='type-id-128'/>
    </function-decl>
    <function-decl name='zfs_prop_delegatable' mangled-name='zfs_prop_delegatable' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_delegatable'>
      <parameter type-id='type-id-128' name='prop'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zfs_prop_init' mangled-name='zfs_prop_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_init'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_prop_get_table' mangled-name='zfs_prop_get_table' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_table'>
      <return type-id='type-id-127'/>
    </function-decl>
    <typedef-decl name='zfs_prop_t' type-id='type-id-131' id='type-id-128'/>
    <typedef-decl name='zfs_type_t' type-id='type-id-132' id='type-id-129'/>
    <pointer-type-def type-id='type-id-19' size-in-bits='64' id='type-id-130'/>
    <enum-decl name='__anonymous_enum__1' is-anonymous='yes' id='type-id-132'>
      <underlying-type type-id='type-id-9'/>
      <enumerator name='ZFS_TYPE_FILESYSTEM' value='1'/>
      <enumerator name='ZFS_TYPE_SNAPSHOT' value='2'/>
      <enumerator name='ZFS_TYPE_VOLUME' value='4'/>
      <enumerator name='ZFS_TYPE_POOL' value='8'/>
      <enumerator name='ZFS_TYPE_BOOKMARK' value='16'/>
    </enum-decl>
    <enum-decl name='__anonymous_enum__2' is-anonymous='yes' id='type-id-131'>
      <underlying-type type-id='type-id-9'/>
      <enumerator name='ZPROP_CONT' value='-2'/>
      <enumerator name='ZPROP_INVAL' value='-1'/>
      <enumerator name='ZFS_PROP_TYPE' value='0'/>
      <enumerator name='ZFS_PROP_CREATION' value='1'/>
      <enumerator name='ZFS_PROP_USED' value='2'/>
      <enumerator name='ZFS_PROP_AVAILABLE' value='3'/>
      <enumerator name='ZFS_PROP_REFERENCED' value='4'/>
      <enumerator name='ZFS_PROP_COMPRESSRATIO' value='5'/>
      <enumerator name='ZFS_PROP_MOUNTED' value='6'/>
      <enumerator name='ZFS_PROP_ORIGIN' value='7'/>
      <enumerator name='ZFS_PROP_QUOTA' value='8'/>
      <enumerator name='ZFS_PROP_RESERVATION' value='9'/>
      <enumerator name='ZFS_PROP_VOLSIZE' value='10'/>
      <enumerator name='ZFS_PROP_VOLBLOCKSIZE' value='11'/>
      <enumerator name='ZFS_PROP_RECORDSIZE' value='12'/>
      <enumerator name='ZFS_PROP_MOUNTPOINT' value='13'/>
      <enumerator name='ZFS_PROP_SHARENFS' value='14'/>
      <enumerator name='ZFS_PROP_CHECKSUM' value='15'/>
      <enumerator name='ZFS_PROP_COMPRESSION' value='16'/>
      <enumerator name='ZFS_PROP_ATIME' value='17'/>
      <enumerator name='ZFS_PROP_DEVICES' value='18'/>
      <enumerator name='ZFS_PROP_EXEC' value='19'/>
      <enumerator name='ZFS_PROP_SETUID' value='20'/>
      <enumerator name='ZFS_PROP_READONLY' value='21'/>
      <enumerator name='ZFS_PROP_ZONED' value='22'/>
      <enumerator name='ZFS_PROP_SNAPDIR' value='23'/>
      <enumerator name='ZFS_PROP_ACLMODE' value='24'/>
      <enumerator name='ZFS_PROP_ACLINHERIT' value='25'/>
      <enumerator name='ZFS_PROP_CREATETXG' value='26'/>
      <enumerator name='ZFS_PROP_NAME' value='27'/>
      <enumerator name='ZFS_PROP_CANMOUNT' value='28'/>
      <enumerator name='ZFS_PROP_ISCSIOPTIONS' value='29'/>
      <enumerator name='ZFS_PROP_XATTR' value='30'/>
      <enumerator name='ZFS_PROP_NUMCLONES' value='31'/>
      <enumerator name='ZFS_PROP_COPIES' value='32'/>
      <enumerator name='ZFS_PROP_VERSION' value='33'/>
      <enumerator name='ZFS_PROP_UTF8ONLY' value='34'/>
      <enumerator name='ZFS_PROP_NORMALIZE' value='35'/>
      <enumerator name='ZFS_PROP_CASE' value='36'/>
      <enumerator name='ZFS_PROP_VSCAN' value='37'/>
      <enumerator name='ZFS_PROP_NBMAND' value='38'/>
      <enumerator name='ZFS_PROP_SHARESMB' value='39'/>
      <enumerator name='ZFS_PROP_REFQUOTA' value='40'/>
      <enumerator name='ZFS_PROP_REFRESERVATION' value='41'/>
      <enumerator name='ZFS_PROP_GUID' value='42'/>
      <enumerator name='ZFS_PROP_PRIMARYCACHE' value='43'/>
      <enumerator name='ZFS_PROP_SECONDARYCACHE' value='44'/>
      <enumerator name='ZFS_PROP_USEDSNAP' value='45'/>
      <enumerator name='ZFS_PROP_USEDDS' value='46'/>
      <enumerator name='ZFS_PROP_USEDCHILD' value='47'/>
      <enumerator name='ZFS_PROP_USEDREFRESERV' value='48'/>
      <enumerator name='ZFS_PROP_USERACCOUNTING' value='49'/>
      <enumerator name='ZFS_PROP_STMF_SHAREINFO' value='50'/>
      <enumerator name='ZFS_PROP_DEFER_DESTROY' value='51'/>
      <enumerator name='ZFS_PROP_USERREFS' value='52'/>
      <enumerator name='ZFS_PROP_LOGBIAS' value='53'/>
      <enumerator name='ZFS_PROP_UNIQUE' value='54'/>
      <enumerator name='ZFS_PROP_OBJSETID' value='55'/>
      <enumerator name='ZFS_PROP_DEDUP' value='56'/>
      <enumerator name='ZFS_PROP_MLSLABEL' value='57'/>
      <enumerator name='ZFS_PROP_SYNC' value='58'/>
      <enumerator name='ZFS_PROP_DNODESIZE' value='59'/>
      <enumerator name='ZFS_PROP_REFRATIO' value='60'/>
      <enumerator name='ZFS_PROP_WRITTEN' value='61'/>
      <enumerator name='ZFS_PROP_CLONES' value='62'/>
      <enumerator name='ZFS_PROP_LOGICALUSED' value='63'/>
      <enumerator name='ZFS_PROP_LOGICALREFERENCED' value='64'/>
      <enumerator name='ZFS_PROP_INCONSISTENT' value='65'/>
      <enumerator name='ZFS_PROP_VOLMODE' value='66'/>
      <enumerator name='ZFS_PROP_FILESYSTEM_LIMIT' value='67'/>
      <enumerator name='ZFS_PROP_SNAPSHOT_LIMIT' value='68'/>
      <enumerator name='ZFS_PROP_FILESYSTEM_COUNT' value='69'/>
      <enumerator name='ZFS_PROP_SNAPSHOT_COUNT' value='70'/>
      <enumerator name='ZFS_PROP_SNAPDEV' value='71'/>
      <enumerator name='ZFS_PROP_ACLTYPE' value='72'/>
      <enumerator name='ZFS_PROP_SELINUX_CONTEXT' value='73'/>
      <enumerator name='ZFS_PROP_SELINUX_FSCONTEXT' value='74'/>
      <enumerator name='ZFS_PROP_SELINUX_DEFCONTEXT' value='75'/>
      <enumerator name='ZFS_PROP_SELINUX_ROOTCONTEXT' value='76'/>
      <enumerator name='ZFS_PROP_RELATIME' value='77'/>
      <enumerator name='ZFS_PROP_REDUNDANT_METADATA' value='78'/>
      <enumerator name='ZFS_PROP_OVERLAY' value='79'/>
      <enumerator name='ZFS_PROP_PREV_SNAP' value='80'/>
      <enumerator name='ZFS_PROP_RECEIVE_RESUME_TOKEN' value='81'/>
      <enumerator name='ZFS_PROP_ENCRYPTION' value='82'/>
      <enumerator name='ZFS_PROP_KEYLOCATION' value='83'/>
      <enumerator name='ZFS_PROP_KEYFORMAT' value='84'/>
      <enumerator name='ZFS_PROP_PBKDF2_SALT' value='85'/>
      <enumerator name='ZFS_PROP_PBKDF2_ITERS' value='86'/>
      <enumerator name='ZFS_PROP_ENCRYPTION_ROOT' value='87'/>
      <enumerator name='ZFS_PROP_KEY_GUID' value='88'/>
      <enumerator name='ZFS_PROP_KEYSTATUS' value='89'/>
      <enumerator name='ZFS_PROP_REMAPTXG' value='90'/>
      <enumerator name='ZFS_PROP_SPECIAL_SMALL_BLOCKS' value='91'/>
      <enumerator name='ZFS_PROP_IVSET_GUID' value='92'/>
      <enumerator name='ZFS_PROP_REDACTED' value='93'/>
      <enumerator name='ZFS_PROP_REDACT_SNAPS' value='94'/>
      <enumerator name='ZFS_PROP_DIRECT' value='95'/>
      <enumerator name='ZFS_NUM_PROPS' value='96'/>
    </enum-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../../module/zcommon/zpool_prop.c' comp-dir-path='/home/brian/zfs_directio_pr/lib/libzfs' language='LANG_C99'>
    <function-decl name='zpool_prop_align_right' mangled-name='zpool_prop_align_right' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_prop_align_right'>
      <parameter type-id='type-id-133' name='prop'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zpool_prop_column_name' mangled-name='zpool_prop_column_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_prop_column_name'>
      <parameter type-id='type-id-133' name='prop'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='zpool_prop_values' mangled-name='zpool_prop_values' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_prop_values'>
      <parameter type-id='type-id-133' name='prop'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='zpool_prop_random_value' mangled-name='zpool_prop_random_value' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_prop_random_value'>
      <parameter type-id='type-id-133' name='prop'/>
      <parameter type-id='type-id-19' name='seed'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='zpool_prop_index_to_string' mangled-name='zpool_prop_index_to_string' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_prop_index_to_string'>
      <parameter type-id='type-id-133' name='prop'/>
      <parameter type-id='type-id-19' name='index'/>
      <parameter type-id='type-id-125' name='string'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zpool_prop_string_to_index' mangled-name='zpool_prop_string_to_index' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_prop_string_to_index'>
      <parameter type-id='type-id-133' name='prop'/>
      <parameter type-id='type-id-3' name='string'/>
      <parameter type-id='type-id-130' name='index'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zpool_prop_unsupported' mangled-name='zpool_prop_unsupported' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_prop_unsupported'>
      <parameter type-id='type-id-3' name='name'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zpool_prop_feature' mangled-name='zpool_prop_feature' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_prop_feature'>
      <parameter type-id='type-id-3' name='name'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zpool_prop_default_numeric' mangled-name='zpool_prop_default_numeric' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_prop_default_numeric'>
      <parameter type-id='type-id-133' name='prop'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='zpool_prop_default_string' mangled-name='zpool_prop_default_string' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_prop_default_string'>
      <parameter type-id='type-id-133' name='prop'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='zpool_prop_setonce' mangled-name='zpool_prop_setonce' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_prop_setonce'>
      <parameter type-id='type-id-133' name='prop'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zpool_prop_readonly' mangled-name='zpool_prop_readonly' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_prop_readonly'>
      <parameter type-id='type-id-133' name='prop'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zpool_prop_get_type' mangled-name='zpool_prop_get_type' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_prop_get_type'>
      <parameter type-id='type-id-133' name='prop'/>
      <return type-id='type-id-117'/>
    </function-decl>
    <function-decl name='zpool_prop_to_name' mangled-name='zpool_prop_to_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_prop_to_name'>
      <parameter type-id='type-id-133' name='prop'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='zpool_name_to_prop' mangled-name='zpool_name_to_prop' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_name_to_prop'>
      <parameter type-id='type-id-3' name='propname'/>
      <return type-id='type-id-133'/>
    </function-decl>
    <function-decl name='zpool_prop_init' mangled-name='zpool_prop_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_prop_init'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zpool_prop_get_table' mangled-name='zpool_prop_get_table' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_prop_get_table'>
      <return type-id='type-id-127'/>
    </function-decl>
    <typedef-decl name='zpool_prop_t' type-id='type-id-134' id='type-id-133'/>
    <enum-decl name='__anonymous_enum__2' is-anonymous='yes' id='type-id-134'>
      <underlying-type type-id='type-id-9'/>
      <enumerator name='ZPOOL_PROP_INVAL' value='-1'/>
      <enumerator name='ZPOOL_PROP_NAME' value='0'/>
      <enumerator name='ZPOOL_PROP_SIZE' value='1'/>
      <enumerator name='ZPOOL_PROP_CAPACITY' value='2'/>
      <enumerator name='ZPOOL_PROP_ALTROOT' value='3'/>
      <enumerator name='ZPOOL_PROP_HEALTH' value='4'/>
      <enumerator name='ZPOOL_PROP_GUID' value='5'/>
      <enumerator name='ZPOOL_PROP_VERSION' value='6'/>
      <enumerator name='ZPOOL_PROP_BOOTFS' value='7'/>
      <enumerator name='ZPOOL_PROP_DELEGATION' value='8'/>
      <enumerator name='ZPOOL_PROP_AUTOREPLACE' value='9'/>
      <enumerator name='ZPOOL_PROP_CACHEFILE' value='10'/>
      <enumerator name='ZPOOL_PROP_FAILUREMODE' value='11'/>
      <enumerator name='ZPOOL_PROP_LISTSNAPS' value='12'/>
      <enumerator name='ZPOOL_PROP_AUTOEXPAND' value='13'/>
      <enumerator name='ZPOOL_PROP_DEDUPDITTO' value='14'/>
      <enumerator name='ZPOOL_PROP_DEDUPRATIO' value='15'/>
      <enumerator name='ZPOOL_PROP_FREE' value='16'/>
      <enumerator name='ZPOOL_PROP_ALLOCATED' value='17'/>
      <enumerator name='ZPOOL_PROP_READONLY' value='18'/>
      <enumerator name='ZPOOL_PROP_ASHIFT' value='19'/>
      <enumerator name='ZPOOL_PROP_COMMENT' value='20'/>
      <enumerator name='ZPOOL_PROP_EXPANDSZ' value='21'/>
      <enumerator name='ZPOOL_PROP_FREEING' value='22'/>
      <enumerator name='ZPOOL_PROP_FRAGMENTATION' value='23'/>
      <enumerator name='ZPOOL_PROP_LEAKED' value='24'/>
      <enumerator name='ZPOOL_PROP_MAXBLOCKSIZE' value='25'/>
      <enumerator name='ZPOOL_PROP_TNAME' value='26'/>
      <enumerator name='ZPOOL_PROP_MAXDNODESIZE' value='27'/>
      <enumerator name='ZPOOL_PROP_MULTIHOST' value='28'/>
      <enumerator name='ZPOOL_PROP_CHECKPOINT' value='29'/>
      <enumerator name='ZPOOL_PROP_LOAD_GUID' value='30'/>
      <enumerator name='ZPOOL_PROP_AUTOTRIM' value='31'/>
      <enumerator name='ZPOOL_PROP_COMPATIBILITY' value='32'/>
      <enumerator name='ZPOOL_NUM_PROPS' value='33'/>
    </enum-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../../module/zcommon/zprop_common.c' comp-dir-path='/home/brian/zfs_directio_pr/lib/libzfs' language='LANG_C99'>
    <function-decl name='zprop_width' mangled-name='zprop_width' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zprop_width'>
      <parameter type-id='type-id-2' name='prop'/>
      <parameter type-id='type-id-135' name='fixed'/>
      <parameter type-id='type-id-129' name='type'/>
      <return type-id='type-id-95'/>
    </function-decl>
    <function-decl name='zprop_valid_for_type' mangled-name='zprop_valid_for_type' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zprop_valid_for_type'>
      <parameter type-id='type-id-2' name='prop'/>
      <parameter type-id='type-id-129' name='type'/>
      <parameter type-id='type-id-5' name='headcheck'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zprop_values' mangled-name='zprop_values' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zprop_values'>
      <parameter type-id='type-id-2' name='prop'/>
      <parameter type-id='type-id-129' name='type'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='zprop_random_value' mangled-name='zprop_random_value' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zprop_random_value'>
      <parameter type-id='type-id-2' name='prop'/>
      <parameter type-id='type-id-19' name='seed'/>
      <parameter type-id='type-id-129' name='type'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='zprop_index_to_string' mangled-name='zprop_index_to_string' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zprop_index_to_string'>
      <parameter type-id='type-id-2' name='prop'/>
      <parameter type-id='type-id-19' name='index'/>
      <parameter type-id='type-id-125' name='string'/>
      <parameter type-id='type-id-129' name='type'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zprop_string_to_index' mangled-name='zprop_string_to_index' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zprop_string_to_index'>
      <parameter type-id='type-id-2' name='prop'/>
      <parameter type-id='type-id-3' name='string'/>
      <parameter type-id='type-id-130' name='index'/>
      <parameter type-id='type-id-129' name='type'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zprop_name_to_prop' mangled-name='zprop_name_to_prop' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zprop_name_to_prop'>
      <parameter type-id='type-id-3' name='propname'/>
      <parameter type-id='type-id-129' name='type'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zprop_iter_common' mangled-name='zprop_iter_common' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zprop_iter_common'>
      <parameter type-id='type-id-136' name='func'/>
      <parameter type-id='type-id-55' name='cb'/>
      <parameter type-id='type-id-5' name='show_all'/>
      <parameter type-id='type-id-5' name='ordered'/>
      <parameter type-id='type-id-129' name='type'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zprop_register_hidden' mangled-name='zprop_register_hidden' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zprop_register_hidden'>
      <parameter type-id='type-id-2' name='prop'/>
      <parameter type-id='type-id-3' name='name'/>
      <parameter type-id='type-id-117' name='type'/>
      <parameter type-id='type-id-120' name='attr'/>
      <parameter type-id='type-id-2' name='objset_types'/>
      <parameter type-id='type-id-3' name='colname'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zprop_register_index' mangled-name='zprop_register_index' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zprop_register_index'>
      <parameter type-id='type-id-2' name='prop'/>
      <parameter type-id='type-id-3' name='name'/>
      <parameter type-id='type-id-19' name='def'/>
      <parameter type-id='type-id-120' name='attr'/>
      <parameter type-id='type-id-2' name='objset_types'/>
      <parameter type-id='type-id-3' name='values'/>
      <parameter type-id='type-id-3' name='colname'/>
      <parameter type-id='type-id-121' name='idx_tbl'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zprop_register_number' mangled-name='zprop_register_number' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zprop_register_number'>
      <parameter type-id='type-id-2' name='prop'/>
      <parameter type-id='type-id-3' name='name'/>
      <parameter type-id='type-id-19' name='def'/>
      <parameter type-id='type-id-120' name='attr'/>
      <parameter type-id='type-id-2' name='objset_types'/>
      <parameter type-id='type-id-3' name='values'/>
      <parameter type-id='type-id-3' name='colname'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zprop_register_string' mangled-name='zprop_register_string' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zprop_register_string'>
      <parameter type-id='type-id-2' name='prop'/>
      <parameter type-id='type-id-3' name='name'/>
      <parameter type-id='type-id-3' name='def'/>
      <parameter type-id='type-id-120' name='attr'/>
      <parameter type-id='type-id-2' name='objset_types'/>
      <parameter type-id='type-id-3' name='values'/>
      <parameter type-id='type-id-3' name='colname'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zprop_register_impl' mangled-name='zprop_register_impl' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zprop_register_impl'>
      <parameter type-id='type-id-2' name='prop'/>
      <parameter type-id='type-id-3' name='name'/>
      <parameter type-id='type-id-117' name='type'/>
      <parameter type-id='type-id-19' name='numdefault'/>
      <parameter type-id='type-id-3' name='strdefault'/>
      <parameter type-id='type-id-120' name='attr'/>
      <parameter type-id='type-id-2' name='objset_types'/>
      <parameter type-id='type-id-3' name='values'/>
      <parameter type-id='type-id-3' name='colname'/>
      <parameter type-id='type-id-5' name='rightalign'/>
      <parameter type-id='type-id-5' name='visible'/>
      <parameter type-id='type-id-121' name='idx_tbl'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <pointer-type-def type-id='type-id-5' size-in-bits='64' id='type-id-135'/>
    <typedef-decl name='zprop_func' type-id='type-id-137' id='type-id-136'/>
    <pointer-type-def type-id='type-id-138' size-in-bits='64' id='type-id-137'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='libzfs_changelist.c' comp-dir-path='/home/brian/zfs_directio_pr/lib/libzfs' language='LANG_C99'>
    <type-decl name='void' id='type-id-4'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='libzfs_config.c' comp-dir-path='/home/brian/zfs_directio_pr/lib/libzfs' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-139' size-in-bits='128' id='type-id-140'>
      <subrange length='2' type-id='type-id-11' id='type-id-96'/>
    </array-type-def>
    <type-decl name='char' size-in-bits='8' id='type-id-6'/>
    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='8192' id='type-id-141'>
      <subrange length='1024' type-id='type-id-11' id='type-id-142'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='2048' id='type-id-143'>
      <subrange length='256' type-id='type-id-11' id='type-id-144'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='320' id='type-id-145'>
      <subrange length='40' type-id='type-id-11' id='type-id-146'/>
    </array-type-def>
    <class-decl name='re_dfa_t' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-147'/>
    <class-decl name='uu_avl' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-148'/>
    <class-decl name='uu_avl_pool' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-149'/>
    <type-decl name='int' size-in-bits='32' id='type-id-2'/>
    <type-decl name='long int' size-in-bits='64' id='type-id-150'/>
    <type-decl name='long long int' size-in-bits='64' id='type-id-151'/>
    <type-decl name='short int' size-in-bits='16' id='type-id-152'/>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-9'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-153'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-43'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-11'/>
    <class-decl name='libzfs_handle' size-in-bits='18240' is-struct='yes' visibility='default' id='type-id-154'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='libzfs_error' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='libzfs_fd' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='libzfs_pool_handles' type-id='type-id-155' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='libzfs_ns_avlpool' type-id='type-id-156' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='libzfs_ns_avl' type-id='type-id-157' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='libzfs_ns_gen' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='libzfs_desc_active' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='libzfs_action' type-id='type-id-141' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8544'>
        <var-decl name='libzfs_desc' type-id='type-id-141' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16736'>
        <var-decl name='libzfs_printerr' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16768'>
        <var-decl name='libzfs_mnttab_enable' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16832'>
        <var-decl name='libzfs_mnttab_cache_lock' type-id='type-id-158' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17152'>
        <var-decl name='libzfs_mnttab_cache' type-id='type-id-159' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17472'>
        <var-decl name='libzfs_pool_iter' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17504'>
        <var-decl name='libzfs_prop_debug' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17536'>
        <var-decl name='libzfs_urire' type-id='type-id-160' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18048'>
        <var-decl name='libzfs_max_nvlist' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18112'>
        <var-decl name='libfetch' type-id='type-id-55' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18176'>
        <var-decl name='libfetch_load_error' type-id='type-id-1' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='zpool_handle' size-in-bits='2560' is-struct='yes' visibility='default' id='type-id-161'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zpool_hdl' type-id='type-id-162' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='zpool_next' type-id='type-id-155' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='zpool_name' type-id='type-id-143' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='zpool_state' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='zpool_config_size' type-id='type-id-95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='zpool_config' type-id='type-id-40' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='zpool_old_config' type-id='type-id-40' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='zpool_props' type-id='type-id-40' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='zpool_start_block' type-id='type-id-163' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='libzfs_handle_t' type-id='type-id-154' id='type-id-164'/>
    <typedef-decl name='zpool_handle_t' type-id='type-id-161' id='type-id-165'/>
    <typedef-decl name='size_t' type-id='type-id-11' id='type-id-95'/>
    <typedef-decl name='nvlist_t' type-id='type-id-44' id='type-id-41'/>
    <class-decl name='nvlist' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-44'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nvl_version' type-id='type-id-45' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='nvl_nvflag' type-id='type-id-38' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nvl_priv' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nvl_flag' type-id='type-id-38' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='nvl_pad' type-id='type-id-45' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='int32_t' type-id='type-id-46' id='type-id-45'/>
    <typedef-decl name='__int32_t' type-id='type-id-2' id='type-id-46'/>
    <typedef-decl name='uint32_t' type-id='type-id-42' id='type-id-38'/>
    <typedef-decl name='__uint32_t' type-id='type-id-43' id='type-id-42'/>
    <typedef-decl name='uint64_t' type-id='type-id-20' id='type-id-19'/>
    <typedef-decl name='__uint64_t' type-id='type-id-11' id='type-id-20'/>
    <typedef-decl name='diskaddr_t' type-id='type-id-166' id='type-id-163'/>
    <typedef-decl name='longlong_t' type-id='type-id-151' id='type-id-166'/>
    <typedef-decl name='uu_avl_pool_t' type-id='type-id-149' id='type-id-167'/>
    <typedef-decl name='uu_avl_t' type-id='type-id-148' id='type-id-168'/>
    <typedef-decl name='boolean_t' type-id='type-id-8' id='type-id-5'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-8'>
      <underlying-type type-id='type-id-9'/>
      <enumerator name='B_FALSE' value='0'/>
      <enumerator name='B_TRUE' value='1'/>
    </enum-decl>
    <typedef-decl name='pthread_mutex_t' type-id='type-id-169' id='type-id-158'/>
    <union-decl name='__anonymous_union__' size-in-bits='320' is-anonymous='yes' visibility='default' id='type-id-169'>
      <data-member access='private'>
        <var-decl name='__data' type-id='type-id-170' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__size' type-id='type-id-145' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__align' type-id='type-id-150' visibility='default'/>
      </data-member>
    </union-decl>
    <class-decl name='__pthread_mutex_s' size-in-bits='320' is-struct='yes' visibility='default' id='type-id-170'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__lock' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__count' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__owner' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='__nusers' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='__kind' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='__spins' type-id='type-id-152' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='__elision' type-id='type-id-152' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='__list' type-id='type-id-171' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__pthread_list_t' type-id='type-id-172' id='type-id-171'/>
    <class-decl name='__pthread_internal_list' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-172'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__prev' type-id='type-id-173' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__next' type-id='type-id-173' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='avl_tree_t' type-id='type-id-174' id='type-id-159'/>
    <class-decl name='avl_tree' size-in-bits='320' is-struct='yes' visibility='default' id='type-id-174'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='avl_root' type-id='type-id-139' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='avl_compar' type-id='type-id-175' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='avl_offset' type-id='type-id-95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='avl_numnodes' type-id='type-id-176' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='avl_size' type-id='type-id-95' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='avl_node' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-177'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='avl_child' type-id='type-id-140' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='avl_pcb' type-id='type-id-178' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uintptr_t' type-id='type-id-11' id='type-id-178'/>
    <typedef-decl name='ulong_t' type-id='type-id-11' id='type-id-176'/>
    <typedef-decl name='regex_t' type-id='type-id-179' id='type-id-160'/>
    <class-decl name='re_pattern_buffer' size-in-bits='512' is-struct='yes' visibility='default' id='type-id-179'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='buffer' type-id='type-id-180' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='allocated' type-id='type-id-181' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='used' type-id='type-id-181' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='syntax' type-id='type-id-182' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='fastmap' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='translate' type-id='type-id-183' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='re_nsub' type-id='type-id-95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='can_be_null' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='29'>
        <var-decl name='regs_allocated' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='28'>
        <var-decl name='fastmap_accurate' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27'>
        <var-decl name='no_sub' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26'>
        <var-decl name='not_bol' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25'>
        <var-decl name='not_eol' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='newline_anchor' type-id='type-id-43' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__re_long_size_t' type-id='type-id-11' id='type-id-181'/>
    <typedef-decl name='reg_syntax_t' type-id='type-id-11' id='type-id-182'/>
    <typedef-decl name='zfs_iter_f' type-id='type-id-184' id='type-id-185'/>
    <typedef-decl name='zfs_handle_t' type-id='type-id-186' id='type-id-187'/>
    <class-decl name='zfs_handle' size-in-bits='4928' is-struct='yes' visibility='default' id='type-id-186'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zfs_hdl' type-id='type-id-162' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='zpool_hdl' type-id='type-id-155' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='zfs_name' type-id='type-id-143' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='zfs_type' type-id='type-id-129' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2208'>
        <var-decl name='zfs_head_type' type-id='type-id-129' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='zfs_dmustats' type-id='type-id-188' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4544'>
        <var-decl name='zfs_props' type-id='type-id-40' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4608'>
        <var-decl name='zfs_user_props' type-id='type-id-40' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4672'>
        <var-decl name='zfs_recvd_props' type-id='type-id-40' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4736'>
        <var-decl name='zfs_mntcheck' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4800'>
        <var-decl name='zfs_mntopts' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4864'>
        <var-decl name='zfs_props_table' type-id='type-id-189' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zfs_type_t' type-id='type-id-132' id='type-id-129'/>
    <enum-decl name='__anonymous_enum__1' is-anonymous='yes' id='type-id-132'>
      <underlying-type type-id='type-id-9'/>
      <enumerator name='ZFS_TYPE_FILESYSTEM' value='1'/>
      <enumerator name='ZFS_TYPE_SNAPSHOT' value='2'/>
      <enumerator name='ZFS_TYPE_VOLUME' value='4'/>
      <enumerator name='ZFS_TYPE_POOL' value='8'/>
      <enumerator name='ZFS_TYPE_BOOKMARK' value='16'/>
    </enum-decl>
    <typedef-decl name='dmu_objset_stats_t' type-id='type-id-190' id='type-id-188'/>
    <class-decl name='dmu_objset_stats' size-in-bits='2304' is-struct='yes' visibility='default' id='type-id-190'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dds_num_clones' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dds_creation_txg' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dds_guid' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dds_type' type-id='type-id-191' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='dds_is_snapshot' type-id='type-id-192' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='232'>
        <var-decl name='dds_inconsistent' type-id='type-id-192' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='240'>
        <var-decl name='dds_redacted' type-id='type-id-192' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='248'>
        <var-decl name='dds_origin' type-id='type-id-143' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='dmu_objset_type_t' type-id='type-id-193' id='type-id-191'/>
    <enum-decl name='dmu_objset_type' id='type-id-193'>
      <underlying-type type-id='type-id-9'/>
      <enumerator name='DMU_OST_NONE' value='0'/>
      <enumerator name='DMU_OST_META' value='1'/>
      <enumerator name='DMU_OST_ZFS' value='2'/>
      <enumerator name='DMU_OST_ZVOL' value='3'/>
      <enumerator name='DMU_OST_OTHER' value='4'/>
      <enumerator name='DMU_OST_ANY' value='5'/>
      <enumerator name='DMU_OST_NUMTYPES' value='6'/>
    </enum-decl>
    <typedef-decl name='uint8_t' type-id='type-id-194' id='type-id-192'/>
    <typedef-decl name='__uint8_t' type-id='type-id-153' id='type-id-194'/>
    <typedef-decl name='zpool_iter_f' type-id='type-id-195' id='type-id-196'/>
    <pointer-type-def type-id='type-id-172' size-in-bits='64' id='type-id-173'/>
    <pointer-type-def type-id='type-id-177' size-in-bits='64' id='type-id-139'/>
    <pointer-type-def type-id='type-id-5' size-in-bits='64' id='type-id-135'/>
    <pointer-type-def type-id='type-id-6' size-in-bits='64' id='type-id-1'/>
    <qualified-type-def type-id='type-id-6' const='yes' id='type-id-7'/>
    <pointer-type-def type-id='type-id-7' size-in-bits='64' id='type-id-3'/>
    <pointer-type-def type-id='type-id-197' size-in-bits='64' id='type-id-175'/>
    <pointer-type-def type-id='type-id-198' size-in-bits='64' id='type-id-184'/>
    <pointer-type-def type-id='type-id-199' size-in-bits='64' id='type-id-195'/>
    <pointer-type-def type-id='type-id-164' size-in-bits='64' id='type-id-162'/>
    <pointer-type-def type-id='type-id-41' size-in-bits='64' id='type-id-40'/>
    <pointer-type-def type-id='type-id-40' size-in-bits='64' id='type-id-200'/>
    <pointer-type-def type-id='type-id-147' size-in-bits='64' id='type-id-180'/>
    <pointer-type-def type-id='type-id-192' size-in-bits='64' id='type-id-189'/>
    <pointer-type-def type-id='type-id-153' size-in-bits='64' id='type-id-183'/>
    <pointer-type-def type-id='type-id-167' size-in-bits='64' id='type-id-156'/>
    <pointer-type-def type-id='type-id-168' size-in-bits='64' id='type-id-157'/>
    <pointer-type-def type-id='type-id-4' size-in-bits='64' id='type-id-55'/>
    <pointer-type-def type-id='type-id-187' size-in-bits='64' id='type-id-201'/>
    <pointer-type-def type-id='type-id-165' size-in-bits='64' id='type-id-155'/>
    <function-decl name='zfs_iter_root' mangled-name='zfs_iter_root' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_iter_root'>
      <parameter type-id='type-id-162' name='hdl'/>
      <parameter type-id='type-id-185' name='func'/>
      <parameter type-id='type-id-55' name='data'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zpool_iter' mangled-name='zpool_iter' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_iter'>
      <parameter type-id='type-id-162' name='hdl'/>
      <parameter type-id='type-id-196' name='func'/>
      <parameter type-id='type-id-55' name='data'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zpool_skip_pool' mangled-name='zpool_skip_pool' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_skip_pool'>
      <parameter type-id='type-id-3' name='poolname'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zpool_refresh_stats' mangled-name='zpool_refresh_stats' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_refresh_stats'>
      <parameter type-id='type-id-155' name='zhp'/>
      <parameter type-id='type-id-135' name='missing'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zpool_get_features' mangled-name='zpool_get_features' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_get_features'>
      <parameter type-id='type-id-155' name='zhp'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='zpool_get_config' mangled-name='zpool_get_config' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_get_config'>
      <parameter type-id='type-id-155' name='zhp'/>
      <parameter type-id='type-id-200' name='oldconfig'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-197'>
      <parameter type-id='type-id-55'/>
      <parameter type-id='type-id-55'/>
      <return type-id='type-id-2'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-198'>
      <parameter type-id='type-id-201'/>
      <parameter type-id='type-id-55'/>
      <return type-id='type-id-2'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-199'>
      <parameter type-id='type-id-155'/>
      <parameter type-id='type-id-55'/>
      <return type-id='type-id-2'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='libzfs_crypto.c' comp-dir-path='/home/brian/zfs_directio_pr/lib/libzfs' language='LANG_C99'>
    <typedef-decl name='uint_t' type-id='type-id-43' id='type-id-202'/>
    <pointer-type-def type-id='type-id-189' size-in-bits='64' id='type-id-203'/>
    <pointer-type-def type-id='type-id-202' size-in-bits='64' id='type-id-204'/>
    <function-decl name='zfs_crypto_rewrap' mangled-name='zfs_crypto_rewrap' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_crypto_rewrap'>
      <parameter type-id='type-id-201' name='zhp'/>
      <parameter type-id='type-id-40' name='raw_props'/>
      <parameter type-id='type-id-5' name='inheritkey'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_crypto_unload_key' mangled-name='zfs_crypto_unload_key' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_crypto_unload_key'>
      <parameter type-id='type-id-201' name='zhp'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_crypto_load_key' mangled-name='zfs_crypto_load_key' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_crypto_load_key'>
      <parameter type-id='type-id-201' name='zhp'/>
      <parameter type-id='type-id-5' name='noop'/>
      <parameter type-id='type-id-1' name='alt_keylocation'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_crypto_attempt_load_keys' mangled-name='zfs_crypto_attempt_load_keys' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_crypto_attempt_load_keys'>
      <parameter type-id='type-id-162' name='hdl'/>
      <parameter type-id='type-id-1' name='fsname'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_crypto_clone_check' mangled-name='zfs_crypto_clone_check' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_crypto_clone_check'>
      <parameter type-id='type-id-162' name='hdl'/>
      <parameter type-id='type-id-201' name='origin_zhp'/>
      <parameter type-id='type-id-1' name='parent_name'/>
      <parameter type-id='type-id-40' name='props'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_crypto_create' mangled-name='zfs_crypto_create' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_crypto_create'>
      <parameter type-id='type-id-162' name='hdl'/>
      <parameter type-id='type-id-1' name='parent_name'/>
      <parameter type-id='type-id-40' name='props'/>
      <parameter type-id='type-id-40' name='pool_props'/>
      <parameter type-id='type-id-5' name='stdin_available'/>
      <parameter type-id='type-id-203' name='wkeydata_out'/>
      <parameter type-id='type-id-204' name='wkeylen_out'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_crypto_get_encryption_root' mangled-name='zfs_crypto_get_encryption_root' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_crypto_get_encryption_root'>
      <parameter type-id='type-id-201' name='zhp'/>
      <parameter type-id='type-id-135' name='is_encroot'/>
      <parameter type-id='type-id-1' name='buf'/>
      <return type-id='type-id-2'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='libzfs_dataset.c' comp-dir-path='/home/brian/zfs_directio_pr/lib/libzfs' language='LANG_C99'>
    <typedef-decl name='zfs_wait_activity_t' type-id='type-id-205' id='type-id-206'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-205'>
      <underlying-type type-id='type-id-9'/>
      <enumerator name='ZFS_WAIT_DELETEQ' value='0'/>
      <enumerator name='ZFS_WAIT_NUM_ACTIVITIES' value='1'/>
    </enum-decl>
    <typedef-decl name='zfs_userquota_prop_t' type-id='type-id-207' id='type-id-208'/>
    <enum-decl name='__anonymous_enum__1' is-anonymous='yes' id='type-id-207'>
      <underlying-type type-id='type-id-9'/>
      <enumerator name='ZFS_PROP_USERUSED' value='0'/>
      <enumerator name='ZFS_PROP_USERQUOTA' value='1'/>
      <enumerator name='ZFS_PROP_GROUPUSED' value='2'/>
      <enumerator name='ZFS_PROP_GROUPQUOTA' value='3'/>
      <enumerator name='ZFS_PROP_USEROBJUSED' value='4'/>
      <enumerator name='ZFS_PROP_USEROBJQUOTA' value='5'/>
      <enumerator name='ZFS_PROP_GROUPOBJUSED' value='6'/>
      <enumerator name='ZFS_PROP_GROUPOBJQUOTA' value='7'/>
      <enumerator name='ZFS_PROP_PROJECTUSED' value='8'/>
      <enumerator name='ZFS_PROP_PROJECTQUOTA' value='9'/>
      <enumerator name='ZFS_PROP_PROJECTOBJUSED' value='10'/>
      <enumerator name='ZFS_PROP_PROJECTOBJQUOTA' value='11'/>
      <enumerator name='ZFS_NUM_USERQUOTA_PROPS' value='12'/>
    </enum-decl>
    <typedef-decl name='zfs_userspace_cb_t' type-id='type-id-209' id='type-id-210'/>
    <typedef-decl name='uid_t' type-id='type-id-211' id='type-id-212'/>
    <typedef-decl name='__uid_t' type-id='type-id-43' id='type-id-211'/>
    <typedef-decl name='zprop_list_t' type-id='type-id-213' id='type-id-214'/>
    <class-decl name='zprop_list' size-in-bits='448' is-struct='yes' visibility='default' id='type-id-213'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pl_prop' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pl_user_prop' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pl_next' type-id='type-id-215' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='pl_all' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='pl_width' type-id='type-id-95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='pl_recvd_width' type-id='type-id-95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='pl_fixed' type-id='type-id-5' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='renameflags_t' type-id='type-id-216' id='type-id-217'/>
    <class-decl name='renameflags' size-in-bits='32' is-struct='yes' visibility='default' id='type-id-216'>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='recursive' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30'>
        <var-decl name='nounmount' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='29'>
        <var-decl name='forceunmount' type-id='type-id-2' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zfs_prop_t' type-id='type-id-131' id='type-id-128'/>
    <enum-decl name='__anonymous_enum__2' is-anonymous='yes' id='type-id-131'>
      <underlying-type type-id='type-id-9'/>
      <enumerator name='ZPROP_CONT' value='-2'/>
      <enumerator name='ZPROP_INVAL' value='-1'/>
      <enumerator name='ZFS_PROP_TYPE' value='0'/>
      <enumerator name='ZFS_PROP_CREATION' value='1'/>
      <enumerator name='ZFS_PROP_USED' value='2'/>
      <enumerator name='ZFS_PROP_AVAILABLE' value='3'/>
      <enumerator name='ZFS_PROP_REFERENCED' value='4'/>
      <enumerator name='ZFS_PROP_COMPRESSRATIO' value='5'/>
      <enumerator name='ZFS_PROP_MOUNTED' value='6'/>
      <enumerator name='ZFS_PROP_ORIGIN' value='7'/>
      <enumerator name='ZFS_PROP_QUOTA' value='8'/>
      <enumerator name='ZFS_PROP_RESERVATION' value='9'/>
      <enumerator name='ZFS_PROP_VOLSIZE' value='10'/>
      <enumerator name='ZFS_PROP_VOLBLOCKSIZE' value='11'/>
      <enumerator name='ZFS_PROP_RECORDSIZE' value='12'/>
      <enumerator name='ZFS_PROP_MOUNTPOINT' value='13'/>
      <enumerator name='ZFS_PROP_SHARENFS' value='14'/>
      <enumerator name='ZFS_PROP_CHECKSUM' value='15'/>
      <enumerator name='ZFS_PROP_COMPRESSION' value='16'/>
      <enumerator name='ZFS_PROP_ATIME' value='17'/>
      <enumerator name='ZFS_PROP_DEVICES' value='18'/>
      <enumerator name='ZFS_PROP_EXEC' value='19'/>
      <enumerator name='ZFS_PROP_SETUID' value='20'/>
      <enumerator name='ZFS_PROP_READONLY' value='21'/>
      <enumerator name='ZFS_PROP_ZONED' value='22'/>
      <enumerator name='ZFS_PROP_SNAPDIR' value='23'/>
      <enumerator name='ZFS_PROP_ACLMODE' value='24'/>
      <enumerator name='ZFS_PROP_ACLINHERIT' value='25'/>
      <enumerator name='ZFS_PROP_CREATETXG' value='26'/>
      <enumerator name='ZFS_PROP_NAME' value='27'/>
      <enumerator name='ZFS_PROP_CANMOUNT' value='28'/>
      <enumerator name='ZFS_PROP_ISCSIOPTIONS' value='29'/>
      <enumerator name='ZFS_PROP_XATTR' value='30'/>
      <enumerator name='ZFS_PROP_NUMCLONES' value='31'/>
      <enumerator name='ZFS_PROP_COPIES' value='32'/>
      <enumerator name='ZFS_PROP_VERSION' value='33'/>
      <enumerator name='ZFS_PROP_UTF8ONLY' value='34'/>
      <enumerator name='ZFS_PROP_NORMALIZE' value='35'/>
      <enumerator name='ZFS_PROP_CASE' value='36'/>
      <enumerator name='ZFS_PROP_VSCAN' value='37'/>
      <enumerator name='ZFS_PROP_NBMAND' value='38'/>
      <enumerator name='ZFS_PROP_SHARESMB' value='39'/>
      <enumerator name='ZFS_PROP_REFQUOTA' value='40'/>
      <enumerator name='ZFS_PROP_REFRESERVATION' value='41'/>
      <enumerator name='ZFS_PROP_GUID' value='42'/>
      <enumerator name='ZFS_PROP_PRIMARYCACHE' value='43'/>
      <enumerator name='ZFS_PROP_SECONDARYCACHE' value='44'/>
      <enumerator name='ZFS_PROP_USEDSNAP' value='45'/>
      <enumerator name='ZFS_PROP_USEDDS' value='46'/>
      <enumerator name='ZFS_PROP_USEDCHILD' value='47'/>
      <enumerator name='ZFS_PROP_USEDREFRESERV' value='48'/>
      <enumerator name='ZFS_PROP_USERACCOUNTING' value='49'/>
      <enumerator name='ZFS_PROP_STMF_SHAREINFO' value='50'/>
      <enumerator name='ZFS_PROP_DEFER_DESTROY' value='51'/>
      <enumerator name='ZFS_PROP_USERREFS' value='52'/>
      <enumerator name='ZFS_PROP_LOGBIAS' value='53'/>
      <enumerator name='ZFS_PROP_UNIQUE' value='54'/>
      <enumerator name='ZFS_PROP_OBJSETID' value='55'/>
      <enumerator name='ZFS_PROP_DEDUP' value='56'/>
      <enumerator name='ZFS_PROP_MLSLABEL' value='57'/>
      <enumerator name='ZFS_PROP_SYNC' value='58'/>
      <enumerator name='ZFS_PROP_DNODESIZE' value='59'/>
      <enumerator name='ZFS_PROP_REFRATIO' value='60'/>
      <enumerator name='ZFS_PROP_WRITTEN' value='61'/>
      <enumerator name='ZFS_PROP_CLONES' value='62'/>
      <enumerator name='ZFS_PROP_LOGICALUSED' value='63'/>
      <enumerator name='ZFS_PROP_LOGICALREFERENCED' value='64'/>
      <enumerator name='ZFS_PROP_INCONSISTENT' value='65'/>
      <enumerator name='ZFS_PROP_VOLMODE' value='66'/>
      <enumerator name='ZFS_PROP_FILESYSTEM_LIMIT' value='67'/>
      <enumerator name='ZFS_PROP_SNAPSHOT_LIMIT' value='68'/>
      <enumerator name='ZFS_PROP_FILESYSTEM_COUNT' value='69'/>
      <enumerator name='ZFS_PROP_SNAPSHOT_COUNT' value='70'/>
      <enumerator name='ZFS_PROP_SNAPDEV' value='71'/>
      <enumerator name='ZFS_PROP_ACLTYPE' value='72'/>
      <enumerator name='ZFS_PROP_SELINUX_CONTEXT' value='73'/>
      <enumerator name='ZFS_PROP_SELINUX_FSCONTEXT' value='74'/>
      <enumerator name='ZFS_PROP_SELINUX_DEFCONTEXT' value='75'/>
      <enumerator name='ZFS_PROP_SELINUX_ROOTCONTEXT' value='76'/>
      <enumerator name='ZFS_PROP_RELATIME' value='77'/>
      <enumerator name='ZFS_PROP_REDUNDANT_METADATA' value='78'/>
      <enumerator name='ZFS_PROP_OVERLAY' value='79'/>
      <enumerator name='ZFS_PROP_PREV_SNAP' value='80'/>
      <enumerator name='ZFS_PROP_RECEIVE_RESUME_TOKEN' value='81'/>
      <enumerator name='ZFS_PROP_ENCRYPTION' value='82'/>
      <enumerator name='ZFS_PROP_KEYLOCATION' value='83'/>
      <enumerator name='ZFS_PROP_KEYFORMAT' value='84'/>
      <enumerator name='ZFS_PROP_PBKDF2_SALT' value='85'/>
      <enumerator name='ZFS_PROP_PBKDF2_ITERS' value='86'/>
      <enumerator name='ZFS_PROP_ENCRYPTION_ROOT' value='87'/>
      <enumerator name='ZFS_PROP_KEY_GUID' value='88'/>
      <enumerator name='ZFS_PROP_KEYSTATUS' value='89'/>
      <enumerator name='ZFS_PROP_REMAPTXG' value='90'/>
      <enumerator name='ZFS_PROP_SPECIAL_SMALL_BLOCKS' value='91'/>
      <enumerator name='ZFS_PROP_IVSET_GUID' value='92'/>
      <enumerator name='ZFS_PROP_REDACTED' value='93'/>
      <enumerator name='ZFS_PROP_REDACT_SNAPS' value='94'/>
      <enumerator name='ZFS_PROP_DIRECT' value='95'/>
      <enumerator name='ZFS_NUM_PROPS' value='96'/>
    </enum-decl>
    <typedef-decl name='zprop_source_t' type-id='type-id-218' id='type-id-219'/>
    <enum-decl name='__anonymous_enum__3' is-anonymous='yes' id='type-id-218'>
      <underlying-type type-id='type-id-9'/>
      <enumerator name='ZPROP_SRC_NONE' value='1'/>
      <enumerator name='ZPROP_SRC_DEFAULT' value='2'/>
      <enumerator name='ZPROP_SRC_TEMPORARY' value='4'/>
      <enumerator name='ZPROP_SRC_LOCAL' value='8'/>
      <enumerator name='ZPROP_SRC_INHERITED' value='16'/>
      <enumerator name='ZPROP_SRC_RECEIVED' value='32'/>
    </enum-decl>
    <class-decl name='mnttab' size-in-bits='256' is-struct='yes' visibility='default' id='type-id-220'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mnt_special' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mnt_mountp' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mnt_fstype' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='mnt_mntopts' type-id='type-id-1' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-1' size-in-bits='64' id='type-id-221'/>
    <qualified-type-def type-id='type-id-187' const='yes' id='type-id-222'/>
    <pointer-type-def type-id='type-id-222' size-in-bits='64' id='type-id-223'/>
    <pointer-type-def type-id='type-id-224' size-in-bits='64' id='type-id-209'/>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' id='type-id-225'/>
    <pointer-type-def type-id='type-id-220' size-in-bits='64' id='type-id-226'/>
    <pointer-type-def type-id='type-id-19' size-in-bits='64' id='type-id-130'/>
    <pointer-type-def type-id='type-id-213' size-in-bits='64' id='type-id-215'/>
    <pointer-type-def type-id='type-id-214' size-in-bits='64' id='type-id-227'/>
    <pointer-type-def type-id='type-id-227' size-in-bits='64' id='type-id-228'/>
    <pointer-type-def type-id='type-id-219' size-in-bits='64' id='type-id-229'/>
    <function-decl name='zfs_wait_status' mangled-name='zfs_wait_status' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_wait_status'>
      <parameter type-id='type-id-201' name='zhp'/>
      <parameter type-id='type-id-206' name='activity'/>
      <parameter type-id='type-id-135' name='missing'/>
      <parameter type-id='type-id-135' name='waited'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zvol_volsize_to_reservation' mangled-name='zvol_volsize_to_reservation' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zvol_volsize_to_reservation'>
      <parameter type-id='type-id-155' name='zph'/>
      <parameter type-id='type-id-19' name='volsize'/>
      <parameter type-id='type-id-40' name='props'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='zfs_get_holds' mangled-name='zfs_get_holds' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_holds'>
      <parameter type-id='type-id-201' name='zhp'/>
      <parameter type-id='type-id-200' name='nvl'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_set_fsacl' mangled-name='zfs_set_fsacl' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_set_fsacl'>
      <parameter type-id='type-id-201' name='zhp'/>
      <parameter type-id='type-id-5' name='un'/>
      <parameter type-id='type-id-40' name='nvl'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_get_fsacl' mangled-name='zfs_get_fsacl' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_fsacl'>
      <parameter type-id='type-id-201' name='zhp'/>
      <parameter type-id='type-id-200' name='nvl'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_release' mangled-name='zfs_release' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_release'>
      <parameter type-id='type-id-201' name='zhp'/>
      <parameter type-id='type-id-3' name='snapname'/>
      <parameter type-id='type-id-3' name='tag'/>
      <parameter type-id='type-id-5' name='recursive'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_hold_nvl' mangled-name='zfs_hold_nvl' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_hold_nvl'>
      <parameter type-id='type-id-201' name='zhp'/>
      <parameter type-id='type-id-2' name='cleanup_fd'/>
      <parameter type-id='type-id-40' name='holds'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_hold' mangled-name='zfs_hold' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_hold'>
      <parameter type-id='type-id-201' name='zhp'/>
      <parameter type-id='type-id-3' name='snapname'/>
      <parameter type-id='type-id-3' name='tag'/>
      <parameter type-id='type-id-5' name='recursive'/>
      <parameter type-id='type-id-2' name='cleanup_fd'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_userspace' mangled-name='zfs_userspace' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_userspace'>
      <parameter type-id='type-id-201' name='zhp'/>
      <parameter type-id='type-id-208' name='type'/>
      <parameter type-id='type-id-210' name='func'/>
      <parameter type-id='type-id-55' name='arg'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_smb_acl_rename' mangled-name='zfs_smb_acl_rename' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_smb_acl_rename'>
      <parameter type-id='type-id-162' name='hdl'/>
      <parameter type-id='type-id-1' name='dataset'/>
      <parameter type-id='type-id-1' name='path'/>
      <parameter type-id='type-id-1' name='oldname'/>
      <parameter type-id='type-id-1' name='newname'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_smb_acl_purge' mangled-name='zfs_smb_acl_purge' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_smb_acl_purge'>
      <parameter type-id='type-id-162' name='hdl'/>
      <parameter type-id='type-id-1' name='dataset'/>
      <parameter type-id='type-id-1' name='path'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_smb_acl_remove' mangled-name='zfs_smb_acl_remove' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_smb_acl_remove'>
      <parameter type-id='type-id-162' name='hdl'/>
      <parameter type-id='type-id-1' name='dataset'/>
      <parameter type-id='type-id-1' name='path'/>
      <parameter type-id='type-id-1' name='resource'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_smb_acl_add' mangled-name='zfs_smb_acl_add' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_smb_acl_add'>
      <parameter type-id='type-id-162' name='hdl'/>
      <parameter type-id='type-id-1' name='dataset'/>
      <parameter type-id='type-id-1' name='path'/>
      <parameter type-id='type-id-1' name='resource'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_prune_proplist' mangled-name='zfs_prune_proplist' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prune_proplist'>
      <parameter type-id='type-id-201' name='zhp'/>
      <parameter type-id='type-id-189' name='props'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_expand_proplist' mangled-name='zfs_expand_proplist' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_expand_proplist'>
      <parameter type-id='type-id-201' name='zhp'/>
      <parameter type-id='type-id-228' name='plp'/>
      <parameter type-id='type-id-5' name='received'/>
      <parameter type-id='type-id-5' name='literal'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_get_user_props' mangled-name='zfs_get_user_props' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_user_props'>
      <parameter type-id='type-id-201' name='zhp'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='zfs_get_recvd_props' mangled-name='zfs_get_recvd_props' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_recvd_props'>
      <parameter type-id='type-id-201' name='zhp'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='zfs_get_all_props' mangled-name='zfs_get_all_props' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_all_props'>
      <parameter type-id='type-id-201' name='zhp'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='zfs_rename' mangled-name='zfs_rename' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_rename'>
      <parameter type-id='type-id-201' name='zhp'/>
      <parameter type-id='type-id-3' name='target'/>
      <parameter type-id='type-id-217' name='flags'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_rollback' mangled-name='zfs_rollback' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_rollback'>
      <parameter type-id='type-id-201' name='zhp'/>
      <parameter type-id='type-id-201' name='snap'/>
      <parameter type-id='type-id-5' name='force'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_snapshot' mangled-name='zfs_snapshot' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_snapshot'>
      <parameter type-id='type-id-162' name='hdl'/>
      <parameter type-id='type-id-3' name='path'/>
      <parameter type-id='type-id-5' name='recursive'/>
      <parameter type-id='type-id-40' name='props'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_snapshot_nvl' mangled-name='zfs_snapshot_nvl' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_snapshot_nvl'>
      <parameter type-id='type-id-162' name='hdl'/>
      <parameter type-id='type-id-40' name='snaps'/>
      <parameter type-id='type-id-40' name='props'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_promote' mangled-name='zfs_promote' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_promote'>
      <parameter type-id='type-id-201' name='zhp'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_clone' mangled-name='zfs_clone' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_clone'>
      <parameter type-id='type-id-201' name='zhp'/>
      <parameter type-id='type-id-3' name='target'/>
      <parameter type-id='type-id-40' name='props'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_destroy_snaps_nvl' mangled-name='zfs_destroy_snaps_nvl' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_destroy_snaps_nvl'>
      <parameter type-id='type-id-162' name='hdl'/>
      <parameter type-id='type-id-40' name='snaps'/>
      <parameter type-id='type-id-5' name='defer'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_destroy_snaps' mangled-name='zfs_destroy_snaps' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_destroy_snaps'>
      <parameter type-id='type-id-201' name='zhp'/>
      <parameter type-id='type-id-1' name='snapname'/>
      <parameter type-id='type-id-5' name='defer'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_destroy' mangled-name='zfs_destroy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_destroy'>
      <parameter type-id='type-id-201' name='zhp'/>
      <parameter type-id='type-id-5' name='defer'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_create' mangled-name='zfs_create' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_create'>
      <parameter type-id='type-id-162' name='hdl'/>
      <parameter type-id='type-id-3' name='path'/>
      <parameter type-id='type-id-129' name='type'/>
      <parameter type-id='type-id-40' name='props'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_create_ancestors' mangled-name='zfs_create_ancestors' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_create_ancestors'>
      <parameter type-id='type-id-162' name='hdl'/>
      <parameter type-id='type-id-3' name='path'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_dataset_exists' mangled-name='zfs_dataset_exists' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_dataset_exists'>
      <parameter type-id='type-id-162' name='hdl'/>
      <parameter type-id='type-id-3' name='path'/>
      <parameter type-id='type-id-129' name='types'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zfs_parent_name' mangled-name='zfs_parent_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_parent_name'>
      <parameter type-id='type-id-201' name='zhp'/>
      <parameter type-id='type-id-1' name='buf'/>
      <parameter type-id='type-id-95' name='buflen'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_get_underlying_type' mangled-name='zfs_get_underlying_type' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_underlying_type'>
      <parameter type-id='type-id-223' name='zhp'/>
      <return type-id='type-id-129'/>
    </function-decl>
    <function-decl name='zfs_get_type' mangled-name='zfs_get_type' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_type'>
      <parameter type-id='type-id-223' name='zhp'/>
      <return type-id='type-id-129'/>
    </function-decl>
    <function-decl name='zfs_get_pool_name' mangled-name='zfs_get_pool_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_pool_name'>
      <parameter type-id='type-id-223' name='zhp'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='zfs_get_name' mangled-name='zfs_get_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_name'>
      <parameter type-id='type-id-223' name='zhp'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='zfs_prop_get_written' mangled-name='zfs_prop_get_written' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_written'>
      <parameter type-id='type-id-201' name='zhp'/>
      <parameter type-id='type-id-3' name='propname'/>
      <parameter type-id='type-id-1' name='propbuf'/>
      <parameter type-id='type-id-2' name='proplen'/>
      <parameter type-id='type-id-5' name='literal'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_prop_get_written_int' mangled-name='zfs_prop_get_written_int' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_written_int'>
      <parameter type-id='type-id-201' name='zhp'/>
      <parameter type-id='type-id-3' name='propname'/>
      <parameter type-id='type-id-130' name='propvalue'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_prop_get_userquota' mangled-name='zfs_prop_get_userquota' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_userquota'>
      <parameter type-id='type-id-201' name='zhp'/>
      <parameter type-id='type-id-3' name='propname'/>
      <parameter type-id='type-id-1' name='propbuf'/>
      <parameter type-id='type-id-2' name='proplen'/>
      <parameter type-id='type-id-5' name='literal'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_prop_get_userquota_int' mangled-name='zfs_prop_get_userquota_int' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_userquota_int'>
      <parameter type-id='type-id-201' name='zhp'/>
      <parameter type-id='type-id-3' name='propname'/>
      <parameter type-id='type-id-130' name='propvalue'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_prop_get_numeric' mangled-name='zfs_prop_get_numeric' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_numeric'>
      <parameter type-id='type-id-201' name='zhp'/>
      <parameter type-id='type-id-128' name='prop'/>
      <parameter type-id='type-id-130' name='value'/>
      <parameter type-id='type-id-229' name='src'/>
      <parameter type-id='type-id-1' name='statbuf'/>
      <parameter type-id='type-id-95' name='statlen'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_prop_get_int' mangled-name='zfs_prop_get_int' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_int'>
      <parameter type-id='type-id-201' name='zhp'/>
      <parameter type-id='type-id-128' name='prop'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='zfs_prop_get' mangled-name='zfs_prop_get' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get'>
      <parameter type-id='type-id-201' name='zhp'/>
      <parameter type-id='type-id-128' name='prop'/>
      <parameter type-id='type-id-1' name='propbuf'/>
      <parameter type-id='type-id-95' name='proplen'/>
      <parameter type-id='type-id-229' name='src'/>
      <parameter type-id='type-id-1' name='statbuf'/>
      <parameter type-id='type-id-95' name='statlen'/>
      <parameter type-id='type-id-5' name='literal'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_get_clones_nvl' mangled-name='zfs_get_clones_nvl' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_clones_nvl'>
      <parameter type-id='type-id-201' name='zhp'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='zfs_prop_get_recvd' mangled-name='zfs_prop_get_recvd' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_recvd'>
      <parameter type-id='type-id-201' name='zhp'/>
      <parameter type-id='type-id-3' name='propname'/>
      <parameter type-id='type-id-1' name='propbuf'/>
      <parameter type-id='type-id-95' name='proplen'/>
      <parameter type-id='type-id-5' name='literal'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='getprop_uint64' mangled-name='getprop_uint64' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getprop_uint64'>
      <parameter type-id='type-id-201' name='zhp'/>
      <parameter type-id='type-id-128' name='prop'/>
      <parameter type-id='type-id-221' name='source'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='zfs_prop_inherit' mangled-name='zfs_prop_inherit' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_inherit'>
      <parameter type-id='type-id-201' name='zhp'/>
      <parameter type-id='type-id-3' name='propname'/>
      <parameter type-id='type-id-5' name='received'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_prop_set_list' mangled-name='zfs_prop_set_list' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_set_list'>
      <parameter type-id='type-id-201' name='zhp'/>
      <parameter type-id='type-id-40' name='props'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_prop_set' mangled-name='zfs_prop_set' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_set'>
      <parameter type-id='type-id-201' name='zhp'/>
      <parameter type-id='type-id-3' name='propname'/>
      <parameter type-id='type-id-3' name='propval'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_valid_proplist' mangled-name='zfs_valid_proplist' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_valid_proplist'>
      <parameter type-id='type-id-162' name='hdl'/>
      <parameter type-id='type-id-129' name='type'/>
      <parameter type-id='type-id-40' name='nvl'/>
      <parameter type-id='type-id-19' name='zoned'/>
      <parameter type-id='type-id-201' name='zhp'/>
      <parameter type-id='type-id-155' name='zpool_hdl'/>
      <parameter type-id='type-id-5' name='key_params_ok'/>
      <parameter type-id='type-id-3' name='errbuf'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='zfs_spa_version' mangled-name='zfs_spa_version' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_spa_version'>
      <parameter type-id='type-id-201' name='zhp'/>
      <parameter type-id='type-id-225' name='spa_version'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='libzfs_mnttab_remove' mangled-name='libzfs_mnttab_remove' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_mnttab_remove'>
      <parameter type-id='type-id-162' name='hdl'/>
      <parameter type-id='type-id-3' name='fsname'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='libzfs_mnttab_add' mangled-name='libzfs_mnttab_add' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_mnttab_add'>
      <parameter type-id='type-id-162' name='hdl'/>
      <parameter type-id='type-id-3' name='special'/>
      <parameter type-id='type-id-3' name='mountp'/>
      <parameter type-id='type-id-3' name='mntopts'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='libzfs_mnttab_find' mangled-name='libzfs_mnttab_find' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_mnttab_find'>
      <parameter type-id='type-id-162' name='hdl'/>
      <parameter type-id='type-id-3' name='fsname'/>
      <parameter type-id='type-id-226' name='entry'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='libzfs_mnttab_cache' mangled-name='libzfs_mnttab_cache' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_mnttab_cache'>
      <parameter type-id='type-id-162' name='hdl'/>
      <parameter type-id='type-id-5' name='enable'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='libzfs_mnttab_fini' mangled-name='libzfs_mnttab_fini' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_mnttab_fini'>
      <parameter type-id='type-id-162' name='hdl'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='libzfs_mnttab_init' mangled-name='libzfs_mnttab_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_mnttab_init'>
      <parameter type-id='type-id-162' name='hdl'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_close' mangled-name='zfs_close' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_close'>
      <parameter type-id='type-id-201' name='zhp'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_open' mangled-name='zfs_open' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_open'>
      <parameter type-id='type-id-162' name='hdl'/>
      <parameter type-id='type-id-3' name='path'/>
      <parameter type-id='type-id-2' name='types'/>
      <return type-id='type-id-201'/>
    </function-decl>
    <function-decl name='zfs_bookmark_exists' mangled-name='zfs_bookmark_exists' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_bookmark_exists'>
      <parameter type-id='type-id-3' name='path'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zfs_handle_dup' mangled-name='zfs_handle_dup' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_handle_dup'>
      <parameter type-id='type-id-201' name='zhp_orig'/>
      <return type-id='type-id-201'/>
    </function-decl>
    <function-decl name='zfs_refresh_properties' mangled-name='zfs_refresh_properties' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_refresh_properties'>
      <parameter type-id='type-id-201' name='zhp'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zpool_free_handles' mangled-name='zpool_free_handles' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_free_handles'>
      <parameter type-id='type-id-162' name='hdl'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_name_valid' mangled-name='zfs_name_valid' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_name_valid'>
      <parameter type-id='type-id-3' name='name'/>
      <parameter type-id='type-id-129' name='type'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_type_to_name' mangled-name='zfs_type_to_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_type_to_name'>
      <parameter type-id='type-id-129' name='type'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-224'>
      <parameter type-id='type-id-55'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-212'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-2'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='libzfs_diff.c' comp-dir-path='/home/brian/zfs_directio_pr/lib/libzfs' language='LANG_C99'>
    <function-decl name='zfs_show_diffs' mangled-name='zfs_show_diffs' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_show_diffs'>
      <parameter type-id='type-id-201' name='zhp'/>
      <parameter type-id='type-id-2' name='outfd'/>
      <parameter type-id='type-id-3' name='fromsnap'/>
      <parameter type-id='type-id-3' name='tosnap'/>
      <parameter type-id='type-id-2' name='flags'/>
      <return type-id='type-id-2'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='libzfs_import.c' comp-dir-path='/home/brian/zfs_directio_pr/lib/libzfs' language='LANG_C99'>
    <typedef-decl name='pool_config_ops_t' type-id='type-id-230' id='type-id-231'/>
    <class-decl name='pool_config_ops' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-232'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pco_refresh_config' type-id='type-id-233' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pco_pool_active' type-id='type-id-234' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='refresh_config_func_t' type-id='type-id-235' id='type-id-236'/>
    <typedef-decl name='pool_active_func_t' type-id='type-id-237' id='type-id-238'/>
    <typedef-decl name='pool_state_t' type-id='type-id-239' id='type-id-240'/>
    <enum-decl name='pool_state' id='type-id-239'>
      <underlying-type type-id='type-id-9'/>
      <enumerator name='POOL_STATE_ACTIVE' value='0'/>
      <enumerator name='POOL_STATE_EXPORTED' value='1'/>
      <enumerator name='POOL_STATE_DESTROYED' value='2'/>
      <enumerator name='POOL_STATE_SPARE' value='3'/>
      <enumerator name='POOL_STATE_L2CACHE' value='4'/>
      <enumerator name='POOL_STATE_UNINITIALIZED' value='5'/>
      <enumerator name='POOL_STATE_UNAVAIL' value='6'/>
      <enumerator name='POOL_STATE_POTENTIALLY_ACTIVE' value='7'/>
    </enum-decl>
    <qualified-type-def type-id='type-id-232' const='yes' id='type-id-230'/>
    <pointer-type-def type-id='type-id-238' size-in-bits='64' id='type-id-234'/>
    <pointer-type-def type-id='type-id-240' size-in-bits='64' id='type-id-241'/>
    <pointer-type-def type-id='type-id-236' size-in-bits='64' id='type-id-233'/>
    <var-decl name='libzfs_config_ops' type-id='type-id-231' mangled-name='libzfs_config_ops' visibility='default' elf-symbol-id='libzfs_config_ops'/>
    <function-decl name='zpool_in_use' mangled-name='zpool_in_use' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_in_use'>
      <parameter type-id='type-id-162' name='hdl'/>
      <parameter type-id='type-id-2' name='fd'/>
      <parameter type-id='type-id-241' name='state'/>
      <parameter type-id='type-id-221' name='namestr'/>
      <parameter type-id='type-id-135' name='inuse'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zpool_clear_label' mangled-name='zpool_clear_label' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_clear_label'>
      <parameter type-id='type-id-2' name='fd'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-237'>
      <parameter type-id='type-id-55'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-135'/>
      <return type-id='type-id-2'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-235'>
      <parameter type-id='type-id-55'/>
      <parameter type-id='type-id-40'/>
      <return type-id='type-id-40'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='libzfs_iter.c' comp-dir-path='/home/brian/zfs_directio_pr/lib/libzfs' language='LANG_C99'>
    <function-decl name='zfs_iter_mounted' mangled-name='zfs_iter_mounted' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_iter_mounted'>
      <parameter type-id='type-id-201' name='zhp'/>
      <parameter type-id='type-id-185' name='func'/>
      <parameter type-id='type-id-55' name='data'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_iter_dependents' mangled-name='zfs_iter_dependents' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_iter_dependents'>
      <parameter type-id='type-id-201' name='zhp'/>
      <parameter type-id='type-id-5' name='allowrecursion'/>
      <parameter type-id='type-id-185' name='func'/>
      <parameter type-id='type-id-55' name='data'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_iter_children' mangled-name='zfs_iter_children' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_iter_children'>
      <parameter type-id='type-id-201' name='zhp'/>
      <parameter type-id='type-id-185' name='func'/>
      <parameter type-id='type-id-55' name='data'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_iter_snapspec' mangled-name='zfs_iter_snapspec' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_iter_snapspec'>
      <parameter type-id='type-id-201' name='fs_zhp'/>
      <parameter type-id='type-id-3' name='spec_orig'/>
      <parameter type-id='type-id-185' name='func'/>
      <parameter type-id='type-id-55' name='arg'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_iter_snapshots_sorted' mangled-name='zfs_iter_snapshots_sorted' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_iter_snapshots_sorted'>
      <parameter type-id='type-id-201' name='zhp'/>
      <parameter type-id='type-id-185' name='callback'/>
      <parameter type-id='type-id-55' name='data'/>
      <parameter type-id='type-id-19' name='min_txg'/>
      <parameter type-id='type-id-19' name='max_txg'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_iter_bookmarks' mangled-name='zfs_iter_bookmarks' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_iter_bookmarks'>
      <parameter type-id='type-id-201' name='zhp'/>
      <parameter type-id='type-id-185' name='func'/>
      <parameter type-id='type-id-55' name='data'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_iter_snapshots' mangled-name='zfs_iter_snapshots' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_iter_snapshots'>
      <parameter type-id='type-id-201' name='zhp'/>
      <parameter type-id='type-id-5' name='simple'/>
      <parameter type-id='type-id-185' name='func'/>
      <parameter type-id='type-id-55' name='data'/>
      <parameter type-id='type-id-19' name='min_txg'/>
      <parameter type-id='type-id-19' name='max_txg'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_iter_filesystems' mangled-name='zfs_iter_filesystems' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_iter_filesystems'>
      <parameter type-id='type-id-201' name='zhp'/>
      <parameter type-id='type-id-185' name='func'/>
      <parameter type-id='type-id-55' name='data'/>
      <return type-id='type-id-2'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='libzfs_mount.c' comp-dir-path='/home/brian/zfs_directio_pr/lib/libzfs' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-242' size-in-bits='384' id='type-id-243'>
      <subrange length='2' type-id='type-id-11' id='type-id-96'/>
    </array-type-def>
    <typedef-decl name='proto_table_t' type-id='type-id-244' id='type-id-242'/>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-242' visibility='default' id='type-id-244'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='p_prop' type-id='type-id-128' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='p_name' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='p_share_err' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='p_unshare_err' type-id='type-id-2' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='get_all_cb_t' type-id='type-id-245' id='type-id-246'/>
    <class-decl name='get_all_cb' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-245'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cb_handles' type-id='type-id-247' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='cb_alloc' type-id='type-id-95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cb_used' type-id='type-id-95' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-246' size-in-bits='64' id='type-id-248'/>
    <pointer-type-def type-id='type-id-201' size-in-bits='64' id='type-id-247'/>
    <var-decl name='proto_table' type-id='type-id-243' visibility='default'/>
    <function-decl name='zpool_disable_datasets' mangled-name='zpool_disable_datasets' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_disable_datasets'>
      <parameter type-id='type-id-155' name='zhp'/>
      <parameter type-id='type-id-5' name='force'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zpool_enable_datasets' mangled-name='zpool_enable_datasets' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_enable_datasets'>
      <parameter type-id='type-id-155' name='zhp'/>
      <parameter type-id='type-id-3' name='mntopts'/>
      <parameter type-id='type-id-2' name='flags'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_foreach_mountpoint' mangled-name='zfs_foreach_mountpoint' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_foreach_mountpoint'>
      <parameter type-id='type-id-162' name='hdl'/>
      <parameter type-id='type-id-247' name='handles'/>
      <parameter type-id='type-id-95' name='num_handles'/>
      <parameter type-id='type-id-185' name='func'/>
      <parameter type-id='type-id-55' name='data'/>
      <parameter type-id='type-id-5' name='parallel'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='libzfs_add_handle' mangled-name='libzfs_add_handle' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_add_handle'>
      <parameter type-id='type-id-248' name='cbp'/>
      <parameter type-id='type-id-201' name='zhp'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_unshareall_bytype' mangled-name='zfs_unshareall_bytype' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_unshareall_bytype'>
      <parameter type-id='type-id-201' name='zhp'/>
      <parameter type-id='type-id-3' name='mountpoint'/>
      <parameter type-id='type-id-3' name='proto'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_unshareall_bypath' mangled-name='zfs_unshareall_bypath' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_unshareall_bypath'>
      <parameter type-id='type-id-201' name='zhp'/>
      <parameter type-id='type-id-3' name='mountpoint'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_unshareall' mangled-name='zfs_unshareall' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_unshareall'>
      <parameter type-id='type-id-201' name='zhp'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_unshareall_smb' mangled-name='zfs_unshareall_smb' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_unshareall_smb'>
      <parameter type-id='type-id-201' name='zhp'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_unshareall_nfs' mangled-name='zfs_unshareall_nfs' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_unshareall_nfs'>
      <parameter type-id='type-id-201' name='zhp'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_unshare_smb' mangled-name='zfs_unshare_smb' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_unshare_smb'>
      <parameter type-id='type-id-201' name='zhp'/>
      <parameter type-id='type-id-3' name='mountpoint'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_unshare_nfs' mangled-name='zfs_unshare_nfs' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_unshare_nfs'>
      <parameter type-id='type-id-201' name='zhp'/>
      <parameter type-id='type-id-3' name='mountpoint'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_shareall' mangled-name='zfs_shareall' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_shareall'>
      <parameter type-id='type-id-201' name='zhp'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_share_smb' mangled-name='zfs_share_smb' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_share_smb'>
      <parameter type-id='type-id-201' name='zhp'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_share_nfs' mangled-name='zfs_share_nfs' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_share_nfs'>
      <parameter type-id='type-id-201' name='zhp'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_commit_shares' mangled-name='zfs_commit_shares' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_commit_shares'>
      <parameter type-id='type-id-3' name='proto'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_commit_all_shares' mangled-name='zfs_commit_all_shares' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_commit_all_shares'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_commit_smb_shares' mangled-name='zfs_commit_smb_shares' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_commit_smb_shares'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_commit_nfs_shares' mangled-name='zfs_commit_nfs_shares' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_commit_nfs_shares'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_is_shared_smb' mangled-name='zfs_is_shared_smb' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_is_shared_smb'>
      <parameter type-id='type-id-201' name='zhp'/>
      <parameter type-id='type-id-221' name='where'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zfs_is_shared_nfs' mangled-name='zfs_is_shared_nfs' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_is_shared_nfs'>
      <parameter type-id='type-id-201' name='zhp'/>
      <parameter type-id='type-id-221' name='where'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zfs_unshare' mangled-name='zfs_unshare' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_unshare'>
      <parameter type-id='type-id-201' name='zhp'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_share' mangled-name='zfs_share' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_share'>
      <parameter type-id='type-id-201' name='zhp'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_is_shared' mangled-name='zfs_is_shared' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_is_shared'>
      <parameter type-id='type-id-201' name='zhp'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zfs_unmountall' mangled-name='zfs_unmountall' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_unmountall'>
      <parameter type-id='type-id-201' name='zhp'/>
      <parameter type-id='type-id-2' name='flags'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_unmount' mangled-name='zfs_unmount' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_unmount'>
      <parameter type-id='type-id-201' name='zhp'/>
      <parameter type-id='type-id-3' name='mountpoint'/>
      <parameter type-id='type-id-2' name='flags'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_mount_at' mangled-name='zfs_mount_at' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_mount_at'>
      <parameter type-id='type-id-201' name='zhp'/>
      <parameter type-id='type-id-3' name='options'/>
      <parameter type-id='type-id-2' name='flags'/>
      <parameter type-id='type-id-3' name='mountpoint'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_mount' mangled-name='zfs_mount' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_mount'>
      <parameter type-id='type-id-201' name='zhp'/>
      <parameter type-id='type-id-3' name='options'/>
      <parameter type-id='type-id-2' name='flags'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_is_mounted' mangled-name='zfs_is_mounted' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_is_mounted'>
      <parameter type-id='type-id-201' name='zhp'/>
      <parameter type-id='type-id-221' name='where'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='is_mounted' mangled-name='is_mounted' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='is_mounted'>
      <parameter type-id='type-id-162' name='zfs_hdl'/>
      <parameter type-id='type-id-3' name='special'/>
      <parameter type-id='type-id-221' name='where'/>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='libzfs_pool.c' comp-dir-path='/home/brian/zfs_directio_pr/lib/libzfs' language='LANG_C99'>
    <typedef-decl name='zpool_compat_status_t' type-id='type-id-249' id='type-id-250'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-249'>
      <underlying-type type-id='type-id-9'/>
      <enumerator name='ZPOOL_COMPATIBILITY_OK' value='0'/>
      <enumerator name='ZPOOL_COMPATIBILITY_WARNTOKEN' value='1'/>
      <enumerator name='ZPOOL_COMPATIBILITY_BADTOKEN' value='2'/>
      <enumerator name='ZPOOL_COMPATIBILITY_BADFILE' value='3'/>
      <enumerator name='ZPOOL_COMPATIBILITY_NOFILES' value='4'/>
    </enum-decl>
    <typedef-decl name='zpool_wait_activity_t' type-id='type-id-251' id='type-id-252'/>
    <enum-decl name='__anonymous_enum__1' is-anonymous='yes' id='type-id-251'>
      <underlying-type type-id='type-id-9'/>
      <enumerator name='ZPOOL_WAIT_CKPT_DISCARD' value='0'/>
      <enumerator name='ZPOOL_WAIT_FREE' value='1'/>
      <enumerator name='ZPOOL_WAIT_INITIALIZE' value='2'/>
      <enumerator name='ZPOOL_WAIT_REPLACE' value='3'/>
      <enumerator name='ZPOOL_WAIT_REMOVE' value='4'/>
      <enumerator name='ZPOOL_WAIT_RESILVER' value='5'/>
      <enumerator name='ZPOOL_WAIT_SCRUB' value='6'/>
      <enumerator name='ZPOOL_WAIT_TRIM' value='7'/>
      <enumerator name='ZPOOL_WAIT_NUM_ACTIVITIES' value='8'/>
    </enum-decl>
    <typedef-decl name='splitflags_t' type-id='type-id-253' id='type-id-254'/>
    <class-decl name='splitflags' size-in-bits='64' is-struct='yes' visibility='default' id='type-id-253'>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='dryrun' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30'>
        <var-decl name='import' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='name_flags' type-id='type-id-2' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='vdev_aux_t' type-id='type-id-255' id='type-id-256'/>
    <enum-decl name='vdev_aux' id='type-id-255'>
      <underlying-type type-id='type-id-9'/>
      <enumerator name='VDEV_AUX_NONE' value='0'/>
      <enumerator name='VDEV_AUX_OPEN_FAILED' value='1'/>
      <enumerator name='VDEV_AUX_CORRUPT_DATA' value='2'/>
      <enumerator name='VDEV_AUX_NO_REPLICAS' value='3'/>
      <enumerator name='VDEV_AUX_BAD_GUID_SUM' value='4'/>
      <enumerator name='VDEV_AUX_TOO_SMALL' value='5'/>
      <enumerator name='VDEV_AUX_BAD_LABEL' value='6'/>
      <enumerator name='VDEV_AUX_VERSION_NEWER' value='7'/>
      <enumerator name='VDEV_AUX_VERSION_OLDER' value='8'/>
      <enumerator name='VDEV_AUX_UNSUP_FEAT' value='9'/>
      <enumerator name='VDEV_AUX_SPARED' value='10'/>
      <enumerator name='VDEV_AUX_ERR_EXCEEDED' value='11'/>
      <enumerator name='VDEV_AUX_IO_FAILURE' value='12'/>
      <enumerator name='VDEV_AUX_BAD_LOG' value='13'/>
      <enumerator name='VDEV_AUX_EXTERNAL' value='14'/>
      <enumerator name='VDEV_AUX_SPLIT_POOL' value='15'/>
      <enumerator name='VDEV_AUX_BAD_ASHIFT' value='16'/>
      <enumerator name='VDEV_AUX_EXTERNAL_PERSIST' value='17'/>
      <enumerator name='VDEV_AUX_ACTIVE' value='18'/>
      <enumerator name='VDEV_AUX_CHILDREN_OFFLINE' value='19'/>
      <enumerator name='VDEV_AUX_ASHIFT_TOO_BIG' value='20'/>
    </enum-decl>
    <typedef-decl name='vdev_state_t' type-id='type-id-257' id='type-id-258'/>
    <enum-decl name='vdev_state' id='type-id-257'>
      <underlying-type type-id='type-id-9'/>
      <enumerator name='VDEV_STATE_UNKNOWN' value='0'/>
      <enumerator name='VDEV_STATE_CLOSED' value='1'/>
      <enumerator name='VDEV_STATE_OFFLINE' value='2'/>
      <enumerator name='VDEV_STATE_REMOVED' value='3'/>
      <enumerator name='VDEV_STATE_CANT_OPEN' value='4'/>
      <enumerator name='VDEV_STATE_FAULTED' value='5'/>
      <enumerator name='VDEV_STATE_DEGRADED' value='6'/>
      <enumerator name='VDEV_STATE_HEALTHY' value='7'/>
    </enum-decl>
    <typedef-decl name='pool_scan_func_t' type-id='type-id-259' id='type-id-260'/>
    <enum-decl name='pool_scan_func' id='type-id-259'>
      <underlying-type type-id='type-id-9'/>
      <enumerator name='POOL_SCAN_NONE' value='0'/>
      <enumerator name='POOL_SCAN_SCRUB' value='1'/>
      <enumerator name='POOL_SCAN_RESILVER' value='2'/>
      <enumerator name='POOL_SCAN_FUNCS' value='3'/>
    </enum-decl>
    <typedef-decl name='pool_scrub_cmd_t' type-id='type-id-261' id='type-id-262'/>
    <enum-decl name='pool_scrub_cmd' id='type-id-261'>
      <underlying-type type-id='type-id-9'/>
      <enumerator name='POOL_SCRUB_NORMAL' value='0'/>
      <enumerator name='POOL_SCRUB_PAUSE' value='1'/>
      <enumerator name='POOL_SCRUB_FLAGS_END' value='2'/>
    </enum-decl>
    <typedef-decl name='pool_trim_func_t' type-id='type-id-263' id='type-id-264'/>
    <enum-decl name='pool_trim_func' id='type-id-263'>
      <underlying-type type-id='type-id-9'/>
      <enumerator name='POOL_TRIM_START' value='0'/>
      <enumerator name='POOL_TRIM_CANCEL' value='1'/>
      <enumerator name='POOL_TRIM_SUSPEND' value='2'/>
      <enumerator name='POOL_TRIM_FUNCS' value='3'/>
    </enum-decl>
    <typedef-decl name='trimflags_t' type-id='type-id-265' id='type-id-266'/>
    <class-decl name='trimflags' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-265'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fullpool' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='secure' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='wait' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='rate' type-id='type-id-19' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='pool_initialize_func_t' type-id='type-id-267' id='type-id-268'/>
    <enum-decl name='pool_initialize_func' id='type-id-267'>
      <underlying-type type-id='type-id-9'/>
      <enumerator name='POOL_INITIALIZE_START' value='0'/>
      <enumerator name='POOL_INITIALIZE_CANCEL' value='1'/>
      <enumerator name='POOL_INITIALIZE_SUSPEND' value='2'/>
      <enumerator name='POOL_INITIALIZE_FUNCS' value='3'/>
    </enum-decl>
    <typedef-decl name='zpool_prop_t' type-id='type-id-134' id='type-id-133'/>
    <enum-decl name='__anonymous_enum__2' is-anonymous='yes' id='type-id-134'>
      <underlying-type type-id='type-id-9'/>
      <enumerator name='ZPOOL_PROP_INVAL' value='-1'/>
      <enumerator name='ZPOOL_PROP_NAME' value='0'/>
      <enumerator name='ZPOOL_PROP_SIZE' value='1'/>
      <enumerator name='ZPOOL_PROP_CAPACITY' value='2'/>
      <enumerator name='ZPOOL_PROP_ALTROOT' value='3'/>
      <enumerator name='ZPOOL_PROP_HEALTH' value='4'/>
      <enumerator name='ZPOOL_PROP_GUID' value='5'/>
      <enumerator name='ZPOOL_PROP_VERSION' value='6'/>
      <enumerator name='ZPOOL_PROP_BOOTFS' value='7'/>
      <enumerator name='ZPOOL_PROP_DELEGATION' value='8'/>
      <enumerator name='ZPOOL_PROP_AUTOREPLACE' value='9'/>
      <enumerator name='ZPOOL_PROP_CACHEFILE' value='10'/>
      <enumerator name='ZPOOL_PROP_FAILUREMODE' value='11'/>
      <enumerator name='ZPOOL_PROP_LISTSNAPS' value='12'/>
      <enumerator name='ZPOOL_PROP_AUTOEXPAND' value='13'/>
      <enumerator name='ZPOOL_PROP_DEDUPDITTO' value='14'/>
      <enumerator name='ZPOOL_PROP_DEDUPRATIO' value='15'/>
      <enumerator name='ZPOOL_PROP_FREE' value='16'/>
      <enumerator name='ZPOOL_PROP_ALLOCATED' value='17'/>
      <enumerator name='ZPOOL_PROP_READONLY' value='18'/>
      <enumerator name='ZPOOL_PROP_ASHIFT' value='19'/>
      <enumerator name='ZPOOL_PROP_COMMENT' value='20'/>
      <enumerator name='ZPOOL_PROP_EXPANDSZ' value='21'/>
      <enumerator name='ZPOOL_PROP_FREEING' value='22'/>
      <enumerator name='ZPOOL_PROP_FRAGMENTATION' value='23'/>
      <enumerator name='ZPOOL_PROP_LEAKED' value='24'/>
      <enumerator name='ZPOOL_PROP_MAXBLOCKSIZE' value='25'/>
      <enumerator name='ZPOOL_PROP_TNAME' value='26'/>
      <enumerator name='ZPOOL_PROP_MAXDNODESIZE' value='27'/>
      <enumerator name='ZPOOL_PROP_MULTIHOST' value='28'/>
      <enumerator name='ZPOOL_PROP_CHECKPOINT' value='29'/>
      <enumerator name='ZPOOL_PROP_LOAD_GUID' value='30'/>
      <enumerator name='ZPOOL_PROP_AUTOTRIM' value='31'/>
      <enumerator name='ZPOOL_PROP_COMPATIBILITY' value='32'/>
      <enumerator name='ZPOOL_NUM_PROPS' value='33'/>
    </enum-decl>
    <qualified-type-def type-id='type-id-41' const='yes' id='type-id-269'/>
    <pointer-type-def type-id='type-id-269' size-in-bits='64' id='type-id-270'/>
    <pointer-type-def type-id='type-id-266' size-in-bits='64' id='type-id-271'/>
    <pointer-type-def type-id='type-id-258' size-in-bits='64' id='type-id-272'/>
    <function-decl name='zpool_load_compat' mangled-name='zpool_load_compat' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_load_compat'>
      <parameter type-id='type-id-3' name='compat'/>
      <parameter type-id='type-id-135' name='features'/>
      <parameter type-id='type-id-1' name='report'/>
      <parameter type-id='type-id-95' name='rlen'/>
      <return type-id='type-id-250'/>
    </function-decl>
    <function-decl name='zpool_get_bootenv' mangled-name='zpool_get_bootenv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_get_bootenv'>
      <parameter type-id='type-id-155' name='zhp'/>
      <parameter type-id='type-id-200' name='nvlp'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zpool_set_bootenv' mangled-name='zpool_set_bootenv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_set_bootenv'>
      <parameter type-id='type-id-155' name='zhp'/>
      <parameter type-id='type-id-270' name='envmap'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zpool_wait_status' mangled-name='zpool_wait_status' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_wait_status'>
      <parameter type-id='type-id-155' name='zhp'/>
      <parameter type-id='type-id-252' name='activity'/>
      <parameter type-id='type-id-135' name='missing'/>
      <parameter type-id='type-id-135' name='waited'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zpool_wait' mangled-name='zpool_wait' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_wait'>
      <parameter type-id='type-id-155' name='zhp'/>
      <parameter type-id='type-id-252' name='activity'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zpool_obj_to_path_ds' mangled-name='zpool_obj_to_path_ds' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_obj_to_path_ds'>
      <parameter type-id='type-id-155' name='zhp'/>
      <parameter type-id='type-id-19' name='dsobj'/>
      <parameter type-id='type-id-19' name='obj'/>
      <parameter type-id='type-id-1' name='pathname'/>
      <parameter type-id='type-id-95' name='len'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zpool_obj_to_path' mangled-name='zpool_obj_to_path' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_obj_to_path'>
      <parameter type-id='type-id-155' name='zhp'/>
      <parameter type-id='type-id-19' name='dsobj'/>
      <parameter type-id='type-id-19' name='obj'/>
      <parameter type-id='type-id-1' name='pathname'/>
      <parameter type-id='type-id-95' name='len'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zpool_events_seek' mangled-name='zpool_events_seek' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_events_seek'>
      <parameter type-id='type-id-162' name='hdl'/>
      <parameter type-id='type-id-19' name='eid'/>
      <parameter type-id='type-id-2' name='zevent_fd'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zpool_events_clear' mangled-name='zpool_events_clear' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_events_clear'>
      <parameter type-id='type-id-162' name='hdl'/>
      <parameter type-id='type-id-225' name='count'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zpool_events_next' mangled-name='zpool_events_next' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_events_next'>
      <parameter type-id='type-id-162' name='hdl'/>
      <parameter type-id='type-id-200' name='nvp'/>
      <parameter type-id='type-id-225' name='dropped'/>
      <parameter type-id='type-id-43' name='flags'/>
      <parameter type-id='type-id-2' name='zevent_fd'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zpool_get_history' mangled-name='zpool_get_history' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_get_history'>
      <parameter type-id='type-id-155' name='zhp'/>
      <parameter type-id='type-id-200' name='nvhisp'/>
      <parameter type-id='type-id-130' name='off'/>
      <parameter type-id='type-id-135' name='eof'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zpool_log_history' mangled-name='zpool_log_history' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_log_history'>
      <parameter type-id='type-id-162' name='hdl'/>
      <parameter type-id='type-id-3' name='message'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_save_arguments' mangled-name='zfs_save_arguments' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_save_arguments'>
      <parameter type-id='type-id-2' name='argc'/>
      <parameter type-id='type-id-221' name='argv'/>
      <parameter type-id='type-id-1' name='string'/>
      <parameter type-id='type-id-2' name='len'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zpool_upgrade' mangled-name='zpool_upgrade' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_upgrade'>
      <parameter type-id='type-id-155' name='zhp'/>
      <parameter type-id='type-id-19' name='new_version'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zpool_get_errlog' mangled-name='zpool_get_errlog' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_get_errlog'>
      <parameter type-id='type-id-155' name='zhp'/>
      <parameter type-id='type-id-200' name='nverrlistp'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zpool_vdev_name' mangled-name='zpool_vdev_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_vdev_name'>
      <parameter type-id='type-id-162' name='hdl'/>
      <parameter type-id='type-id-155' name='zhp'/>
      <parameter type-id='type-id-40' name='nv'/>
      <parameter type-id='type-id-2' name='name_flags'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zpool_sync_one' mangled-name='zpool_sync_one' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_sync_one'>
      <parameter type-id='type-id-155' name='zhp'/>
      <parameter type-id='type-id-55' name='data'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zpool_reopen_one' mangled-name='zpool_reopen_one' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_reopen_one'>
      <parameter type-id='type-id-155' name='zhp'/>
      <parameter type-id='type-id-55' name='data'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zpool_reguid' mangled-name='zpool_reguid' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_reguid'>
      <parameter type-id='type-id-155' name='zhp'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zpool_vdev_clear' mangled-name='zpool_vdev_clear' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_vdev_clear'>
      <parameter type-id='type-id-155' name='zhp'/>
      <parameter type-id='type-id-19' name='guid'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zpool_clear' mangled-name='zpool_clear' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_clear'>
      <parameter type-id='type-id-155' name='zhp'/>
      <parameter type-id='type-id-3' name='path'/>
      <parameter type-id='type-id-40' name='rewindnvl'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zpool_vdev_indirect_size' mangled-name='zpool_vdev_indirect_size' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_vdev_indirect_size'>
      <parameter type-id='type-id-155' name='zhp'/>
      <parameter type-id='type-id-3' name='path'/>
      <parameter type-id='type-id-130' name='sizep'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zpool_vdev_remove_cancel' mangled-name='zpool_vdev_remove_cancel' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_vdev_remove_cancel'>
      <parameter type-id='type-id-155' name='zhp'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zpool_vdev_remove' mangled-name='zpool_vdev_remove' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_vdev_remove'>
      <parameter type-id='type-id-155' name='zhp'/>
      <parameter type-id='type-id-3' name='path'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zpool_vdev_split' mangled-name='zpool_vdev_split' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_vdev_split'>
      <parameter type-id='type-id-155' name='zhp'/>
      <parameter type-id='type-id-1' name='newname'/>
      <parameter type-id='type-id-200' name='newroot'/>
      <parameter type-id='type-id-40' name='props'/>
      <parameter type-id='type-id-254' name='flags'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zpool_vdev_detach' mangled-name='zpool_vdev_detach' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_vdev_detach'>
      <parameter type-id='type-id-155' name='zhp'/>
      <parameter type-id='type-id-3' name='path'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zpool_vdev_attach' mangled-name='zpool_vdev_attach' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_vdev_attach'>
      <parameter type-id='type-id-155' name='zhp'/>
      <parameter type-id='type-id-3' name='old_disk'/>
      <parameter type-id='type-id-3' name='new_disk'/>
      <parameter type-id='type-id-40' name='nvroot'/>
      <parameter type-id='type-id-2' name='replacing'/>
      <parameter type-id='type-id-5' name='rebuild'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zpool_vdev_degrade' mangled-name='zpool_vdev_degrade' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_vdev_degrade'>
      <parameter type-id='type-id-155' name='zhp'/>
      <parameter type-id='type-id-19' name='guid'/>
      <parameter type-id='type-id-256' name='aux'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zpool_vdev_fault' mangled-name='zpool_vdev_fault' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_vdev_fault'>
      <parameter type-id='type-id-155' name='zhp'/>
      <parameter type-id='type-id-19' name='guid'/>
      <parameter type-id='type-id-256' name='aux'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zpool_vdev_offline' mangled-name='zpool_vdev_offline' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_vdev_offline'>
      <parameter type-id='type-id-155' name='zhp'/>
      <parameter type-id='type-id-3' name='path'/>
      <parameter type-id='type-id-5' name='istmp'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zpool_vdev_online' mangled-name='zpool_vdev_online' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_vdev_online'>
      <parameter type-id='type-id-155' name='zhp'/>
      <parameter type-id='type-id-3' name='path'/>
      <parameter type-id='type-id-2' name='flags'/>
      <parameter type-id='type-id-272' name='newstate'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zpool_vdev_path_to_guid' mangled-name='zpool_vdev_path_to_guid' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_vdev_path_to_guid'>
      <parameter type-id='type-id-155' name='zhp'/>
      <parameter type-id='type-id-3' name='path'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='zpool_get_physpath' mangled-name='zpool_get_physpath' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_get_physpath'>
      <parameter type-id='type-id-155' name='zhp'/>
      <parameter type-id='type-id-1' name='physpath'/>
      <parameter type-id='type-id-95' name='phypath_size'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zpool_find_vdev' mangled-name='zpool_find_vdev' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_find_vdev'>
      <parameter type-id='type-id-155' name='zhp'/>
      <parameter type-id='type-id-3' name='path'/>
      <parameter type-id='type-id-135' name='avail_spare'/>
      <parameter type-id='type-id-135' name='l2cache'/>
      <parameter type-id='type-id-135' name='log'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='zpool_find_vdev_by_physpath' mangled-name='zpool_find_vdev_by_physpath' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_find_vdev_by_physpath'>
      <parameter type-id='type-id-155' name='zhp'/>
      <parameter type-id='type-id-3' name='ppath'/>
      <parameter type-id='type-id-135' name='avail_spare'/>
      <parameter type-id='type-id-135' name='l2cache'/>
      <parameter type-id='type-id-135' name='log'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='zpool_scan' mangled-name='zpool_scan' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_scan'>
      <parameter type-id='type-id-155' name='zhp'/>
      <parameter type-id='type-id-260' name='func'/>
      <parameter type-id='type-id-262' name='cmd'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zpool_trim' mangled-name='zpool_trim' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_trim'>
      <parameter type-id='type-id-155' name='zhp'/>
      <parameter type-id='type-id-264' name='cmd_type'/>
      <parameter type-id='type-id-40' name='vds'/>
      <parameter type-id='type-id-271' name='trim_flags'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zpool_initialize_wait' mangled-name='zpool_initialize_wait' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_initialize_wait'>
      <parameter type-id='type-id-155' name='zhp'/>
      <parameter type-id='type-id-268' name='cmd_type'/>
      <parameter type-id='type-id-40' name='vds'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zpool_initialize' mangled-name='zpool_initialize' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_initialize'>
      <parameter type-id='type-id-155' name='zhp'/>
      <parameter type-id='type-id-268' name='cmd_type'/>
      <parameter type-id='type-id-40' name='vds'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zpool_import_props' mangled-name='zpool_import_props' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_import_props'>
      <parameter type-id='type-id-162' name='hdl'/>
      <parameter type-id='type-id-40' name='config'/>
      <parameter type-id='type-id-3' name='newname'/>
      <parameter type-id='type-id-40' name='props'/>
      <parameter type-id='type-id-2' name='flags'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zpool_print_unsup_feat' mangled-name='zpool_print_unsup_feat' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_print_unsup_feat'>
      <parameter type-id='type-id-40' name='config'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zpool_import' mangled-name='zpool_import' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_import'>
      <parameter type-id='type-id-162' name='hdl'/>
      <parameter type-id='type-id-40' name='config'/>
      <parameter type-id='type-id-3' name='newname'/>
      <parameter type-id='type-id-1' name='altroot'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zpool_explain_recover' mangled-name='zpool_explain_recover' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_explain_recover'>
      <parameter type-id='type-id-162' name='hdl'/>
      <parameter type-id='type-id-3' name='name'/>
      <parameter type-id='type-id-2' name='reason'/>
      <parameter type-id='type-id-40' name='config'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zpool_export_force' mangled-name='zpool_export_force' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_export_force'>
      <parameter type-id='type-id-155' name='zhp'/>
      <parameter type-id='type-id-3' name='log_str'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zpool_export' mangled-name='zpool_export' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_export'>
      <parameter type-id='type-id-155' name='zhp'/>
      <parameter type-id='type-id-5' name='force'/>
      <parameter type-id='type-id-3' name='log_str'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zpool_add' mangled-name='zpool_add' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_add'>
      <parameter type-id='type-id-155' name='zhp'/>
      <parameter type-id='type-id-40' name='nvroot'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zpool_discard_checkpoint' mangled-name='zpool_discard_checkpoint' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_discard_checkpoint'>
      <parameter type-id='type-id-155' name='zhp'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zpool_checkpoint' mangled-name='zpool_checkpoint' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_checkpoint'>
      <parameter type-id='type-id-155' name='zhp'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zpool_destroy' mangled-name='zpool_destroy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_destroy'>
      <parameter type-id='type-id-155' name='zhp'/>
      <parameter type-id='type-id-3' name='log_str'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zpool_create' mangled-name='zpool_create' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_create'>
      <parameter type-id='type-id-162' name='hdl'/>
      <parameter type-id='type-id-3' name='pool'/>
      <parameter type-id='type-id-40' name='nvroot'/>
      <parameter type-id='type-id-40' name='props'/>
      <parameter type-id='type-id-40' name='fsprops'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zpool_is_draid_spare' mangled-name='zpool_is_draid_spare' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_is_draid_spare'>
      <parameter type-id='type-id-3' name='name'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zpool_get_state' mangled-name='zpool_get_state' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_get_state'>
      <parameter type-id='type-id-155' name='zhp'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zpool_get_name' mangled-name='zpool_get_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_get_name'>
      <parameter type-id='type-id-155' name='zhp'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='zpool_close' mangled-name='zpool_close' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_close'>
      <parameter type-id='type-id-155' name='zhp'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zpool_open' mangled-name='zpool_open' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_open'>
      <parameter type-id='type-id-162' name='hdl'/>
      <parameter type-id='type-id-3' name='pool'/>
      <return type-id='type-id-155'/>
    </function-decl>
    <function-decl name='zpool_open_canfail' mangled-name='zpool_open_canfail' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_open_canfail'>
      <parameter type-id='type-id-162' name='hdl'/>
      <parameter type-id='type-id-3' name='pool'/>
      <return type-id='type-id-155'/>
    </function-decl>
    <function-decl name='zpool_prop_get_feature' mangled-name='zpool_prop_get_feature' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_prop_get_feature'>
      <parameter type-id='type-id-155' name='zhp'/>
      <parameter type-id='type-id-3' name='propname'/>
      <parameter type-id='type-id-1' name='buf'/>
      <parameter type-id='type-id-95' name='len'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zpool_expand_proplist' mangled-name='zpool_expand_proplist' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_expand_proplist'>
      <parameter type-id='type-id-155' name='zhp'/>
      <parameter type-id='type-id-228' name='plp'/>
      <parameter type-id='type-id-5' name='literal'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zpool_set_prop' mangled-name='zpool_set_prop' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_set_prop'>
      <parameter type-id='type-id-155' name='zhp'/>
      <parameter type-id='type-id-3' name='propname'/>
      <parameter type-id='type-id-3' name='propval'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zpool_get_prop' mangled-name='zpool_get_prop' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_get_prop'>
      <parameter type-id='type-id-155' name='zhp'/>
      <parameter type-id='type-id-133' name='prop'/>
      <parameter type-id='type-id-1' name='buf'/>
      <parameter type-id='type-id-95' name='len'/>
      <parameter type-id='type-id-229' name='srctype'/>
      <parameter type-id='type-id-5' name='literal'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zpool_get_state_str' mangled-name='zpool_get_state_str' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_get_state_str'>
      <parameter type-id='type-id-155' name='zhp'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='zpool_pool_state_to_name' mangled-name='zpool_pool_state_to_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_pool_state_to_name'>
      <parameter type-id='type-id-240' name='state'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='zpool_state_to_name' mangled-name='zpool_state_to_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_state_to_name'>
      <parameter type-id='type-id-258' name='state'/>
      <parameter type-id='type-id-256' name='aux'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='zpool_get_prop_int' mangled-name='zpool_get_prop_int' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_get_prop_int'>
      <parameter type-id='type-id-155' name='zhp'/>
      <parameter type-id='type-id-133' name='prop'/>
      <parameter type-id='type-id-229' name='src'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='zpool_props_refresh' mangled-name='zpool_props_refresh' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_props_refresh'>
      <parameter type-id='type-id-155' name='zhp'/>
      <return type-id='type-id-2'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='libzfs_sendrecv.c' comp-dir-path='/home/brian/zfs_directio_pr/lib/libzfs' language='LANG_C99'>
    <typedef-decl name='recvflags_t' type-id='type-id-273' id='type-id-274'/>
    <class-decl name='recvflags' size-in-bits='416' is-struct='yes' visibility='default' id='type-id-273'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='verbose' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='isprefix' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='istail' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='dryrun' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='force' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='canmountoff' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='resumable' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='byteswap' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='nomount' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='holds' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='skipholds' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='domount' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='forceunmount' type-id='type-id-5' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='sendflags_t' type-id='type-id-275' id='type-id-276'/>
    <class-decl name='sendflags' size-in-bits='544' is-struct='yes' visibility='default' id='type-id-275'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='verbosity' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='replicate' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='skipmissing' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='doall' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='fromorigin' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='pad' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='props' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='dryrun' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='parsable' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='progress' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='largeblock' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='embed_data' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='compress' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='raw' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='backup' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='holds' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='saved' type-id='type-id-5' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='snapfilter_cb_t' type-id='type-id-277' id='type-id-278'/>
    <pointer-type-def type-id='type-id-159' size-in-bits='64' id='type-id-279'/>
    <pointer-type-def type-id='type-id-274' size-in-bits='64' id='type-id-280'/>
    <pointer-type-def type-id='type-id-276' size-in-bits='64' id='type-id-281'/>
    <pointer-type-def type-id='type-id-278' size-in-bits='64' id='type-id-282'/>
    <function-decl name='zfs_receive' mangled-name='zfs_receive' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_receive'>
      <parameter type-id='type-id-162' name='hdl'/>
      <parameter type-id='type-id-3' name='tosnap'/>
      <parameter type-id='type-id-40' name='props'/>
      <parameter type-id='type-id-280' name='flags'/>
      <parameter type-id='type-id-2' name='infd'/>
      <parameter type-id='type-id-279' name='stream_avl'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_send_one' mangled-name='zfs_send_one' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_send_one'>
      <parameter type-id='type-id-201' name='zhp'/>
      <parameter type-id='type-id-3' name='from'/>
      <parameter type-id='type-id-2' name='fd'/>
      <parameter type-id='type-id-281' name='flags'/>
      <parameter type-id='type-id-3' name='redactbook'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_send' mangled-name='zfs_send' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_send'>
      <parameter type-id='type-id-201' name='zhp'/>
      <parameter type-id='type-id-3' name='fromsnap'/>
      <parameter type-id='type-id-3' name='tosnap'/>
      <parameter type-id='type-id-281' name='flags'/>
      <parameter type-id='type-id-2' name='outfd'/>
      <parameter type-id='type-id-282' name='filter_func'/>
      <parameter type-id='type-id-55' name='cb_arg'/>
      <parameter type-id='type-id-200' name='debugnvp'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_send_saved' mangled-name='zfs_send_saved' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_send_saved'>
      <parameter type-id='type-id-201' name='zhp'/>
      <parameter type-id='type-id-281' name='flags'/>
      <parameter type-id='type-id-2' name='outfd'/>
      <parameter type-id='type-id-3' name='resume_token'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_send_resume' mangled-name='zfs_send_resume' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_send_resume'>
      <parameter type-id='type-id-162' name='hdl'/>
      <parameter type-id='type-id-281' name='flags'/>
      <parameter type-id='type-id-2' name='outfd'/>
      <parameter type-id='type-id-3' name='resume_token'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_send_resume_token_to_nvlist' mangled-name='zfs_send_resume_token_to_nvlist' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_send_resume_token_to_nvlist'>
      <parameter type-id='type-id-162' name='hdl'/>
      <parameter type-id='type-id-3' name='token'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='zfs_send_progress' mangled-name='zfs_send_progress' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_send_progress'>
      <parameter type-id='type-id-201' name='zhp'/>
      <parameter type-id='type-id-2' name='fd'/>
      <parameter type-id='type-id-130' name='bytes_written'/>
      <parameter type-id='type-id-130' name='blocks_visited'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-277'>
      <parameter type-id='type-id-201'/>
      <parameter type-id='type-id-55'/>
      <return type-id='type-id-5'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='libzfs_status.c' comp-dir-path='/home/brian/zfs_directio_pr/lib/libzfs' language='LANG_C99'>
    <typedef-decl name='zpool_status_t' type-id='type-id-283' id='type-id-284'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-283'>
      <underlying-type type-id='type-id-9'/>
      <enumerator name='ZPOOL_STATUS_CORRUPT_CACHE' value='0'/>
      <enumerator name='ZPOOL_STATUS_MISSING_DEV_R' value='1'/>
      <enumerator name='ZPOOL_STATUS_MISSING_DEV_NR' value='2'/>
      <enumerator name='ZPOOL_STATUS_CORRUPT_LABEL_R' value='3'/>
      <enumerator name='ZPOOL_STATUS_CORRUPT_LABEL_NR' value='4'/>
      <enumerator name='ZPOOL_STATUS_BAD_GUID_SUM' value='5'/>
      <enumerator name='ZPOOL_STATUS_CORRUPT_POOL' value='6'/>
      <enumerator name='ZPOOL_STATUS_CORRUPT_DATA' value='7'/>
      <enumerator name='ZPOOL_STATUS_FAILING_DEV' value='8'/>
      <enumerator name='ZPOOL_STATUS_VERSION_NEWER' value='9'/>
      <enumerator name='ZPOOL_STATUS_HOSTID_MISMATCH' value='10'/>
      <enumerator name='ZPOOL_STATUS_HOSTID_ACTIVE' value='11'/>
      <enumerator name='ZPOOL_STATUS_HOSTID_REQUIRED' value='12'/>
      <enumerator name='ZPOOL_STATUS_IO_FAILURE_WAIT' value='13'/>
      <enumerator name='ZPOOL_STATUS_IO_FAILURE_CONTINUE' value='14'/>
      <enumerator name='ZPOOL_STATUS_IO_FAILURE_MMP' value='15'/>
      <enumerator name='ZPOOL_STATUS_BAD_LOG' value='16'/>
      <enumerator name='ZPOOL_STATUS_ERRATA' value='17'/>
      <enumerator name='ZPOOL_STATUS_UNSUP_FEAT_READ' value='18'/>
      <enumerator name='ZPOOL_STATUS_UNSUP_FEAT_WRITE' value='19'/>
      <enumerator name='ZPOOL_STATUS_FAULTED_DEV_R' value='20'/>
      <enumerator name='ZPOOL_STATUS_FAULTED_DEV_NR' value='21'/>
      <enumerator name='ZPOOL_STATUS_VERSION_OLDER' value='22'/>
      <enumerator name='ZPOOL_STATUS_FEAT_DISABLED' value='23'/>
      <enumerator name='ZPOOL_STATUS_RESILVERING' value='24'/>
      <enumerator name='ZPOOL_STATUS_OFFLINE_DEV' value='25'/>
      <enumerator name='ZPOOL_STATUS_REMOVED_DEV' value='26'/>
      <enumerator name='ZPOOL_STATUS_REBUILDING' value='27'/>
      <enumerator name='ZPOOL_STATUS_REBUILD_SCRUB' value='28'/>
      <enumerator name='ZPOOL_STATUS_NON_NATIVE_ASHIFT' value='29'/>
      <enumerator name='ZPOOL_STATUS_COMPATIBILITY_ERR' value='30'/>
      <enumerator name='ZPOOL_STATUS_INCOMPATIBLE_FEAT' value='31'/>
      <enumerator name='ZPOOL_STATUS_OK' value='32'/>
    </enum-decl>
    <typedef-decl name='zpool_errata_t' type-id='type-id-285' id='type-id-286'/>
    <enum-decl name='zpool_errata' id='type-id-285'>
      <underlying-type type-id='type-id-9'/>
      <enumerator name='ZPOOL_ERRATA_NONE' value='0'/>
      <enumerator name='ZPOOL_ERRATA_ZOL_2094_SCRUB' value='1'/>
      <enumerator name='ZPOOL_ERRATA_ZOL_2094_ASYNC_DESTROY' value='2'/>
      <enumerator name='ZPOOL_ERRATA_ZOL_6845_ENCRYPTION' value='3'/>
      <enumerator name='ZPOOL_ERRATA_ZOL_8308_ENCRYPTION' value='4'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-286' size-in-bits='64' id='type-id-287'/>
    <function-decl name='zpool_import_status' mangled-name='zpool_import_status' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_import_status'>
      <parameter type-id='type-id-40' name='config'/>
      <parameter type-id='type-id-221' name='msgid'/>
      <parameter type-id='type-id-287' name='errata'/>
      <return type-id='type-id-284'/>
    </function-decl>
    <function-decl name='zpool_get_status' mangled-name='zpool_get_status' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_get_status'>
      <parameter type-id='type-id-155' name='zhp'/>
      <parameter type-id='type-id-221' name='msgid'/>
      <parameter type-id='type-id-287' name='errata'/>
      <return type-id='type-id-284'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='libzfs_util.c' comp-dir-path='/home/brian/zfs_directio_pr/lib/libzfs' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='192' id='type-id-288'>
      <subrange length='6' type-id='type-id-11' id='type-id-289'/>
    </array-type-def>
    <type-decl name='variadic parameter type' id='type-id-290'/>
    <array-type-def dimensions='1' type-id='type-id-291' size-in-bits='160' alignment-in-bits='32' id='type-id-292'>
      <subrange length='5' type-id='type-id-11' id='type-id-293'/>
    </array-type-def>
    <typedef-decl name='zprop_func' type-id='type-id-137' id='type-id-136'/>
    <typedef-decl name='zprop_get_cbdata_t' type-id='type-id-294' id='type-id-295'/>
    <class-decl name='zprop_get_cbdata' size-in-bits='640' is-struct='yes' visibility='default' id='type-id-294'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cb_sources' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='cb_columns' type-id='type-id-292' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='cb_colwidths' type-id='type-id-288' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='cb_scripted' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='cb_literal' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='cb_first' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='cb_proplist' type-id='type-id-227' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='cb_type' type-id='type-id-129' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zfs_get_column_t' type-id='type-id-296' id='type-id-291'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-296'>
      <underlying-type type-id='type-id-9'/>
      <enumerator name='GET_COL_NONE' value='0'/>
      <enumerator name='GET_COL_NAME' value='1'/>
      <enumerator name='GET_COL_PROPERTY' value='2'/>
      <enumerator name='GET_COL_VALUE' value='3'/>
      <enumerator name='GET_COL_RECVD' value='4'/>
      <enumerator name='GET_COL_SOURCE' value='5'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-221' size-in-bits='64' id='type-id-297'/>
    <pointer-type-def type-id='type-id-138' size-in-bits='64' id='type-id-137'/>
    <pointer-type-def type-id='type-id-295' size-in-bits='64' id='type-id-298'/>
    <function-decl name='printf_color' mangled-name='printf_color' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='printf_color'>
      <parameter type-id='type-id-1' name='color'/>
      <parameter type-id='type-id-1' name='format'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='color_end' mangled-name='color_end' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='color_end'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='color_start' mangled-name='color_start' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='color_start'>
      <parameter type-id='type-id-1' name='color'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_version_print' mangled-name='zfs_version_print' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_version_print'>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_version_userland' mangled-name='zfs_version_userland' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_version_userland'>
      <parameter type-id='type-id-1' name='version'/>
      <parameter type-id='type-id-2' name='len'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zprop_iter' mangled-name='zprop_iter' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zprop_iter'>
      <parameter type-id='type-id-136' name='func'/>
      <parameter type-id='type-id-55' name='cb'/>
      <parameter type-id='type-id-5' name='show_all'/>
      <parameter type-id='type-id-5' name='ordered'/>
      <parameter type-id='type-id-129' name='type'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zprop_free_list' mangled-name='zprop_free_list' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zprop_free_list'>
      <parameter type-id='type-id-227' name='pl'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zprop_get_list' mangled-name='zprop_get_list' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zprop_get_list'>
      <parameter type-id='type-id-162' name='hdl'/>
      <parameter type-id='type-id-1' name='props'/>
      <parameter type-id='type-id-228' name='listp'/>
      <parameter type-id='type-id-129' name='type'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_nicestrtonum' mangled-name='zfs_nicestrtonum' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_nicestrtonum'>
      <parameter type-id='type-id-162' name='hdl'/>
      <parameter type-id='type-id-3' name='value'/>
      <parameter type-id='type-id-130' name='num'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zprop_print_one_property' mangled-name='zprop_print_one_property' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zprop_print_one_property'>
      <parameter type-id='type-id-3' name='name'/>
      <parameter type-id='type-id-298' name='cbp'/>
      <parameter type-id='type-id-3' name='propname'/>
      <parameter type-id='type-id-3' name='value'/>
      <parameter type-id='type-id-219' name='sourcetype'/>
      <parameter type-id='type-id-3' name='source'/>
      <parameter type-id='type-id-3' name='recvd_value'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_path_to_zhandle' mangled-name='zfs_path_to_zhandle' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_path_to_zhandle'>
      <parameter type-id='type-id-162' name='hdl'/>
      <parameter type-id='type-id-3' name='path'/>
      <parameter type-id='type-id-129' name='argtype'/>
      <return type-id='type-id-201'/>
    </function-decl>
    <function-decl name='zfs_get_pool_handle' mangled-name='zfs_get_pool_handle' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_pool_handle'>
      <parameter type-id='type-id-223' name='zhp'/>
      <return type-id='type-id-155'/>
    </function-decl>
    <function-decl name='zfs_get_handle' mangled-name='zfs_get_handle' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_handle'>
      <parameter type-id='type-id-201' name='zhp'/>
      <return type-id='type-id-162'/>
    </function-decl>
    <function-decl name='zpool_get_handle' mangled-name='zpool_get_handle' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_get_handle'>
      <parameter type-id='type-id-155' name='zhp'/>
      <return type-id='type-id-162'/>
    </function-decl>
    <function-decl name='libzfs_fini' mangled-name='libzfs_fini' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_fini'>
      <parameter type-id='type-id-162' name='hdl'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='libzfs_init' mangled-name='libzfs_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_init'>
      <return type-id='type-id-162'/>
    </function-decl>
    <function-decl name='libzfs_envvar_is_set' mangled-name='libzfs_envvar_is_set' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_envvar_is_set'>
      <parameter type-id='type-id-1' name='envvar'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='libzfs_free_str_array' mangled-name='libzfs_free_str_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_free_str_array'>
      <parameter type-id='type-id-221' name='strs'/>
      <parameter type-id='type-id-2' name='count'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='libzfs_run_process_get_stdout_nopath' mangled-name='libzfs_run_process_get_stdout_nopath' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_run_process_get_stdout_nopath'>
      <parameter type-id='type-id-3' name='path'/>
      <parameter type-id='type-id-221' name='argv'/>
      <parameter type-id='type-id-221' name='env'/>
      <parameter type-id='type-id-297' name='lines'/>
      <parameter type-id='type-id-225' name='lines_cnt'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='libzfs_run_process_get_stdout' mangled-name='libzfs_run_process_get_stdout' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_run_process_get_stdout'>
      <parameter type-id='type-id-3' name='path'/>
      <parameter type-id='type-id-221' name='argv'/>
      <parameter type-id='type-id-221' name='env'/>
      <parameter type-id='type-id-297' name='lines'/>
      <parameter type-id='type-id-225' name='lines_cnt'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='libzfs_run_process' mangled-name='libzfs_run_process' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_run_process'>
      <parameter type-id='type-id-3' name='path'/>
      <parameter type-id='type-id-221' name='argv'/>
      <parameter type-id='type-id-2' name='flags'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='libzfs_print_on_error' mangled-name='libzfs_print_on_error' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_print_on_error'>
      <parameter type-id='type-id-162' name='hdl'/>
      <parameter type-id='type-id-5' name='printerr'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_standard_error' mangled-name='zfs_standard_error' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_standard_error'>
      <parameter type-id='type-id-162' name='hdl'/>
      <parameter type-id='type-id-2' name='error'/>
      <parameter type-id='type-id-3' name='msg'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='libzfs_error_description' mangled-name='libzfs_error_description' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_error_description'>
      <parameter type-id='type-id-162' name='hdl'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='libzfs_error_action' mangled-name='libzfs_error_action' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_error_action'>
      <parameter type-id='type-id-162' name='hdl'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='libzfs_errno' mangled-name='libzfs_errno' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_errno'>
      <parameter type-id='type-id-162' name='hdl'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-138'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-55'/>
      <return type-id='type-id-2'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='os/linux/libzfs_mount_os.c' comp-dir-path='/home/brian/zfs_directio_pr/lib/libzfs' language='LANG_C99'>
    <pointer-type-def type-id='type-id-11' size-in-bits='64' id='type-id-299'/>
    <function-decl name='zfs_mount_delegation_check' mangled-name='zfs_mount_delegation_check' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_mount_delegation_check'>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zfs_adjust_mount_options' mangled-name='zfs_adjust_mount_options' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_adjust_mount_options'>
      <parameter type-id='type-id-201' name='zhp'/>
      <parameter type-id='type-id-3' name='mntpoint'/>
      <parameter type-id='type-id-1' name='mntopts'/>
      <parameter type-id='type-id-1' name='mtabopt'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_parse_mount_options' mangled-name='zfs_parse_mount_options' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_parse_mount_options'>
      <parameter type-id='type-id-1' name='mntopts'/>
      <parameter type-id='type-id-299' name='mntflags'/>
      <parameter type-id='type-id-299' name='zfsflags'/>
      <parameter type-id='type-id-2' name='sloppy'/>
      <parameter type-id='type-id-1' name='badopt'/>
      <parameter type-id='type-id-1' name='mtabopt'/>
      <return type-id='type-id-2'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='os/linux/libzfs_pool_os.c' comp-dir-path='/home/brian/zfs_directio_pr/lib/libzfs' language='LANG_C99'>
    <function-decl name='zpool_label_disk' mangled-name='zpool_label_disk' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_label_disk'>
      <parameter type-id='type-id-162' name='hdl'/>
      <parameter type-id='type-id-155' name='zhp'/>
      <parameter type-id='type-id-3' name='name'/>
      <return type-id='type-id-2'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='os/linux/libzfs_util_os.c' comp-dir-path='/home/brian/zfs_directio_pr/lib/libzfs' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='32768' id='type-id-15'>
      <subrange length='4096' type-id='type-id-11' id='type-id-18'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='65536' id='type-id-300'>
      <subrange length='8192' type-id='type-id-11' id='type-id-301'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-19' size-in-bits='128' id='type-id-88'>
      <subrange length='2' type-id='type-id-11' id='type-id-96'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-192' size-in-bits='24' id='type-id-302'>
      <subrange length='3' type-id='type-id-11' id='type-id-303'/>
    </array-type-def>
    <typedef-decl name='zfs_cmd_t' type-id='type-id-304' id='type-id-305'/>
    <class-decl name='zfs_cmd' size-in-bits='109952' is-struct='yes' visibility='default' id='type-id-304'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zc_name' type-id='type-id-15' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32768'>
        <var-decl name='zc_nvlist_src' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32832'>
        <var-decl name='zc_nvlist_src_size' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32896'>
        <var-decl name='zc_nvlist_dst' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32960'>
        <var-decl name='zc_nvlist_dst_size' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33024'>
        <var-decl name='zc_nvlist_dst_filled' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33056'>
        <var-decl name='zc_pad2' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33088'>
        <var-decl name='zc_history' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33152'>
        <var-decl name='zc_value' type-id='type-id-300' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='98688'>
        <var-decl name='zc_string' type-id='type-id-143' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='100736'>
        <var-decl name='zc_guid' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='100800'>
        <var-decl name='zc_nvlist_conf' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='100864'>
        <var-decl name='zc_nvlist_conf_size' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='100928'>
        <var-decl name='zc_cookie' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='100992'>
        <var-decl name='zc_objset_type' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101056'>
        <var-decl name='zc_perm_action' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101120'>
        <var-decl name='zc_history_len' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101184'>
        <var-decl name='zc_history_offset' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101248'>
        <var-decl name='zc_obj' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101312'>
        <var-decl name='zc_iflags' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101376'>
        <var-decl name='zc_share' type-id='type-id-306' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101632'>
        <var-decl name='zc_objset_stats' type-id='type-id-188' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='103936'>
        <var-decl name='zc_begin_record' type-id='type-id-307' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='106368'>
        <var-decl name='zc_inject_record' type-id='type-id-308' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109184'>
        <var-decl name='zc_defer_destroy' type-id='type-id-38' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109216'>
        <var-decl name='zc_flags' type-id='type-id-38' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109248'>
        <var-decl name='zc_action_handle' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109312'>
        <var-decl name='zc_cleanup_fd' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109344'>
        <var-decl name='zc_simple' type-id='type-id-192' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109352'>
        <var-decl name='zc_pad' type-id='type-id-302' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109376'>
        <var-decl name='zc_sendobj' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109440'>
        <var-decl name='zc_fromobj' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109504'>
        <var-decl name='zc_createtxg' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109568'>
        <var-decl name='zc_stat' type-id='type-id-309' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109888'>
        <var-decl name='zc_zoneid' type-id='type-id-19' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zfs_share_t' type-id='type-id-310' id='type-id-306'/>
    <class-decl name='zfs_share' size-in-bits='256' is-struct='yes' visibility='default' id='type-id-310'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='z_exportdata' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='z_sharedata' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='z_sharetype' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='z_sharemax' type-id='type-id-19' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='drr_begin' size-in-bits='2432' is-struct='yes' visibility='default' id='type-id-307'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_magic' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_versioninfo' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='drr_creation_time' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='drr_type' type-id='type-id-191' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='drr_flags' type-id='type-id-38' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='drr_toguid' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='drr_fromguid' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='drr_toname' type-id='type-id-143' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zinject_record_t' type-id='type-id-311' id='type-id-308'/>
    <class-decl name='zinject_record' size-in-bits='2816' is-struct='yes' visibility='default' id='type-id-311'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zi_objset' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='zi_object' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='zi_start' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='zi_end' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='zi_guid' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='zi_level' type-id='type-id-38' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='zi_error' type-id='type-id-38' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='zi_type' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='zi_freq' type-id='type-id-38' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='zi_failfast' type-id='type-id-38' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='zi_func' type-id='type-id-143' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='zi_iotype' type-id='type-id-38' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2592'>
        <var-decl name='zi_duration' type-id='type-id-45' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='zi_timer' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='zi_nlanes' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='zi_cmd' type-id='type-id-38' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2784'>
        <var-decl name='zi_dvas' type-id='type-id-38' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zfs_stat_t' type-id='type-id-312' id='type-id-309'/>
    <class-decl name='zfs_stat' size-in-bits='320' is-struct='yes' visibility='default' id='type-id-312'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zs_gen' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='zs_mode' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='zs_links' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='zs_ctime' type-id='type-id-88' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-305' size-in-bits='64' id='type-id-313'/>
    <function-decl name='zfs_version_kernel' mangled-name='zfs_version_kernel' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_version_kernel'>
      <parameter type-id='type-id-1' name='version'/>
      <parameter type-id='type-id-2' name='len'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='libzfs_error_init' mangled-name='libzfs_error_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_error_init'>
      <parameter type-id='type-id-2' name='error'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='zfs_ioctl' mangled-name='zfs_ioctl' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_ioctl'>
      <parameter type-id='type-id-162' name='hdl'/>
      <parameter type-id='type-id-2' name='request'/>
      <parameter type-id='type-id-313' name='zc'/>
      <return type-id='type-id-2'/>
    </function-decl>
  </abi-instr>
</abi-corpus>
