<abi-corpus path='libzfs.so' architecture='elf-amd-x86_64' soname='libzfs.so.4'>
  <elf-needed>
    <dependency name='libzfs_core.so.3'/>
    <dependency name='libnvpair.so.3'/>
    <dependency name='libuutil.so.3'/>
    <dependency name='libm.so.6'/>
    <dependency name='libcrypto.so.1.1'/>
    <dependency name='libz.so.1'/>
    <dependency name='libdl.so.2'/>
    <dependency name='libpthread.so.0'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='bookmark_namecheck' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='cityhash4' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='color_end' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='color_start' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='dataset_namecheck' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='dataset_nestcheck' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='entity_namecheck' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='zprop_iter' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_iter_common' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_name_to_prop' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_print_one_property' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_random_value' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_register_hidden' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_register_impl' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_register_index' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_register_number' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_register_string' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_string_to_index' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_valid_for_type' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_values' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_width' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zvol_volsize_to_reservation' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <elf-variable-symbols>
    <elf-symbol name='fletcher_4_abd_ops' size='24' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fletcher_4_avx2_ops' size='64' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fletcher_4_avx512bw_ops' size='64' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fletcher_4_avx512f_ops' size='64' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fletcher_4_sse2_ops' size='64' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fletcher_4_ssse3_ops' size='64' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fletcher_4_superscalar4_ops' size='64' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fletcher_4_superscalar_ops' size='64' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='libzfs_config_ops' size='16' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spa_feature_table' size='1904' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfeature_checks_disable' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_deleg_perm_tab' size='512' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_history_event_names' size='328' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_max_dataset_nesting' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_userquota_prop_prefixes' size='96' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
<<<<<<< HEAD
  <abi-instr version='1.0' address-size='64' path='libzfs_changelist.c' comp-dir-path='/home/nabijaczleweli/store/code/zfs/lib/libzfs' language='LANG_C99'>
<<<<<<< HEAD
    <class-decl name='uu_avl_walk' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-1'/>
    <pointer-type-def type-id='type-id-1' size-in-bits='64' id='type-id-2'/>
    <class-decl name='uu_avl' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-3'/>
    <pointer-type-def type-id='type-id-3' size-in-bits='64' id='type-id-4'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-5'/>
    <function-decl name='uu_avl_walk_start' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <type-decl name='void' id='type-id-6'/>
    <pointer-type-def type-id='type-id-6' size-in-bits='64' id='type-id-7'/>
    <function-decl name='uu_avl_walk_next' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <type-decl name='int' size-in-bits='32' id='type-id-8'/>
    <function-decl name='getzoneid' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
=======
    <type-decl name='int' size-in-bits='32' id='type-id-1'/>
    <class-decl name='prop_changelist' size-in-bits='448' is-struct='yes' visibility='default' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_changelist.c' line='75' column='1' id='type-id-2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cl_prop' type-id='type-id-3' visibility='default' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_changelist.c' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='cl_realprop' type-id='type-id-3' visibility='default' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_changelist.c' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='cl_shareprop' type-id='type-id-3' visibility='default' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_changelist.c' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cl_pool' type-id='type-id-4' visibility='default' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_changelist.c' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='cl_tree' type-id='type-id-5' visibility='default' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_changelist.c' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='cl_waslegacy' type-id='type-id-6' visibility='default' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_changelist.c' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='cl_allchildren' type-id='type-id-6' visibility='default' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_changelist.c' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='cl_alldependents' type-id='type-id-6' visibility='default' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_changelist.c' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='cl_mflags' type-id='type-id-1' visibility='default' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_changelist.c' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='cl_gflags' type-id='type-id-1' visibility='default' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_changelist.c' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
<<<<<<< HEAD
        <var-decl name='cl_haszonedchild' type-id='type-id-6' visibility='default' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_changelist.c' line='86' column='1'/>
=======
        <var-decl name='cl_haszonedchild' type-id='type-id-5' visibility='default' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_changelist.c' line='86' column='1'/>
=======
  <abi-instr version='1.0' address-size='64' path='libzfs_changelist.c' comp-dir-path='/home/behlendo/src/git/zfs/lib/libzfs' language='LANG_C99'>
    <class-decl name='prop_changelist' size-in-bits='448' is-struct='yes' visibility='default' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_changelist.c' line='75' column='1' id='type-id-1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cl_prop' type-id='type-id-2' visibility='default' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_changelist.c' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='cl_realprop' type-id='type-id-2' visibility='default' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_changelist.c' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='cl_shareprop' type-id='type-id-2' visibility='default' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_changelist.c' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cl_pool' type-id='type-id-3' visibility='default' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_changelist.c' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='cl_tree' type-id='type-id-4' visibility='default' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_changelist.c' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='cl_waslegacy' type-id='type-id-5' visibility='default' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_changelist.c' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='cl_allchildren' type-id='type-id-5' visibility='default' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_changelist.c' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='cl_alldependents' type-id='type-id-5' visibility='default' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_changelist.c' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='cl_mflags' type-id='type-id-6' visibility='default' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_changelist.c' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='cl_gflags' type-id='type-id-6' visibility='default' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_changelist.c' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='cl_haszonedchild' type-id='type-id-5' visibility='default' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_changelist.c' line='86' column='1'/>
>>>>>>> 28d08db2d... WIP Direct IO
>>>>>>> 9592cab4e... WIP Direct IO
      </data-member>
    </class-decl>
    <type-decl name='unnamed-enum-underlying-type' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-7'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='../../include/sys/fs/zfs.h' line='91' column='1' id='type-id-8'>
      <underlying-type type-id='type-id-7'/>
      <enumerator name='ZPROP_CONT' value='-2'/>
      <enumerator name='ZPROP_INVAL' value='-1'/>
      <enumerator name='ZFS_PROP_TYPE' value='0'/>
      <enumerator name='ZFS_PROP_CREATION' value='1'/>
      <enumerator name='ZFS_PROP_USED' value='2'/>
      <enumerator name='ZFS_PROP_AVAILABLE' value='3'/>
      <enumerator name='ZFS_PROP_REFERENCED' value='4'/>
      <enumerator name='ZFS_PROP_COMPRESSRATIO' value='5'/>
      <enumerator name='ZFS_PROP_MOUNTED' value='6'/>
      <enumerator name='ZFS_PROP_ORIGIN' value='7'/>
      <enumerator name='ZFS_PROP_QUOTA' value='8'/>
      <enumerator name='ZFS_PROP_RESERVATION' value='9'/>
      <enumerator name='ZFS_PROP_VOLSIZE' value='10'/>
      <enumerator name='ZFS_PROP_VOLBLOCKSIZE' value='11'/>
      <enumerator name='ZFS_PROP_RECORDSIZE' value='12'/>
      <enumerator name='ZFS_PROP_MOUNTPOINT' value='13'/>
      <enumerator name='ZFS_PROP_SHARENFS' value='14'/>
      <enumerator name='ZFS_PROP_CHECKSUM' value='15'/>
      <enumerator name='ZFS_PROP_COMPRESSION' value='16'/>
      <enumerator name='ZFS_PROP_ATIME' value='17'/>
      <enumerator name='ZFS_PROP_DEVICES' value='18'/>
      <enumerator name='ZFS_PROP_EXEC' value='19'/>
      <enumerator name='ZFS_PROP_SETUID' value='20'/>
      <enumerator name='ZFS_PROP_READONLY' value='21'/>
      <enumerator name='ZFS_PROP_ZONED' value='22'/>
      <enumerator name='ZFS_PROP_SNAPDIR' value='23'/>
      <enumerator name='ZFS_PROP_ACLMODE' value='24'/>
      <enumerator name='ZFS_PROP_ACLINHERIT' value='25'/>
      <enumerator name='ZFS_PROP_CREATETXG' value='26'/>
      <enumerator name='ZFS_PROP_NAME' value='27'/>
      <enumerator name='ZFS_PROP_CANMOUNT' value='28'/>
      <enumerator name='ZFS_PROP_ISCSIOPTIONS' value='29'/>
      <enumerator name='ZFS_PROP_XATTR' value='30'/>
      <enumerator name='ZFS_PROP_NUMCLONES' value='31'/>
      <enumerator name='ZFS_PROP_COPIES' value='32'/>
      <enumerator name='ZFS_PROP_VERSION' value='33'/>
      <enumerator name='ZFS_PROP_UTF8ONLY' value='34'/>
      <enumerator name='ZFS_PROP_NORMALIZE' value='35'/>
      <enumerator name='ZFS_PROP_CASE' value='36'/>
      <enumerator name='ZFS_PROP_VSCAN' value='37'/>
      <enumerator name='ZFS_PROP_NBMAND' value='38'/>
      <enumerator name='ZFS_PROP_SHARESMB' value='39'/>
      <enumerator name='ZFS_PROP_REFQUOTA' value='40'/>
      <enumerator name='ZFS_PROP_REFRESERVATION' value='41'/>
      <enumerator name='ZFS_PROP_GUID' value='42'/>
      <enumerator name='ZFS_PROP_PRIMARYCACHE' value='43'/>
      <enumerator name='ZFS_PROP_SECONDARYCACHE' value='44'/>
      <enumerator name='ZFS_PROP_USEDSNAP' value='45'/>
      <enumerator name='ZFS_PROP_USEDDS' value='46'/>
      <enumerator name='ZFS_PROP_USEDCHILD' value='47'/>
      <enumerator name='ZFS_PROP_USEDREFRESERV' value='48'/>
      <enumerator name='ZFS_PROP_USERACCOUNTING' value='49'/>
      <enumerator name='ZFS_PROP_STMF_SHAREINFO' value='50'/>
      <enumerator name='ZFS_PROP_DEFER_DESTROY' value='51'/>
      <enumerator name='ZFS_PROP_USERREFS' value='52'/>
      <enumerator name='ZFS_PROP_LOGBIAS' value='53'/>
      <enumerator name='ZFS_PROP_UNIQUE' value='54'/>
      <enumerator name='ZFS_PROP_OBJSETID' value='55'/>
      <enumerator name='ZFS_PROP_DEDUP' value='56'/>
      <enumerator name='ZFS_PROP_MLSLABEL' value='57'/>
      <enumerator name='ZFS_PROP_SYNC' value='58'/>
      <enumerator name='ZFS_PROP_DNODESIZE' value='59'/>
      <enumerator name='ZFS_PROP_REFRATIO' value='60'/>
      <enumerator name='ZFS_PROP_WRITTEN' value='61'/>
      <enumerator name='ZFS_PROP_CLONES' value='62'/>
      <enumerator name='ZFS_PROP_LOGICALUSED' value='63'/>
      <enumerator name='ZFS_PROP_LOGICALREFERENCED' value='64'/>
      <enumerator name='ZFS_PROP_INCONSISTENT' value='65'/>
      <enumerator name='ZFS_PROP_VOLMODE' value='66'/>
      <enumerator name='ZFS_PROP_FILESYSTEM_LIMIT' value='67'/>
      <enumerator name='ZFS_PROP_SNAPSHOT_LIMIT' value='68'/>
      <enumerator name='ZFS_PROP_FILESYSTEM_COUNT' value='69'/>
      <enumerator name='ZFS_PROP_SNAPSHOT_COUNT' value='70'/>
      <enumerator name='ZFS_PROP_SNAPDEV' value='71'/>
      <enumerator name='ZFS_PROP_ACLTYPE' value='72'/>
      <enumerator name='ZFS_PROP_SELINUX_CONTEXT' value='73'/>
      <enumerator name='ZFS_PROP_SELINUX_FSCONTEXT' value='74'/>
      <enumerator name='ZFS_PROP_SELINUX_DEFCONTEXT' value='75'/>
      <enumerator name='ZFS_PROP_SELINUX_ROOTCONTEXT' value='76'/>
      <enumerator name='ZFS_PROP_RELATIME' value='77'/>
      <enumerator name='ZFS_PROP_REDUNDANT_METADATA' value='78'/>
      <enumerator name='ZFS_PROP_OVERLAY' value='79'/>
      <enumerator name='ZFS_PROP_PREV_SNAP' value='80'/>
      <enumerator name='ZFS_PROP_RECEIVE_RESUME_TOKEN' value='81'/>
      <enumerator name='ZFS_PROP_ENCRYPTION' value='82'/>
      <enumerator name='ZFS_PROP_KEYLOCATION' value='83'/>
      <enumerator name='ZFS_PROP_KEYFORMAT' value='84'/>
      <enumerator name='ZFS_PROP_PBKDF2_SALT' value='85'/>
      <enumerator name='ZFS_PROP_PBKDF2_ITERS' value='86'/>
      <enumerator name='ZFS_PROP_ENCRYPTION_ROOT' value='87'/>
      <enumerator name='ZFS_PROP_KEY_GUID' value='88'/>
      <enumerator name='ZFS_PROP_KEYSTATUS' value='89'/>
      <enumerator name='ZFS_PROP_REMAPTXG' value='90'/>
      <enumerator name='ZFS_PROP_SPECIAL_SMALL_BLOCKS' value='91'/>
      <enumerator name='ZFS_PROP_IVSET_GUID' value='92'/>
      <enumerator name='ZFS_PROP_REDACTED' value='93'/>
      <enumerator name='ZFS_PROP_REDACT_SNAPS' value='94'/>
      <enumerator name='ZFS_PROP_DIRECT' value='95'/>
      <enumerator name='ZFS_NUM_PROPS' value='96'/>
    </enum-decl>
<<<<<<< HEAD
    <typedef-decl name='zfs_prop_t' type-id='type-id-8' filepath='../../include/sys/fs/zfs.h' line='190' column='1' id='type-id-3'/>
=======
    <typedef-decl name='zfs_prop_t' type-id='type-id-8' filepath='../../include/sys/fs/zfs.h' line='191' column='1' id='type-id-2'/>
>>>>>>> 9592cab4e... WIP Direct IO
    <class-decl name='uu_avl_pool' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-9'/>
    <typedef-decl name='uu_avl_pool_t' type-id='type-id-9' filepath='../../include/libuutil.h' line='259' column='1' id='type-id-10'/>
    <pointer-type-def type-id='type-id-10' size-in-bits='64' id='type-id-4'/>
    <class-decl name='uu_avl' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-11'/>
    <typedef-decl name='uu_avl_t' type-id='type-id-11' filepath='../../include/libuutil.h' line='260' column='1' id='type-id-12'/>
    <pointer-type-def type-id='type-id-12' size-in-bits='64' id='type-id-5'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='../../lib/libspl/include/sys/stdtypes.h' line='26' column='1' id='type-id-13'>
      <underlying-type type-id='type-id-7'/>
      <enumerator name='B_FALSE' value='0'/>
      <enumerator name='B_TRUE' value='1'/>
    </enum-decl>
    <typedef-decl name='boolean_t' type-id='type-id-13' filepath='../../lib/libspl/include/sys/stdtypes.h' line='29' column='1' id='type-id-6'/>
    <typedef-decl name='prop_changelist_t' type-id='type-id-2' filepath='../../include/libzfs_impl.h' line='173' column='1' id='type-id-14'/>
    <pointer-type-def type-id='type-id-14' size-in-bits='64' id='type-id-15'/>
    <function-decl name='changelist_prefix' mangled-name='changelist_prefix' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_changelist.c' line='96' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='changelist_prefix'>
      <parameter type-id='type-id-15' name='clp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_changelist.c' line='96' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <class-decl name='uu_avl_walk' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-16'/>
    <pointer-type-def type-id='type-id-16' size-in-bits='64' id='type-id-17'/>
    <pointer-type-def type-id='type-id-11' size-in-bits='64' id='type-id-18'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-19'/>
    <function-decl name='uu_avl_walk_start' filepath='../../include/libuutil.h' line='338' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <type-decl name='void' id='type-id-20'/>
    <pointer-type-def type-id='type-id-20' size-in-bits='64' id='type-id-21'/>
    <function-decl name='uu_avl_walk_next' filepath='../../include/libuutil.h' line='339' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-17'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='getzoneid' filepath='../../include/sys/zfs_context.h' line='732' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-1'/>
>>>>>>> 41ceb90a6... WIP Direct IO
    </function-decl>
    <class-decl name='zfs_handle' size-in-bits='4928' is-struct='yes' visibility='default' id='type-id-9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zfs_hdl' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='zpool_hdl' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='zfs_name' type-id='type-id-12' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='zfs_type' type-id='type-id-13' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2208'>
        <var-decl name='zfs_head_type' type-id='type-id-13' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='zfs_dmustats' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4544'>
        <var-decl name='zfs_props' type-id='type-id-15' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4608'>
        <var-decl name='zfs_user_props' type-id='type-id-15' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4672'>
        <var-decl name='zfs_recvd_props' type-id='type-id-15' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4736'>
        <var-decl name='zfs_mntcheck' type-id='type-id-16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4800'>
        <var-decl name='zfs_mntopts' type-id='type-id-17' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4864'>
        <var-decl name='zfs_props_table' type-id='type-id-18' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='libzfs_handle' size-in-bits='18240' is-struct='yes' visibility='default' id='type-id-19'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='libzfs_error' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='libzfs_fd' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='libzfs_pool_handles' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='libzfs_ns_avlpool' type-id='type-id-20' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='libzfs_ns_avl' type-id='type-id-21' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='libzfs_ns_gen' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='libzfs_desc_active' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='libzfs_action' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8544'>
        <var-decl name='libzfs_desc' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16736'>
        <var-decl name='libzfs_printerr' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16768'>
        <var-decl name='libzfs_mnttab_enable' type-id='type-id-16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16832'>
        <var-decl name='libzfs_mnttab_cache_lock' type-id='type-id-24' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17152'>
        <var-decl name='libzfs_mnttab_cache' type-id='type-id-25' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17472'>
        <var-decl name='libzfs_pool_iter' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17504'>
        <var-decl name='libzfs_prop_debug' type-id='type-id-16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17536'>
        <var-decl name='libzfs_urire' type-id='type-id-26' visibility='default'/>
      </data-member>
<<<<<<< HEAD
      <data-member access='public' layout-offset-in-bits='18048'>
        <var-decl name='libzfs_max_nvlist' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18112'>
        <var-decl name='libfetch' type-id='type-id-7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18176'>
        <var-decl name='libfetch_load_error' type-id='type-id-17' visibility='default'/>
      </data-member>
    </class-decl>
<<<<<<< HEAD
    <class-decl name='zpool_handle' size-in-bits='2560' is-struct='yes' visibility='default' id='type-id-27'>
=======
<<<<<<< HEAD
    <class-decl name='zpool_handle' size-in-bits='2560' is-struct='yes' visibility='default' filepath='../../include/libzfs_impl.h' line='97' column='1' id='type-id-37'>
=======
    <class-decl name='zpool_handle' size-in-bits='2560' is-struct='yes' visibility='default' filepath='../../include/libzfs_impl.h' line='95' column='1' id='type-id-31'>
=======
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='type-id-36' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='type-id-37' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='type-id-38' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='type-id-39' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='type-id-40' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='type-id-41' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='type-id-42' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='type-id-34' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='type-id-43' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='type-id-44' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='type-id-6' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='type-id-45' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='98' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='char' size-in-bits='8' id='type-id-46'/>
    <pointer-type-def type-id='type-id-46' size-in-bits='64' id='type-id-23'/>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-47'/>
    <pointer-type-def type-id='type-id-47' size-in-bits='64' id='type-id-33'/>
    <pointer-type-def type-id='type-id-32' size-in-bits='64' id='type-id-34'/>
    <type-decl name='long int' size-in-bits='64' id='type-id-48'/>
    <typedef-decl name='__off_t' type-id='type-id-48' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='152' column='1' id='type-id-35'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-36'/>
    <type-decl name='signed char' size-in-bits='8' id='type-id-37'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-49'/>

    <array-type-def dimensions='1' type-id='type-id-46' size-in-bits='8' id='type-id-38'>
      <subrange length='1' type-id='type-id-49' id='type-id-50'/>

    </array-type-def>
    <typedef-decl name='_IO_lock_t' type-id='type-id-51' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='43' column='1' id='type-id-52'/>
    <pointer-type-def type-id='type-id-52' size-in-bits='64' id='type-id-39'/>
    <typedef-decl name='__off64_t' type-id='type-id-48' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='153' column='1' id='type-id-40'/>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-53'/>
    <pointer-type-def type-id='type-id-53' size-in-bits='64' id='type-id-41'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-54'/>
    <pointer-type-def type-id='type-id-54' size-in-bits='64' id='type-id-42'/>
    <type-decl name='void' id='type-id-51'/>
    <pointer-type-def type-id='type-id-51' size-in-bits='64' id='type-id-43'/>
    <typedef-decl name='size_t' type-id='type-id-49' filepath='/usr/lib/gcc/x86_64-linux-gnu/9/include/stddef.h' line='209' column='1' id='type-id-44'/>

    <array-type-def dimensions='1' type-id='type-id-46' size-in-bits='160' id='type-id-45'>
      <subrange length='20' type-id='type-id-49' id='type-id-55'/>

    </array-type-def>
    <typedef-decl name='FILE' type-id='type-id-32' filepath='/usr/include/x86_64-linux-gnu/bits/types/FILE.h' line='7' column='1' id='type-id-56'/>
    <pointer-type-def type-id='type-id-56' size-in-bits='64' id='type-id-26'/>
    <class-decl name='zpool_handle' size-in-bits='2560' is-struct='yes' visibility='default' filepath='../../include/libzfs_impl.h' line='98' column='1' id='type-id-57'>
>>>>>>> 28d08db2d... WIP Direct IO
>>>>>>> 9592cab4e... WIP Direct IO
>>>>>>> 41ceb90a6... WIP Direct IO
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zpool_hdl' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='zpool_next' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='zpool_name' type-id='type-id-12' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='zpool_state' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
<<<<<<< HEAD
        <var-decl name='zpool_config_size' type-id='type-id-28' visibility='default'/>
=======
<<<<<<< HEAD
        <var-decl name='zpool_config_size' type-id='type-id-38' visibility='default' filepath='../../include/libzfs_impl.h' line='102' column='1'/>
=======
<<<<<<< HEAD
        <var-decl name='zpool_config_size' type-id='type-id-32' visibility='default' filepath='../../include/libzfs_impl.h' line='100' column='1'/>
=======
        <var-decl name='zpool_config_size' type-id='type-id-44' visibility='default' filepath='../../include/libzfs_impl.h' line='103' column='1'/>
>>>>>>> 28d08db2d... WIP Direct IO
>>>>>>> 9592cab4e... WIP Direct IO
>>>>>>> 41ceb90a6... WIP Direct IO
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='zpool_config' type-id='type-id-15' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='zpool_old_config' type-id='type-id-15' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='zpool_props' type-id='type-id-15' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
<<<<<<< HEAD
        <var-decl name='zpool_start_block' type-id='type-id-29' visibility='default'/>
=======
<<<<<<< HEAD
        <var-decl name='zpool_start_block' type-id='type-id-39' visibility='default' filepath='../../include/libzfs_impl.h' line='106' column='1'/>
=======
<<<<<<< HEAD
        <var-decl name='zpool_start_block' type-id='type-id-33' visibility='default' filepath='../../include/libzfs_impl.h' line='104' column='1'/>
>>>>>>> 9592cab4e... WIP Direct IO
>>>>>>> 41ceb90a6... WIP Direct IO
      </data-member>
    </class-decl>
    <typedef-decl name='libzfs_handle_t' type-id='type-id-19' id='type-id-30'/>
    <pointer-type-def type-id='type-id-30' size-in-bits='64' id='type-id-10'/>
    <typedef-decl name='zpool_handle_t' type-id='type-id-27' id='type-id-31'/>
    <pointer-type-def type-id='type-id-31' size-in-bits='64' id='type-id-11'/>
    <type-decl name='char' size-in-bits='8' id='type-id-32'/>
    <type-decl name='__ARRAY_SIZE_TYPE__' size-in-bits='64' id='type-id-33'/>

    <array-type-def dimensions='1' type-id='type-id-32' size-in-bits='2048' id='type-id-12'>
      <subrange length='256' type-id='type-id-33' id='type-id-34'/>

    </array-type-def>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-35'/>
    <typedef-decl name='size_t' type-id='type-id-35' id='type-id-28'/>
    <class-decl name='nvlist' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-36'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nvl_version' type-id='type-id-37' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
<<<<<<< HEAD
        <var-decl name='nvl_nvflag' type-id='type-id-38' visibility='default'/>
=======
<<<<<<< HEAD
        <var-decl name='nvl_nvflag' type-id='type-id-48' visibility='default' filepath='../../include/sys/nvpair.h' line='87' column='1'/>
=======
        <var-decl name='nvl_nvflag' type-id='type-id-41' visibility='default' filepath='../../include/sys/nvpair.h' line='87' column='1'/>
=======
        <var-decl name='zpool_start_block' type-id='type-id-58' visibility='default' filepath='../../include/libzfs_impl.h' line='107' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='libzfs_handle_t' type-id='type-id-25' filepath='../../include/libzfs.h' line='197' column='1' id='type-id-59'/>
    <pointer-type-def type-id='type-id-59' size-in-bits='64' id='type-id-17'/>
    <typedef-decl name='zpool_handle_t' type-id='type-id-57' filepath='../../include/libzfs.h' line='196' column='1' id='type-id-60'/>
    <pointer-type-def type-id='type-id-60' size-in-bits='64' id='type-id-18'/>

    <array-type-def dimensions='1' type-id='type-id-46' size-in-bits='2048' id='type-id-19'>
      <subrange length='256' type-id='type-id-49' id='type-id-61'/>

    </array-type-def>
    <class-decl name='nvlist' size-in-bits='192' is-struct='yes' visibility='default' filepath='../../include/sys/nvpair.h' line='85' column='1' id='type-id-62'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nvl_version' type-id='type-id-63' visibility='default' filepath='../../include/sys/nvpair.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='nvl_nvflag' type-id='type-id-64' visibility='default' filepath='../../include/sys/nvpair.h' line='87' column='1'/>
>>>>>>> 28d08db2d... WIP Direct IO
>>>>>>> 9592cab4e... WIP Direct IO
>>>>>>> 41ceb90a6... WIP Direct IO
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nvl_priv' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
<<<<<<< HEAD
        <var-decl name='nvl_flag' type-id='type-id-38' visibility='default'/>
=======
<<<<<<< HEAD
        <var-decl name='nvl_flag' type-id='type-id-48' visibility='default' filepath='../../include/sys/nvpair.h' line='89' column='1'/>
=======
<<<<<<< HEAD
        <var-decl name='nvl_flag' type-id='type-id-41' visibility='default' filepath='../../include/sys/nvpair.h' line='89' column='1'/>
>>>>>>> 9592cab4e... WIP Direct IO
>>>>>>> 41ceb90a6... WIP Direct IO
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='nvl_pad' type-id='type-id-37' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__int32_t' type-id='type-id-8' id='type-id-39'/>
    <typedef-decl name='int32_t' type-id='type-id-39' id='type-id-37'/>
    <typedef-decl name='__uint32_t' type-id='type-id-5' id='type-id-40'/>
    <typedef-decl name='uint32_t' type-id='type-id-40' id='type-id-38'/>
    <typedef-decl name='__uint64_t' type-id='type-id-35' id='type-id-41'/>
    <typedef-decl name='uint64_t' type-id='type-id-41' id='type-id-22'/>
    <typedef-decl name='nvlist_t' type-id='type-id-36' id='type-id-42'/>
    <pointer-type-def type-id='type-id-42' size-in-bits='64' id='type-id-15'/>
    <type-decl name='long long int' size-in-bits='64' id='type-id-43'/>
    <typedef-decl name='longlong_t' type-id='type-id-43' id='type-id-44'/>
    <typedef-decl name='diskaddr_t' type-id='type-id-44' id='type-id-29'/>
    <class-decl name='uu_avl_pool' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-45'/>
    <typedef-decl name='uu_avl_pool_t' type-id='type-id-45' id='type-id-46'/>
    <pointer-type-def type-id='type-id-46' size-in-bits='64' id='type-id-20'/>
    <typedef-decl name='uu_avl_t' type-id='type-id-3' id='type-id-47'/>
    <pointer-type-def type-id='type-id-47' size-in-bits='64' id='type-id-21'/>

    <array-type-def dimensions='1' type-id='type-id-32' size-in-bits='8192' id='type-id-23'>
      <subrange length='1024' type-id='type-id-33' id='type-id-48'/>

    </array-type-def>
    <type-decl name='unnamed-enum-underlying-type' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-49'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-50'>
      <underlying-type type-id='type-id-49'/>
      <enumerator name='B_FALSE' value='0'/>
      <enumerator name='B_TRUE' value='1'/>
    </enum-decl>
    <typedef-decl name='boolean_t' type-id='type-id-50' id='type-id-16'/>
    <union-decl name='__anonymous_union__' size-in-bits='320' is-anonymous='yes' visibility='default' id='type-id-51'>
      <data-member access='private'>
        <var-decl name='__data' type-id='type-id-52' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__size' type-id='type-id-53' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__align' type-id='type-id-54' visibility='default'/>
      </data-member>
    </union-decl>
<<<<<<< HEAD
    <class-decl name='__pthread_mutex_s' size-in-bits='320' is-struct='yes' visibility='default' id='type-id-52'>
=======
<<<<<<< HEAD
    <class-decl name='__pthread_mutex_s' size-in-bits='320' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='118' column='1' id='type-id-57'>
>>>>>>> 41ceb90a6... WIP Direct IO
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__lock' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__count' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__owner' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='__nusers' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='__kind' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
<<<<<<< HEAD
        <var-decl name='__spins' type-id='type-id-55' visibility='default'/>
=======
        <var-decl name='__spins' type-id='type-id-60' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='154' column='1'/>
=======
    <class-decl name='__pthread_mutex_s' size-in-bits='320' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='118' column='1' id='type-id-51'>
=======
        <var-decl name='nvl_flag' type-id='type-id-64' visibility='default' filepath='../../include/sys/nvpair.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='nvl_pad' type-id='type-id-63' visibility='default' filepath='../../include/sys/nvpair.h' line='90' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__int32_t' type-id='type-id-6' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='41' column='1' id='type-id-65'/>
    <typedef-decl name='int32_t' type-id='type-id-65' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-intn.h' line='26' column='1' id='type-id-63'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-66'/>
    <typedef-decl name='__uint32_t' type-id='type-id-66' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='42' column='1' id='type-id-67'/>
    <typedef-decl name='uint32_t' type-id='type-id-67' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='26' column='1' id='type-id-64'/>
    <typedef-decl name='__uint64_t' type-id='type-id-49' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='45' column='1' id='type-id-68'/>
    <typedef-decl name='uint64_t' type-id='type-id-68' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='27' column='1' id='type-id-27'/>
    <typedef-decl name='nvlist_t' type-id='type-id-62' filepath='../../include/sys/nvpair.h' line='91' column='1' id='type-id-69'/>
    <pointer-type-def type-id='type-id-69' size-in-bits='64' id='type-id-22'/>
    <type-decl name='long long int' size-in-bits='64' id='type-id-70'/>
    <typedef-decl name='longlong_t' type-id='type-id-70' filepath='../../lib/libspl/include/sys/stdtypes.h' line='36' column='1' id='type-id-71'/>
    <typedef-decl name='diskaddr_t' type-id='type-id-71' filepath='../../lib/libspl/include/sys/stdtypes.h' line='41' column='1' id='type-id-58'/>

    <array-type-def dimensions='1' type-id='type-id-46' size-in-bits='8192' id='type-id-28'>
      <subrange length='1024' type-id='type-id-49' id='type-id-72'/>

    </array-type-def>
    <union-decl name='__anonymous_union__' size-in-bits='320' is-anonymous='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='67' column='1' id='type-id-73'>
      <data-member access='private'>
        <var-decl name='__data' type-id='type-id-74' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='69' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__size' type-id='type-id-75' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='70' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__align' type-id='type-id-48' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='71' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='__pthread_mutex_s' size-in-bits='320' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='22' column='1' id='type-id-74'>
>>>>>>> 28d08db2d... WIP Direct IO
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__lock' type-id='type-id-6' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
<<<<<<< HEAD
        <var-decl name='__count' type-id='type-id-43' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='121' column='1'/>
=======
        <var-decl name='__count' type-id='type-id-66' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='25' column='1'/>
>>>>>>> 28d08db2d... WIP Direct IO
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__owner' type-id='type-id-6' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
<<<<<<< HEAD
        <var-decl name='__nusers' type-id='type-id-43' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='124' column='1'/>
=======
        <var-decl name='__nusers' type-id='type-id-66' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='28' column='1'/>
>>>>>>> 28d08db2d... WIP Direct IO
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='__kind' type-id='type-id-6' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
<<<<<<< HEAD
        <var-decl name='__spins' type-id='type-id-54' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='154' column='1'/>
>>>>>>> 9592cab4e... WIP Direct IO
>>>>>>> 41ceb90a6... WIP Direct IO
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='__elision' type-id='type-id-55' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='__list' type-id='type-id-56' visibility='default'/>
      </data-member>
    </class-decl>
    <type-decl name='short int' size-in-bits='16' id='type-id-55'/>
    <class-decl name='__pthread_internal_list' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-57'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__prev' type-id='type-id-58' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__next' type-id='type-id-58' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-57' size-in-bits='64' id='type-id-58'/>
    <typedef-decl name='__pthread_list_t' type-id='type-id-57' id='type-id-56'/>

    <array-type-def dimensions='1' type-id='type-id-32' size-in-bits='320' id='type-id-53'>
      <subrange length='40' type-id='type-id-33' id='type-id-59'/>

    </array-type-def>
    <type-decl name='long int' size-in-bits='64' id='type-id-54'/>
    <typedef-decl name='pthread_mutex_t' type-id='type-id-51' id='type-id-24'/>
    <class-decl name='avl_tree' size-in-bits='320' is-struct='yes' visibility='default' id='type-id-60'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='avl_root' type-id='type-id-61' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='avl_compar' type-id='type-id-62' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='avl_offset' type-id='type-id-28' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='avl_numnodes' type-id='type-id-63' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='avl_size' type-id='type-id-28' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='avl_node' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-64'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='avl_child' type-id='type-id-65' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='avl_pcb' type-id='type-id-66' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-64' size-in-bits='64' id='type-id-61'/>

    <array-type-def dimensions='1' type-id='type-id-61' size-in-bits='128' id='type-id-65'>
      <subrange length='2' type-id='type-id-33' id='type-id-67'/>

    </array-type-def>
    <typedef-decl name='uintptr_t' type-id='type-id-35' id='type-id-66'/>
    <pointer-type-def type-id='type-id-68' size-in-bits='64' id='type-id-62'/>
    <typedef-decl name='ulong_t' type-id='type-id-35' id='type-id-63'/>
    <typedef-decl name='avl_tree_t' type-id='type-id-60' id='type-id-25'/>
    <class-decl name='re_pattern_buffer' size-in-bits='512' is-struct='yes' visibility='default' id='type-id-69'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='buffer' type-id='type-id-70' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='allocated' type-id='type-id-71' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='used' type-id='type-id-71' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
<<<<<<< HEAD
        <var-decl name='syntax' type-id='type-id-72' visibility='default'/>
=======
<<<<<<< HEAD
        <var-decl name='syntax' type-id='type-id-77' visibility='default' filepath='/usr/include/regex.h' line='426' column='1'/>
=======
        <var-decl name='syntax' type-id='type-id-73' visibility='default' filepath='/usr/include/regex.h' line='426' column='1'/>
=======
        <var-decl name='__spins' type-id='type-id-76' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='__elision' type-id='type-id-76' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='__list' type-id='type-id-77' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='36' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='short int' size-in-bits='16' id='type-id-76'/>
    <class-decl name='__pthread_internal_list' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='49' column='1' id='type-id-78'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__prev' type-id='type-id-79' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__next' type-id='type-id-79' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='52' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-78' size-in-bits='64' id='type-id-79'/>
    <typedef-decl name='__pthread_list_t' type-id='type-id-78' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='53' column='1' id='type-id-77'/>

    <array-type-def dimensions='1' type-id='type-id-46' size-in-bits='320' id='type-id-75'>
      <subrange length='40' type-id='type-id-49' id='type-id-80'/>

    </array-type-def>
    <typedef-decl name='pthread_mutex_t' type-id='type-id-73' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='72' column='1' id='type-id-29'/>
    <class-decl name='avl_tree' size-in-bits='320' is-struct='yes' visibility='default' filepath='../../include/sys/avl_impl.h' line='146' column='1' id='type-id-81'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='avl_root' type-id='type-id-82' visibility='default' filepath='../../include/sys/avl_impl.h' line='147' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='avl_compar' type-id='type-id-83' visibility='default' filepath='../../include/sys/avl_impl.h' line='148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='avl_offset' type-id='type-id-44' visibility='default' filepath='../../include/sys/avl_impl.h' line='149' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='avl_numnodes' type-id='type-id-84' visibility='default' filepath='../../include/sys/avl_impl.h' line='150' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='avl_size' type-id='type-id-44' visibility='default' filepath='../../include/sys/avl_impl.h' line='151' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='avl_node' size-in-bits='192' is-struct='yes' visibility='default' filepath='../../include/sys/avl_impl.h' line='90' column='1' id='type-id-85'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='avl_child' type-id='type-id-86' visibility='default' filepath='../../include/sys/avl_impl.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='avl_pcb' type-id='type-id-87' visibility='default' filepath='../../include/sys/avl_impl.h' line='92' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-85' size-in-bits='64' id='type-id-82'/>

    <array-type-def dimensions='1' type-id='type-id-82' size-in-bits='128' id='type-id-86'>
      <subrange length='2' type-id='type-id-49' id='type-id-88'/>

    </array-type-def>
    <typedef-decl name='uintptr_t' type-id='type-id-49' filepath='/usr/include/stdint.h' line='90' column='1' id='type-id-87'/>
    <pointer-type-def type-id='type-id-89' size-in-bits='64' id='type-id-83'/>
    <typedef-decl name='ulong_t' type-id='type-id-49' filepath='../../lib/libspl/include/sys/stdtypes.h' line='34' column='1' id='type-id-84'/>
    <typedef-decl name='avl_tree_t' type-id='type-id-81' filepath='../../include/sys/avl.h' line='119' column='1' id='type-id-30'/>
    <class-decl name='re_pattern_buffer' size-in-bits='512' is-struct='yes' visibility='default' filepath='/usr/include/regex.h' line='413' column='1' id='type-id-90'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='buffer' type-id='type-id-91' visibility='default' filepath='/usr/include/regex.h' line='417' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='allocated' type-id='type-id-92' visibility='default' filepath='/usr/include/regex.h' line='420' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='used' type-id='type-id-92' visibility='default' filepath='/usr/include/regex.h' line='423' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='syntax' type-id='type-id-93' visibility='default' filepath='/usr/include/regex.h' line='426' column='1'/>
>>>>>>> 28d08db2d... WIP Direct IO
>>>>>>> 9592cab4e... WIP Direct IO
>>>>>>> 41ceb90a6... WIP Direct IO
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='fastmap' type-id='type-id-17' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
<<<<<<< HEAD
        <var-decl name='translate' type-id='type-id-73' visibility='default'/>
=======
<<<<<<< HEAD
        <var-decl name='translate' type-id='type-id-78' visibility='default' filepath='/usr/include/regex.h' line='437' column='1'/>
=======
<<<<<<< HEAD
        <var-decl name='translate' type-id='type-id-74' visibility='default' filepath='/usr/include/regex.h' line='437' column='1'/>
>>>>>>> 9592cab4e... WIP Direct IO
>>>>>>> 41ceb90a6... WIP Direct IO
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='re_nsub' type-id='type-id-28' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='can_be_null' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='29'>
        <var-decl name='regs_allocated' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='28'>
        <var-decl name='fastmap_accurate' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27'>
        <var-decl name='no_sub' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26'>
        <var-decl name='not_bol' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25'>
        <var-decl name='not_eol' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='newline_anchor' type-id='type-id-5' visibility='default'/>
      </data-member>
    </class-decl>
<<<<<<< HEAD
    <class-decl name='re_dfa_t' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-74'/>
    <pointer-type-def type-id='type-id-74' size-in-bits='64' id='type-id-70'/>
    <typedef-decl name='__re_long_size_t' type-id='type-id-35' id='type-id-71'/>
    <typedef-decl name='reg_syntax_t' type-id='type-id-35' id='type-id-72'/>
    <pointer-type-def type-id='type-id-32' size-in-bits='64' id='type-id-17'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-75'/>
    <pointer-type-def type-id='type-id-75' size-in-bits='64' id='type-id-73'/>
    <typedef-decl name='regex_t' type-id='type-id-69' id='type-id-26'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-76'>
      <underlying-type type-id='type-id-49'/>
=======
<<<<<<< HEAD
    <class-decl name='re_dfa_t' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-79'/>
    <pointer-type-def type-id='type-id-79' size-in-bits='64' id='type-id-75'/>
    <typedef-decl name='__re_long_size_t' type-id='type-id-45' filepath='/usr/include/regex.h' line='56' column='1' id='type-id-76'/>
    <typedef-decl name='reg_syntax_t' type-id='type-id-45' filepath='/usr/include/regex.h' line='72' column='1' id='type-id-77'/>
    <pointer-type-def type-id='type-id-42' size-in-bits='64' id='type-id-29'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-80'/>
    <pointer-type-def type-id='type-id-80' size-in-bits='64' id='type-id-78'/>
    <typedef-decl name='regex_t' type-id='type-id-74' filepath='/usr/include/regex.h' line='478' column='1' id='type-id-36'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='../../include/sys/fs/zfs.h' line='52' column='1' id='type-id-81'>
=======
    <class-decl name='re_dfa_t' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-75'/>
    <pointer-type-def type-id='type-id-75' size-in-bits='64' id='type-id-71'/>
    <typedef-decl name='__re_long_size_t' type-id='type-id-37' filepath='/usr/include/regex.h' line='56' column='1' id='type-id-72'/>
    <typedef-decl name='reg_syntax_t' type-id='type-id-37' filepath='/usr/include/regex.h' line='72' column='1' id='type-id-73'/>
    <pointer-type-def type-id='type-id-36' size-in-bits='64' id='type-id-23'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-76'/>
    <pointer-type-def type-id='type-id-76' size-in-bits='64' id='type-id-74'/>
    <typedef-decl name='regex_t' type-id='type-id-70' filepath='/usr/include/regex.h' line='478' column='1' id='type-id-30'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='../../include/sys/fs/zfs.h' line='52' column='1' id='type-id-77'>
=======
        <var-decl name='translate' type-id='type-id-94' visibility='default' filepath='/usr/include/regex.h' line='437' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='re_nsub' type-id='type-id-44' visibility='default' filepath='/usr/include/regex.h' line='440' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='can_be_null' type-id='type-id-66' visibility='default' filepath='/usr/include/regex.h' line='446' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='29'>
        <var-decl name='regs_allocated' type-id='type-id-66' visibility='default' filepath='/usr/include/regex.h' line='457' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='28'>
        <var-decl name='fastmap_accurate' type-id='type-id-66' visibility='default' filepath='/usr/include/regex.h' line='461' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27'>
        <var-decl name='no_sub' type-id='type-id-66' visibility='default' filepath='/usr/include/regex.h' line='465' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26'>
        <var-decl name='not_bol' type-id='type-id-66' visibility='default' filepath='/usr/include/regex.h' line='469' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25'>
        <var-decl name='not_eol' type-id='type-id-66' visibility='default' filepath='/usr/include/regex.h' line='472' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='newline_anchor' type-id='type-id-66' visibility='default' filepath='/usr/include/regex.h' line='475' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='re_dfa_t' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-95'/>
    <pointer-type-def type-id='type-id-95' size-in-bits='64' id='type-id-91'/>
    <typedef-decl name='__re_long_size_t' type-id='type-id-49' filepath='/usr/include/regex.h' line='56' column='1' id='type-id-92'/>
    <typedef-decl name='reg_syntax_t' type-id='type-id-49' filepath='/usr/include/regex.h' line='72' column='1' id='type-id-93'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-96'/>
    <pointer-type-def type-id='type-id-96' size-in-bits='64' id='type-id-94'/>
    <typedef-decl name='regex_t' type-id='type-id-90' filepath='/usr/include/regex.h' line='478' column='1' id='type-id-31'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='../../include/sys/fs/zfs.h' line='52' column='1' id='type-id-97'>
>>>>>>> 28d08db2d... WIP Direct IO
>>>>>>> 9592cab4e... WIP Direct IO
      <underlying-type type-id='type-id-7'/>
>>>>>>> 41ceb90a6... WIP Direct IO
      <enumerator name='ZFS_TYPE_FILESYSTEM' value='1'/>
      <enumerator name='ZFS_TYPE_SNAPSHOT' value='2'/>
      <enumerator name='ZFS_TYPE_VOLUME' value='4'/>
      <enumerator name='ZFS_TYPE_POOL' value='8'/>
      <enumerator name='ZFS_TYPE_BOOKMARK' value='16'/>
    </enum-decl>
<<<<<<< HEAD
    <typedef-decl name='zfs_type_t' type-id='type-id-76' id='type-id-13'/>
    <class-decl name='dmu_objset_stats' size-in-bits='2304' is-struct='yes' visibility='default' id='type-id-77'>
=======
<<<<<<< HEAD
    <typedef-decl name='zfs_type_t' type-id='type-id-81' filepath='../../include/sys/fs/zfs.h' line='58' column='1' id='type-id-26'/>
    <class-decl name='dmu_objset_stats' size-in-bits='2304' is-struct='yes' visibility='default' filepath='../../include/sys/dmu.h' line='931' column='1' id='type-id-82'>
=======
<<<<<<< HEAD
    <typedef-decl name='zfs_type_t' type-id='type-id-77' filepath='../../include/sys/fs/zfs.h' line='58' column='1' id='type-id-20'/>
    <class-decl name='dmu_objset_stats' size-in-bits='2304' is-struct='yes' visibility='default' filepath='../../include/sys/dmu.h' line='931' column='1' id='type-id-78'>
>>>>>>> 9592cab4e... WIP Direct IO
>>>>>>> 41ceb90a6... WIP Direct IO
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dds_num_clones' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dds_creation_txg' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dds_guid' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dds_type' type-id='type-id-78' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='dds_is_snapshot' type-id='type-id-79' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='232'>
        <var-decl name='dds_inconsistent' type-id='type-id-79' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='240'>
<<<<<<< HEAD
        <var-decl name='dds_redacted' type-id='type-id-79' visibility='default'/>
=======
<<<<<<< HEAD
        <var-decl name='dds_redacted' type-id='type-id-84' visibility='default' filepath='../../include/sys/dmu.h' line='938' column='1'/>
>>>>>>> 41ceb90a6... WIP Direct IO
      </data-member>
      <data-member access='public' layout-offset-in-bits='248'>
        <var-decl name='dds_origin' type-id='type-id-12' visibility='default'/>
      </data-member>
    </class-decl>
<<<<<<< HEAD
    <enum-decl name='dmu_objset_type' id='type-id-80'>
      <underlying-type type-id='type-id-49'/>
=======
    <enum-decl name='dmu_objset_type' filepath='../../include/sys/fs/zfs.h' line='64' column='1' id='type-id-85'>
=======
        <var-decl name='dds_redacted' type-id='type-id-80' visibility='default' filepath='../../include/sys/dmu.h' line='938' column='1'/>
=======
    <typedef-decl name='zfs_type_t' type-id='type-id-97' filepath='../../include/sys/fs/zfs.h' line='58' column='1' id='type-id-20'/>
    <class-decl name='dmu_objset_stats' size-in-bits='2304' is-struct='yes' visibility='default' filepath='../../include/sys/dmu.h' line='941' column='1' id='type-id-98'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dds_num_clones' type-id='type-id-27' visibility='default' filepath='../../include/sys/dmu.h' line='942' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dds_creation_txg' type-id='type-id-27' visibility='default' filepath='../../include/sys/dmu.h' line='943' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dds_guid' type-id='type-id-27' visibility='default' filepath='../../include/sys/dmu.h' line='944' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dds_type' type-id='type-id-99' visibility='default' filepath='../../include/sys/dmu.h' line='945' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='dds_is_snapshot' type-id='type-id-100' visibility='default' filepath='../../include/sys/dmu.h' line='946' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='232'>
        <var-decl name='dds_inconsistent' type-id='type-id-100' visibility='default' filepath='../../include/sys/dmu.h' line='947' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='240'>
        <var-decl name='dds_redacted' type-id='type-id-100' visibility='default' filepath='../../include/sys/dmu.h' line='948' column='1'/>
>>>>>>> 28d08db2d... WIP Direct IO
      </data-member>
      <data-member access='public' layout-offset-in-bits='248'>
        <var-decl name='dds_origin' type-id='type-id-19' visibility='default' filepath='../../include/sys/dmu.h' line='949' column='1'/>
      </data-member>
    </class-decl>
<<<<<<< HEAD
    <enum-decl name='dmu_objset_type' filepath='../../include/sys/fs/zfs.h' line='64' column='1' id='type-id-81'>
=======
    <enum-decl name='dmu_objset_type' filepath='../../include/sys/fs/zfs.h' line='64' column='1' id='type-id-101'>
>>>>>>> 28d08db2d... WIP Direct IO
>>>>>>> 9592cab4e... WIP Direct IO
      <underlying-type type-id='type-id-7'/>
>>>>>>> 41ceb90a6... WIP Direct IO
      <enumerator name='DMU_OST_NONE' value='0'/>
      <enumerator name='DMU_OST_META' value='1'/>
      <enumerator name='DMU_OST_ZFS' value='2'/>
      <enumerator name='DMU_OST_ZVOL' value='3'/>
      <enumerator name='DMU_OST_OTHER' value='4'/>
      <enumerator name='DMU_OST_ANY' value='5'/>
      <enumerator name='DMU_OST_NUMTYPES' value='6'/>
    </enum-decl>
<<<<<<< HEAD
    <typedef-decl name='dmu_objset_type_t' type-id='type-id-80' id='type-id-78'/>
    <typedef-decl name='__uint8_t' type-id='type-id-75' id='type-id-81'/>
    <typedef-decl name='uint8_t' type-id='type-id-81' id='type-id-79'/>
    <typedef-decl name='dmu_objset_stats_t' type-id='type-id-77' id='type-id-14'/>
    <pointer-type-def type-id='type-id-79' size-in-bits='64' id='type-id-18'/>
    <pointer-type-def type-id='type-id-9' size-in-bits='64' id='type-id-82'/>
    <qualified-type-def type-id='type-id-32' const='yes' id='type-id-83'/>
    <pointer-type-def type-id='type-id-83' size-in-bits='64' id='type-id-84'/>
    <function-decl name='zfs_unmount' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-82'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-8'/>
=======
<<<<<<< HEAD
    <typedef-decl name='dmu_objset_type_t' type-id='type-id-85' filepath='../../include/sys/fs/zfs.h' line='72' column='1' id='type-id-83'/>
    <typedef-decl name='__uint8_t' type-id='type-id-80' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='37' column='1' id='type-id-86'/>
    <typedef-decl name='uint8_t' type-id='type-id-86' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='24' column='1' id='type-id-84'/>
    <typedef-decl name='dmu_objset_stats_t' type-id='type-id-82' filepath='../../include/sys/dmu.h' line='940' column='1' id='type-id-27'/>
    <pointer-type-def type-id='type-id-84' size-in-bits='64' id='type-id-30'/>
    <pointer-type-def type-id='type-id-22' size-in-bits='64' id='type-id-87'/>
    <qualified-type-def type-id='type-id-42' const='yes' id='type-id-88'/>
=======
<<<<<<< HEAD
    <typedef-decl name='dmu_objset_type_t' type-id='type-id-81' filepath='../../include/sys/fs/zfs.h' line='72' column='1' id='type-id-79'/>
    <typedef-decl name='__uint8_t' type-id='type-id-76' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='37' column='1' id='type-id-82'/>
    <typedef-decl name='uint8_t' type-id='type-id-82' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='24' column='1' id='type-id-80'/>
    <typedef-decl name='dmu_objset_stats_t' type-id='type-id-78' filepath='../../include/sys/dmu.h' line='940' column='1' id='type-id-21'/>
    <pointer-type-def type-id='type-id-80' size-in-bits='64' id='type-id-24'/>
    <typedef-decl name='zfs_handle_t' type-id='type-id-16' filepath='../../include/libzfs.h' line='195' column='1' id='type-id-83'/>
    <pointer-type-def type-id='type-id-83' size-in-bits='64' id='type-id-84'/>
    <function-decl name='changelist_gather' mangled-name='changelist_gather' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_changelist.c' line='624' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='changelist_gather'>
      <parameter type-id='type-id-84' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_changelist.c' line='624' column='1'/>
      <parameter type-id='type-id-2' name='prop' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_changelist.c' line='624' column='1'/>
      <parameter type-id='type-id-6' name='gather_flags' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_changelist.c' line='624' column='1'/>
      <parameter type-id='type-id-6' name='mnt_flags' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_changelist.c' line='625' column='1'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='changelist_free' mangled-name='changelist_free' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_changelist.c' line='412' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='changelist_free'>
      <parameter type-id='type-id-15' name='clp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_changelist.c' line='412' column='1'/>
      <return type-id='type-id-67'/>
    </function-decl>
    <qualified-type-def type-id='type-id-36' const='yes' id='type-id-85'/>
    <pointer-type-def type-id='type-id-85' size-in-bits='64' id='type-id-86'/>
    <function-decl name='changelist_remove' mangled-name='changelist_remove' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_changelist.c' line='387' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='changelist_remove'>
      <parameter type-id='type-id-15' name='clp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_changelist.c' line='387' column='1'/>
      <parameter type-id='type-id-86' name='name' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_changelist.c' line='387' column='1'/>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='changelist_haszonedchild' mangled-name='changelist_haszonedchild' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_changelist.c' line='378' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='changelist_haszonedchild'>
      <parameter type-id='type-id-15' name='clp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_changelist.c' line='378' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='../../include/libzfs_impl.h' line='107' column='1' id='type-id-87'>
=======
    <typedef-decl name='dmu_objset_type_t' type-id='type-id-101' filepath='../../include/sys/fs/zfs.h' line='72' column='1' id='type-id-99'/>
    <typedef-decl name='__uint8_t' type-id='type-id-96' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='38' column='1' id='type-id-102'/>
    <typedef-decl name='uint8_t' type-id='type-id-102' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='24' column='1' id='type-id-100'/>
    <typedef-decl name='dmu_objset_stats_t' type-id='type-id-98' filepath='../../include/sys/dmu.h' line='950' column='1' id='type-id-21'/>
    <pointer-type-def type-id='type-id-100' size-in-bits='64' id='type-id-24'/>
    <typedef-decl name='zfs_handle_t' type-id='type-id-16' filepath='../../include/libzfs.h' line='195' column='1' id='type-id-103'/>
    <pointer-type-def type-id='type-id-103' size-in-bits='64' id='type-id-104'/>
    <function-decl name='changelist_gather' mangled-name='changelist_gather' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_changelist.c' line='624' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='changelist_gather'>
      <parameter type-id='type-id-104' name='zhp' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_changelist.c' line='624' column='1'/>
      <parameter type-id='type-id-2' name='prop' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_changelist.c' line='624' column='1'/>
      <parameter type-id='type-id-6' name='gather_flags' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_changelist.c' line='624' column='1'/>
      <parameter type-id='type-id-6' name='mnt_flags' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_changelist.c' line='625' column='1'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='changelist_free' mangled-name='changelist_free' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_changelist.c' line='412' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='changelist_free'>
      <parameter type-id='type-id-15' name='clp' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_changelist.c' line='412' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <qualified-type-def type-id='type-id-46' const='yes' id='type-id-105'/>
    <pointer-type-def type-id='type-id-105' size-in-bits='64' id='type-id-106'/>
    <function-decl name='changelist_remove' mangled-name='changelist_remove' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_changelist.c' line='387' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='changelist_remove'>
      <parameter type-id='type-id-15' name='clp' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_changelist.c' line='387' column='1'/>
      <parameter type-id='type-id-106' name='name' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_changelist.c' line='387' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='changelist_haszonedchild' mangled-name='changelist_haszonedchild' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_changelist.c' line='378' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='changelist_haszonedchild'>
      <parameter type-id='type-id-15' name='clp' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_changelist.c' line='378' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='../../include/libzfs_impl.h' line='110' column='1' id='type-id-107'>
>>>>>>> 28d08db2d... WIP Direct IO
      <underlying-type type-id='type-id-7'/>
      <enumerator name='PROTO_NFS' value='0'/>
      <enumerator name='PROTO_SMB' value='1'/>
      <enumerator name='PROTO_END' value='2'/>
    </enum-decl>
<<<<<<< HEAD
    <typedef-decl name='zfs_share_proto_t' type-id='type-id-87' filepath='../../include/libzfs_impl.h' line='111' column='1' id='type-id-88'/>
>>>>>>> 9592cab4e... WIP Direct IO
    <pointer-type-def type-id='type-id-88' size-in-bits='64' id='type-id-89'/>
    <function-decl name='zfs_unmount' filepath='../../include/libzfs.h' line='827' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_unshare_smb' filepath='../../include/libzfs.h' line='853' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-89'/>
      <return type-id='type-id-1'/>
>>>>>>> 41ceb90a6... WIP Direct IO
    </function-decl>
    <function-decl name='zfs_unshare_smb' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-82'/>
      <parameter type-id='type-id-84'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_commit_smb_shares' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-6'/>
    </function-decl>
<<<<<<< HEAD
    <function-decl name='uu_avl_walk_end' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='uu_avl_last' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-7'/>
=======
    <function-decl name='changelist_postfix' mangled-name='changelist_postfix' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_changelist.c' line='170' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='changelist_postfix'>
      <parameter type-id='type-id-15' name='clp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_changelist.c' line='170' column='1'/>
<<<<<<< HEAD
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='uu_avl_last' filepath='../../include/libuutil.h' line='331' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-21'/>
=======
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='changelist_prefix' mangled-name='changelist_prefix' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_changelist.c' line='96' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='changelist_prefix'>
      <parameter type-id='type-id-15' name='clp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_changelist.c' line='96' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_alloc' mangled-name='zfs_alloc' filepath='../../include/libzfs_impl.h' line='136' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='uu_avl_pool_create' mangled-name='uu_avl_pool_create' filepath='../../include/libuutil.h' line='304' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='uu_avl_create' mangled-name='uu_avl_create' filepath='../../include/libuutil.h' line='323' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
=======
    <typedef-decl name='zfs_share_proto_t' type-id='type-id-107' filepath='../../include/libzfs_impl.h' line='114' column='1' id='type-id-108'/>
    <pointer-type-def type-id='type-id-108' size-in-bits='64' id='type-id-109'/>
    <function-decl name='changelist_unshare' mangled-name='changelist_unshare' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_changelist.c' line='348' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='changelist_unshare'>
      <parameter type-id='type-id-15' name='clp' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_changelist.c' line='348' column='1'/>
      <parameter type-id='type-id-109' name='proto' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_changelist.c' line='348' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='changelist_rename' mangled-name='changelist_rename' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_changelist.c' line='311' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='changelist_rename'>
      <parameter type-id='type-id-15' name='clp' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_changelist.c' line='311' column='1'/>
      <parameter type-id='type-id-106' name='src' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_changelist.c' line='311' column='1'/>
      <parameter type-id='type-id-106' name='dst' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_changelist.c' line='311' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='isa_child_of' mangled-name='isa_child_of' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_changelist.c' line='288' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='isa_child_of'>
      <parameter type-id='type-id-106' name='dataset' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_changelist.c' line='288' column='1'/>
      <parameter type-id='type-id-106' name='parent' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_changelist.c' line='288' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='changelist_postfix' mangled-name='changelist_postfix' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_changelist.c' line='170' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='changelist_postfix'>
      <parameter type-id='type-id-15' name='clp' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_changelist.c' line='170' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='changelist_prefix' mangled-name='changelist_prefix' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_changelist.c' line='96' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='changelist_prefix'>
      <parameter type-id='type-id-15' name='clp' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_changelist.c' line='96' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_alloc' mangled-name='zfs_alloc' filepath='../../include/libzfs_impl.h' line='139' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='uu_avl_pool_create' mangled-name='uu_avl_pool_create' filepath='../../include/libuutil.h' line='332' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='uu_avl_create' mangled-name='uu_avl_create' filepath='../../include/libuutil.h' line='351' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
>>>>>>> 28d08db2d... WIP Direct IO
    </function-decl>
<<<<<<< HEAD
    <function-decl name='zfs_prop_get' mangled-name='zfs_prop_get' filepath='../../include/libzfs.h' line='494' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='zfs_iter_dependents' mangled-name='zfs_iter_dependents' filepath='../../include/libzfs.h' line='615' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='zfs_get_name' mangled-name='zfs_get_name' filepath='../../include/libzfs.h' line='471' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='zfs_open' mangled-name='zfs_open' filepath='../../include/libzfs.h' line='467' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='zfs_is_shared' mangled-name='zfs_is_shared' filepath='../../include/libzfs.h' line='840' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='zfs_prop_get_int' mangled-name='zfs_prop_get_int' filepath='../../include/libzfs.h' line='511' column='1' visibility='default' binding='global' size-in-bits='64'>
<<<<<<< HEAD
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='uu_avl_node_init' mangled-name='uu_avl_node_init' filepath='../../include/libuutil.h' line='320' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='uu_avl_find' mangled-name='uu_avl_find' filepath='../../include/libuutil.h' line='342' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='free' mangled-name='free' filepath='/usr/include/stdlib.h' line='563' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
=======
      <return type-id='type-id-52'/>
=======
    <function-decl name='zfs_prop_get' mangled-name='zfs_prop_get' filepath='../../include/libzfs.h' line='493' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='zfs_iter_dependents' mangled-name='zfs_iter_dependents' filepath='../../include/libzfs.h' line='614' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='zfs_get_name' mangled-name='zfs_get_name' filepath='../../include/libzfs.h' line='470' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='zfs_open' mangled-name='zfs_open' filepath='../../include/libzfs.h' line='466' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='zfs_is_shared' mangled-name='zfs_is_shared' filepath='../../include/libzfs.h' line='836' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='zfs_prop_get_int' mangled-name='zfs_prop_get_int' filepath='../../include/libzfs.h' line='510' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
>>>>>>> c48db4d89... WIP Direct IO
    </function-decl>
    <function-decl name='uu_avl_node_init' mangled-name='uu_avl_node_init' filepath='../../include/libuutil.h' line='348' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='uu_avl_find' mangled-name='uu_avl_find' filepath='../../include/libuutil.h' line='370' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='free' mangled-name='free' filepath='/usr/include/stdlib.h' line='565' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
>>>>>>> 28d08db2d... WIP Direct IO
    </function-decl>
<<<<<<< HEAD
    <function-decl name='zfs_close' mangled-name='zfs_close' filepath='../../include/libzfs.h' line='469' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='zfs_iter_children' mangled-name='zfs_iter_children' filepath='../../include/libzfs.h' line='614' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='zfs_iter_mounted' mangled-name='zfs_iter_mounted' filepath='../../include/libzfs.h' line='623' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='zfs_is_mounted' mangled-name='zfs_is_mounted' filepath='../../include/libzfs.h' line='824' column='1' visibility='default' binding='global' size-in-bits='64'>
<<<<<<< HEAD
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='uu_avl_insert' mangled-name='uu_avl_insert' filepath='../../include/libuutil.h' line='343' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='zfs_error' mangled-name='zfs_error' filepath='../../include/libzfs_impl.h' line='133' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='strcmp' mangled-name='strcmp' filepath='/usr/include/string.h' line='136' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='zfs_get_handle' mangled-name='zfs_get_handle' filepath='../../include/libzfs.h' line='210' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
>>>>>>> 9592cab4e... WIP Direct IO
>>>>>>> 41ceb90a6... WIP Direct IO
    </function-decl>
    <function-decl name='remove_mountpoint' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-82'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_share_smb' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-82'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_refresh_properties' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-82'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-85'>
      <underlying-type type-id='type-id-49'/>
      <enumerator name='ZPROP_CONT' value='-2'/>
      <enumerator name='ZPROP_INVAL' value='-1'/>
      <enumerator name='ZFS_PROP_TYPE' value='0'/>
      <enumerator name='ZFS_PROP_CREATION' value='1'/>
      <enumerator name='ZFS_PROP_USED' value='2'/>
      <enumerator name='ZFS_PROP_AVAILABLE' value='3'/>
      <enumerator name='ZFS_PROP_REFERENCED' value='4'/>
      <enumerator name='ZFS_PROP_COMPRESSRATIO' value='5'/>
      <enumerator name='ZFS_PROP_MOUNTED' value='6'/>
      <enumerator name='ZFS_PROP_ORIGIN' value='7'/>
      <enumerator name='ZFS_PROP_QUOTA' value='8'/>
      <enumerator name='ZFS_PROP_RESERVATION' value='9'/>
      <enumerator name='ZFS_PROP_VOLSIZE' value='10'/>
      <enumerator name='ZFS_PROP_VOLBLOCKSIZE' value='11'/>
      <enumerator name='ZFS_PROP_RECORDSIZE' value='12'/>
      <enumerator name='ZFS_PROP_MOUNTPOINT' value='13'/>
      <enumerator name='ZFS_PROP_SHARENFS' value='14'/>
      <enumerator name='ZFS_PROP_CHECKSUM' value='15'/>
      <enumerator name='ZFS_PROP_COMPRESSION' value='16'/>
      <enumerator name='ZFS_PROP_ATIME' value='17'/>
      <enumerator name='ZFS_PROP_DEVICES' value='18'/>
      <enumerator name='ZFS_PROP_EXEC' value='19'/>
      <enumerator name='ZFS_PROP_SETUID' value='20'/>
      <enumerator name='ZFS_PROP_READONLY' value='21'/>
      <enumerator name='ZFS_PROP_ZONED' value='22'/>
      <enumerator name='ZFS_PROP_SNAPDIR' value='23'/>
      <enumerator name='ZFS_PROP_ACLMODE' value='24'/>
      <enumerator name='ZFS_PROP_ACLINHERIT' value='25'/>
      <enumerator name='ZFS_PROP_CREATETXG' value='26'/>
      <enumerator name='ZFS_PROP_NAME' value='27'/>
      <enumerator name='ZFS_PROP_CANMOUNT' value='28'/>
      <enumerator name='ZFS_PROP_ISCSIOPTIONS' value='29'/>
      <enumerator name='ZFS_PROP_XATTR' value='30'/>
      <enumerator name='ZFS_PROP_NUMCLONES' value='31'/>
      <enumerator name='ZFS_PROP_COPIES' value='32'/>
      <enumerator name='ZFS_PROP_VERSION' value='33'/>
      <enumerator name='ZFS_PROP_UTF8ONLY' value='34'/>
      <enumerator name='ZFS_PROP_NORMALIZE' value='35'/>
      <enumerator name='ZFS_PROP_CASE' value='36'/>
      <enumerator name='ZFS_PROP_VSCAN' value='37'/>
      <enumerator name='ZFS_PROP_NBMAND' value='38'/>
      <enumerator name='ZFS_PROP_SHARESMB' value='39'/>
      <enumerator name='ZFS_PROP_REFQUOTA' value='40'/>
      <enumerator name='ZFS_PROP_REFRESERVATION' value='41'/>
      <enumerator name='ZFS_PROP_GUID' value='42'/>
      <enumerator name='ZFS_PROP_PRIMARYCACHE' value='43'/>
      <enumerator name='ZFS_PROP_SECONDARYCACHE' value='44'/>
      <enumerator name='ZFS_PROP_USEDSNAP' value='45'/>
      <enumerator name='ZFS_PROP_USEDDS' value='46'/>
      <enumerator name='ZFS_PROP_USEDCHILD' value='47'/>
      <enumerator name='ZFS_PROP_USEDREFRESERV' value='48'/>
      <enumerator name='ZFS_PROP_USERACCOUNTING' value='49'/>
      <enumerator name='ZFS_PROP_STMF_SHAREINFO' value='50'/>
      <enumerator name='ZFS_PROP_DEFER_DESTROY' value='51'/>
      <enumerator name='ZFS_PROP_USERREFS' value='52'/>
      <enumerator name='ZFS_PROP_LOGBIAS' value='53'/>
      <enumerator name='ZFS_PROP_UNIQUE' value='54'/>
      <enumerator name='ZFS_PROP_OBJSETID' value='55'/>
      <enumerator name='ZFS_PROP_DEDUP' value='56'/>
      <enumerator name='ZFS_PROP_MLSLABEL' value='57'/>
      <enumerator name='ZFS_PROP_SYNC' value='58'/>
      <enumerator name='ZFS_PROP_DNODESIZE' value='59'/>
      <enumerator name='ZFS_PROP_REFRATIO' value='60'/>
      <enumerator name='ZFS_PROP_WRITTEN' value='61'/>
      <enumerator name='ZFS_PROP_CLONES' value='62'/>
      <enumerator name='ZFS_PROP_LOGICALUSED' value='63'/>
      <enumerator name='ZFS_PROP_LOGICALREFERENCED' value='64'/>
      <enumerator name='ZFS_PROP_INCONSISTENT' value='65'/>
      <enumerator name='ZFS_PROP_VOLMODE' value='66'/>
      <enumerator name='ZFS_PROP_FILESYSTEM_LIMIT' value='67'/>
      <enumerator name='ZFS_PROP_SNAPSHOT_LIMIT' value='68'/>
      <enumerator name='ZFS_PROP_FILESYSTEM_COUNT' value='69'/>
      <enumerator name='ZFS_PROP_SNAPSHOT_COUNT' value='70'/>
      <enumerator name='ZFS_PROP_SNAPDEV' value='71'/>
      <enumerator name='ZFS_PROP_ACLTYPE' value='72'/>
      <enumerator name='ZFS_PROP_SELINUX_CONTEXT' value='73'/>
      <enumerator name='ZFS_PROP_SELINUX_FSCONTEXT' value='74'/>
      <enumerator name='ZFS_PROP_SELINUX_DEFCONTEXT' value='75'/>
      <enumerator name='ZFS_PROP_SELINUX_ROOTCONTEXT' value='76'/>
      <enumerator name='ZFS_PROP_RELATIME' value='77'/>
      <enumerator name='ZFS_PROP_REDUNDANT_METADATA' value='78'/>
      <enumerator name='ZFS_PROP_OVERLAY' value='79'/>
      <enumerator name='ZFS_PROP_PREV_SNAP' value='80'/>
      <enumerator name='ZFS_PROP_RECEIVE_RESUME_TOKEN' value='81'/>
      <enumerator name='ZFS_PROP_ENCRYPTION' value='82'/>
      <enumerator name='ZFS_PROP_KEYLOCATION' value='83'/>
      <enumerator name='ZFS_PROP_KEYFORMAT' value='84'/>
      <enumerator name='ZFS_PROP_PBKDF2_SALT' value='85'/>
      <enumerator name='ZFS_PROP_PBKDF2_ITERS' value='86'/>
      <enumerator name='ZFS_PROP_ENCRYPTION_ROOT' value='87'/>
      <enumerator name='ZFS_PROP_KEY_GUID' value='88'/>
      <enumerator name='ZFS_PROP_KEYSTATUS' value='89'/>
      <enumerator name='ZFS_PROP_REMAPTXG' value='90'/>
      <enumerator name='ZFS_PROP_SPECIAL_SMALL_BLOCKS' value='91'/>
      <enumerator name='ZFS_PROP_IVSET_GUID' value='92'/>
      <enumerator name='ZFS_PROP_REDACTED' value='93'/>
      <enumerator name='ZFS_PROP_REDACT_SNAPS' value='94'/>
      <enumerator name='ZFS_NUM_PROPS' value='95'/>
    </enum-decl>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-86'>
      <underlying-type type-id='type-id-49'/>
      <enumerator name='ZPROP_SRC_NONE' value='1'/>
      <enumerator name='ZPROP_SRC_DEFAULT' value='2'/>
      <enumerator name='ZPROP_SRC_TEMPORARY' value='4'/>
      <enumerator name='ZPROP_SRC_LOCAL' value='8'/>
      <enumerator name='ZPROP_SRC_INHERITED' value='16'/>
      <enumerator name='ZPROP_SRC_RECEIVED' value='32'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-86' size-in-bits='64' id='type-id-87'/>
    <function-decl name='zfs_prop_get' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-82'/>
      <parameter type-id='type-id-85'/>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-50'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_prop_get_int' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-82'/>
      <parameter type-id='type-id-85'/>
      <return type-id='type-id-35'/>
    </function-decl>
    <pointer-type-def type-id='type-id-17' size-in-bits='64' id='type-id-88'/>
    <function-decl name='zfs_is_mounted' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-82'/>
      <parameter type-id='type-id-88'/>
      <return type-id='type-id-50'/>
    </function-decl>
    <function-decl name='zfs_mount' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-82'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_unshare_nfs' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-82'/>
      <parameter type-id='type-id-84'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_share_nfs' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-82'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_commit_nfs_shares' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='strlcpy' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-35'/>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='strlcat' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-35'/>
      <return type-id='type-id-35'/>
    </function-decl>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-89'>
      <underlying-type type-id='type-id-49'/>
      <enumerator name='PROTO_NFS' value='0'/>
      <enumerator name='PROTO_SMB' value='1'/>
      <enumerator name='PROTO_END' value='2'/>
    </enum-decl>
    <function-decl name='zfs_unshare_proto' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-82'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-87'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_commit_proto' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-87'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='uu_avl_remove' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_close' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-82'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='uu_avl_destroy' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-6'/>
    </function-decl>
<<<<<<< HEAD
    <pointer-type-def type-id='type-id-45' size-in-bits='64' id='type-id-90'/>
    <function-decl name='uu_avl_pool_destroy' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-90'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <pointer-type-def type-id='type-id-19' size-in-bits='64' id='type-id-91'/>
    <function-decl name='zfs_alloc' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-35'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <pointer-type-def type-id='type-id-92' size-in-bits='64' id='type-id-93'/>
    <function-decl name='uu_avl_pool_create' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-93'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-90'/>
=======
<<<<<<< HEAD
    <function-decl name='uu_avl_remove' filepath='../../include/libuutil.h' line='350' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='zfs_close' filepath='../../include/libzfs.h' line='469' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-87'/>
      <return type-id='type-id-20'/>
=======
    <function-decl name='strncmp' mangled-name='strncmp' filepath='/usr/include/string.h' line='139' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
=======
      <return type-id='type-id-52'/>
=======
    <function-decl name='zfs_close' mangled-name='zfs_close' filepath='../../include/libzfs.h' line='468' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='zfs_iter_children' mangled-name='zfs_iter_children' filepath='../../include/libzfs.h' line='613' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='zfs_iter_mounted' mangled-name='zfs_iter_mounted' filepath='../../include/libzfs.h' line='622' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='zfs_is_mounted' mangled-name='zfs_is_mounted' filepath='../../include/libzfs.h' line='820' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
>>>>>>> c48db4d89... WIP Direct IO
    </function-decl>
    <function-decl name='uu_avl_insert' mangled-name='uu_avl_insert' filepath='../../include/libuutil.h' line='371' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='zfs_error' mangled-name='zfs_error' filepath='../../include/libzfs_impl.h' line='136' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='__stack_chk_fail' mangled-name='__stack_chk_fail' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='strcmp' mangled-name='strcmp' filepath='/usr/include/string.h' line='137' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='zfs_get_handle' mangled-name='zfs_get_handle' filepath='../../include/libzfs.h' line='210' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='getzoneid' mangled-name='getzoneid' filepath='../../include/sys/zfs_context.h' line='732' column='1' visibility='default' binding='global' size-in-bits='64'>
<<<<<<< HEAD
      <return type-id='type-id-52'/>
=======
      <return type-id='type-id-51'/>
>>>>>>> c48db4d89... WIP Direct IO
    </function-decl>
    <function-decl name='uu_avl_walk_start' mangled-name='uu_avl_walk_start' filepath='../../include/libuutil.h' line='366' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='uu_avl_remove' mangled-name='uu_avl_remove' filepath='../../include/libuutil.h' line='378' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='uu_avl_walk_next' mangled-name='uu_avl_walk_next' filepath='../../include/libuutil.h' line='367' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='uu_avl_walk_end' mangled-name='uu_avl_walk_end' filepath='../../include/libuutil.h' line='368' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='uu_avl_destroy' mangled-name='uu_avl_destroy' filepath='../../include/libuutil.h' line='354' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='uu_avl_pool_destroy' mangled-name='uu_avl_pool_destroy' filepath='../../include/libuutil.h' line='336' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='zfs_unshare_proto' mangled-name='zfs_unshare_proto' filepath='../../include/libzfs_impl.h' line='211' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='zfs_commit_proto' mangled-name='zfs_commit_proto' filepath='../../include/libzfs_impl.h' line='260' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='remove_mountpoint' mangled-name='remove_mountpoint' filepath='../../include/libzfs_impl.h' line='192' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='strlcpy' mangled-name='strlcpy' filepath='../../lib/libspl/include/string.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='strlen' mangled-name='strlen' filepath='/usr/include/string.h' line='385' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='strlcat' mangled-name='strlcat' filepath='../../lib/libspl/include/string.h' line='33' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='strncmp' mangled-name='strncmp' filepath='/usr/include/string.h' line='140' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
>>>>>>> 28d08db2d... WIP Direct IO
    </function-decl>
<<<<<<< HEAD
    <function-decl name='zfs_refresh_properties' mangled-name='zfs_refresh_properties' filepath='../../include/libzfs.h' line='810' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
>>>>>>> 9592cab4e... WIP Direct IO
    </function-decl>
    <function-decl name='changelist_free' mangled-name='changelist_free' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_changelist.c' line='412' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='changelist_free'>
      <parameter type-id='type-id-15' name='clp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_changelist.c' line='412' column='1'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='uu_avl_destroy' filepath='../../include/libuutil.h' line='326' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <pointer-type-def type-id='type-id-9' size-in-bits='64' id='type-id-96'/>
    <function-decl name='uu_avl_pool_destroy' filepath='../../include/libuutil.h' line='308' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-96'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <typedef-decl name='zfs_handle_t' type-id='type-id-22' filepath='../../include/libzfs.h' line='195' column='1' id='type-id-97'/>
    <pointer-type-def type-id='type-id-97' size-in-bits='64' id='type-id-98'/>
    <function-decl name='changelist_gather' mangled-name='changelist_gather' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_changelist.c' line='624' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='changelist_gather'>
      <parameter type-id='type-id-98' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_changelist.c' line='624' column='1'/>
      <parameter type-id='type-id-3' name='prop' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_changelist.c' line='624' column='1'/>
      <parameter type-id='type-id-1' name='gather_flags' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_changelist.c' line='624' column='1'/>
      <parameter type-id='type-id-1' name='mnt_flags' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_changelist.c' line='625' column='1'/>
      <return type-id='type-id-15'/>
>>>>>>> 41ceb90a6... WIP Direct IO
    </function-decl>
    <function-decl name='uu_avl_create' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-90'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_error' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-84'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <pointer-type-def type-id='type-id-94' size-in-bits='64' id='type-id-95'/>
    <function-decl name='zfs_iter_dependents' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-82'/>
      <parameter type-id='type-id-50'/>
      <parameter type-id='type-id-95'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_iter_mounted' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-82'/>
      <parameter type-id='type-id-95'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_iter_children' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-82'/>
      <parameter type-id='type-id-95'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <qualified-type-def type-id='type-id-9' const='yes' id='type-id-96'/>
    <pointer-type-def type-id='type-id-96' size-in-bits='64' id='type-id-97'/>
    <function-decl name='zfs_get_name' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-97'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='zfs_open' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-82'/>
    </function-decl>
    <function-decl name='zfs_is_shared' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-82'/>
      <return type-id='type-id-50'/>
    </function-decl>
    <class-decl name='uu_avl_node' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-98'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='uan_opaque' type-id='type-id-99' visibility='default'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-66' size-in-bits='192' id='type-id-99'>
      <subrange length='3' type-id='type-id-33' id='type-id-100'/>

    </array-type-def>
<<<<<<< HEAD
    <pointer-type-def type-id='type-id-98' size-in-bits='64' id='type-id-101'/>
    <function-decl name='uu_avl_node_init' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-101'/>
      <parameter type-id='type-id-90'/>
      <return type-id='type-id-6'/>
=======
    <pointer-type-def type-id='type-id-106' size-in-bits='64' id='type-id-109'/>
    <function-decl name='uu_avl_node_init' filepath='../../include/libuutil.h' line='320' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-109'/>
      <parameter type-id='type-id-96'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <pointer-type-def type-id='type-id-45' size-in-bits='64' id='type-id-110'/>
    <function-decl name='uu_avl_find' filepath='../../include/libuutil.h' line='342' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-110'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='uu_avl_insert' filepath='../../include/libuutil.h' line='343' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-45'/>
      <return type-id='type-id-20'/>
    </function-decl>
<<<<<<< HEAD
    <function-decl name='zfs_get_handle' filepath='../../include/libzfs.h' line='210' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-87'/>
      <return type-id='type-id-99'/>
=======
    <function-decl name='zfs_unmount' mangled-name='zfs_unmount' filepath='../../include/libzfs.h' line='827' column='1' visibility='default' binding='global' size-in-bits='64'>
<<<<<<< HEAD
      <return type-id='type-id-67'/>
>>>>>>> 9592cab4e... WIP Direct IO
>>>>>>> 41ceb90a6... WIP Direct IO
    </function-decl>
    <pointer-type-def type-id='type-id-35' size-in-bits='64' id='type-id-102'/>
    <function-decl name='uu_avl_find' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-102'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='uu_avl_insert' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-35'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_get_handle' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-82'/>
      <return type-id='type-id-91'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-68'>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-92'>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-94'>
      <parameter type-id='type-id-82'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-8'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='libzfs_config.c' comp-dir-path='/home/nabijaczleweli/store/code/zfs/lib/libzfs' language='LANG_C99'>
    <function-decl name='zpool_skip_pool' mangled-name='zpool_skip_pool' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_skip_pool'>
      <parameter type-id='type-id-84' name='poolname'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <pointer-type-def type-id='type-id-7' size-in-bits='64' id='type-id-103'/>
    <function-decl name='uu_avl_teardown' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-103'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <pointer-type-def type-id='type-id-36' size-in-bits='64' id='type-id-104'/>
    <function-decl name='nvlist_free' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-104'/>
      <return type-id='type-id-6'/>
    </function-decl>
<<<<<<< HEAD
    <pointer-type-def type-id='type-id-15' size-in-bits='64' id='type-id-105'/>
    <function-decl name='zpool_get_config' mangled-name='zpool_get_config' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_get_config'>
      <parameter type-id='type-id-11' name='zhp'/>
      <parameter type-id='type-id-105' name='oldconfig'/>
      <return type-id='type-id-15'/>
=======
    <function-decl name='namespace_clear' mangled-name='namespace_clear' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_config.c' line='79' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='namespace_clear'>
<<<<<<< HEAD
      <parameter type-id='type-id-23' name='hdl' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_config.c' line='79' column='1'/>
      <return type-id='type-id-20'/>
=======
      <parameter type-id='type-id-17' name='hdl' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_config.c' line='79' column='1'/>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='uu_avl_first' mangled-name='uu_avl_first' filepath='../../include/libuutil.h' line='330' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='make_dataset_handle' mangled-name='make_dataset_handle' filepath='../../include/libzfs_impl.h' line='193' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='uu_avl_next' mangled-name='uu_avl_next' filepath='../../include/libuutil.h' line='333' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='zpool_open_silent' mangled-name='zpool_open_silent' filepath='../../include/libzfs_impl.h' line='197' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='strchr' mangled-name='strchr' filepath='/usr/include/string.h' line='225' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='getenv' mangled-name='getenv' filepath='/usr/include/stdlib.h' line='631' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='__builtin_memset' mangled-name='memset' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='strcpy' mangled-name='strcpy' filepath='/usr/include/string.h' line='121' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='zcmd_alloc_dst_nvlist' mangled-name='zcmd_alloc_dst_nvlist' filepath='../../include/libzfs_impl.h' line='173' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='__errno_location' mangled-name='__errno_location' filepath='/usr/include/errno.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='zcmd_expand_dst_nvlist' mangled-name='zcmd_expand_dst_nvlist' filepath='../../include/libzfs_impl.h' line='176' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
=======
      <return type-id='type-id-52'/>
=======
    <function-decl name='zfs_refresh_properties' mangled-name='zfs_refresh_properties' filepath='../../include/libzfs.h' line='806' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='zfs_share_nfs' mangled-name='zfs_share_nfs' filepath='../../include/libzfs.h' line='845' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='zfs_unshare_smb' mangled-name='zfs_unshare_smb' filepath='../../include/libzfs.h' line='849' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='zfs_unshare_nfs' mangled-name='zfs_unshare_nfs' filepath='../../include/libzfs.h' line='848' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='zfs_share_smb' mangled-name='zfs_share_smb' filepath='../../include/libzfs.h' line='846' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='zfs_mount' mangled-name='zfs_mount' filepath='../../include/libzfs.h' line='821' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='uu_avl_last' mangled-name='uu_avl_last' filepath='../../include/libuutil.h' line='359' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='zfs_commit_smb_shares' mangled-name='zfs_commit_smb_shares' filepath='../../include/libzfs.h' line='858' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='zfs_commit_nfs_shares' mangled-name='zfs_commit_nfs_shares' filepath='../../include/libzfs.h' line='857' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='zfs_unmount' mangled-name='zfs_unmount' filepath='../../include/libzfs.h' line='823' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
>>>>>>> c48db4d89... WIP Direct IO
    </function-decl>
    <function-type size-in-bits='64' id='type-id-89'>
      <parameter type-id='type-id-43'/>
      <parameter type-id='type-id-43'/>
      <return type-id='type-id-6'/>
    </function-type>
  </abi-instr>
<<<<<<< HEAD
  <abi-instr version='1.0' address-size='64' path='libzfs_config.c' comp-dir-path='/home/colm/src/zfs/zfs/lib/libzfs' language='LANG_C99'>
    <pointer-type-def type-id='type-id-108' size-in-bits='64' id='type-id-109'/>
    <typedef-decl name='zfs_iter_f' type-id='type-id-109' filepath='../../include/libzfs.h' line='612' column='1' id='type-id-110'/>
    <function-decl name='zfs_iter_root' mangled-name='zfs_iter_root' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_config.c' line='434' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_iter_root'>
      <parameter type-id='type-id-17' name='hdl' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_config.c' line='434' column='1'/>
      <parameter type-id='type-id-110' name='func' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_config.c' line='434' column='1'/>
      <parameter type-id='type-id-42' name='data' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_config.c' line='434' column='1'/>
=======
  <abi-instr version='1.0' address-size='64' path='libzfs_config.c' comp-dir-path='/home/behlendo/src/git/zfs/lib/libzfs' language='LANG_C99'>
    <pointer-type-def type-id='type-id-110' size-in-bits='64' id='type-id-111'/>
    <typedef-decl name='zfs_iter_f' type-id='type-id-111' filepath='../../include/libzfs.h' line='611' column='1' id='type-id-112'/>
    <function-decl name='zfs_iter_root' mangled-name='zfs_iter_root' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_config.c' line='434' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_iter_root'>
      <parameter type-id='type-id-17' name='hdl' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_config.c' line='434' column='1'/>
      <parameter type-id='type-id-112' name='func' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_config.c' line='434' column='1'/>
      <parameter type-id='type-id-43' name='data' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_config.c' line='434' column='1'/>
>>>>>>> c48db4d89... WIP Direct IO
      <return type-id='type-id-6'/>
    </function-decl>
    <pointer-type-def type-id='type-id-113' size-in-bits='64' id='type-id-114'/>
    <typedef-decl name='zpool_iter_f' type-id='type-id-114' filepath='../../include/libzfs.h' line='246' column='1' id='type-id-115'/>
    <function-decl name='zpool_iter' mangled-name='zpool_iter' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_config.c' line='389' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_iter'>
      <parameter type-id='type-id-17' name='hdl' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_config.c' line='389' column='1'/>
      <parameter type-id='type-id-115' name='func' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_config.c' line='389' column='1'/>
      <parameter type-id='type-id-43' name='data' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_config.c' line='389' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zpool_skip_pool' mangled-name='zpool_skip_pool' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_config.c' line='340' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_skip_pool'>
      <parameter type-id='type-id-106' name='poolname' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_config.c' line='340' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-5' size-in-bits='64' id='type-id-116'/>
    <function-decl name='zpool_refresh_stats' mangled-name='zpool_refresh_stats' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_config.c' line='265' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_refresh_stats'>
      <parameter type-id='type-id-18' name='zhp' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_config.c' line='265' column='1'/>
      <parameter type-id='type-id-116' name='missing' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_config.c' line='265' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zpool_get_features' mangled-name='zpool_get_features' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_config.c' line='232' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_get_features'>
      <parameter type-id='type-id-18' name='zhp' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_config.c' line='232' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <pointer-type-def type-id='type-id-22' size-in-bits='64' id='type-id-117'/>
    <function-decl name='zpool_get_config' mangled-name='zpool_get_config' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_config.c' line='220' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_get_config'>
      <parameter type-id='type-id-18' name='zhp' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_config.c' line='220' column='1'/>
      <parameter type-id='type-id-117' name='oldconfig' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_config.c' line='220' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='namespace_clear' mangled-name='namespace_clear' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_config.c' line='79' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='namespace_clear'>
      <parameter type-id='type-id-17' name='hdl' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_config.c' line='79' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='uu_avl_first' mangled-name='uu_avl_first' filepath='../../include/libuutil.h' line='358' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='make_dataset_handle' mangled-name='make_dataset_handle' filepath='../../include/libzfs_impl.h' line='196' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='uu_avl_next' mangled-name='uu_avl_next' filepath='../../include/libuutil.h' line='361' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='zpool_open_silent' mangled-name='zpool_open_silent' filepath='../../include/libzfs_impl.h' line='200' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='strchr' mangled-name='strchr' filepath='/usr/include/string.h' line='226' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='getenv' mangled-name='getenv' filepath='/usr/include/stdlib.h' line='634' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='__builtin___strcpy_chk' mangled-name='__strcpy_chk' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='__builtin_memset' mangled-name='memset' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='zcmd_alloc_dst_nvlist' mangled-name='zcmd_alloc_dst_nvlist' filepath='../../include/libzfs_impl.h' line='176' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='__errno_location' mangled-name='__errno_location' filepath='/usr/include/errno.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='zcmd_expand_dst_nvlist' mangled-name='zcmd_expand_dst_nvlist' filepath='../../include/libzfs_impl.h' line='179' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
>>>>>>> 28d08db2d... WIP Direct IO
    </function-decl>
<<<<<<< HEAD
    <function-decl name='zfs_ioctl' mangled-name='zfs_ioctl' filepath='../../include/libzfs.h' line='455' column='1' visibility='default' binding='global' size-in-bits='64'>
<<<<<<< HEAD
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='zcmd_read_dst_nvlist' mangled-name='zcmd_read_dst_nvlist' filepath='../../include/libzfs_impl.h' line='177' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='zcmd_free_nvlists' mangled-name='zcmd_free_nvlists' filepath='../../include/libzfs_impl.h' line='178' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='nvlist_free' mangled-name='nvlist_free' filepath='../../include/sys/nvpair.h' line='152' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='nvlist_exists' mangled-name='nvlist_exists' filepath='../../include/sys/nvpair.h' line='238' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='nvlist_lookup_nvlist' mangled-name='nvlist_lookup_nvlist' filepath='../../include/sys/nvpair.h' line='214' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='libspl_assertf' mangled-name='libspl_assertf' filepath='../../lib/libspl/include/assert.h' line='40' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='no_memory' mangled-name='no_memory' filepath='../../include/libzfs_impl.h' line='140' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='nvlist_dup' mangled-name='nvlist_dup' filepath='../../include/sys/nvpair.h' line='156' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='nvpair_name' mangled-name='nvpair_name' filepath='../../include/sys/nvpair.h' line='244' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='zfs_strdup' mangled-name='zfs_strdup' filepath='../../include/libzfs_impl.h' line='139' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='nvpair_value_nvlist' mangled-name='nvpair_value_nvlist' filepath='../../include/sys/nvpair.h' line='258' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='dcgettext' mangled-name='dcgettext' filepath='/usr/include/libintl.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='zfs_standard_error' mangled-name='zfs_standard_error' filepath='../../include/libzfs_impl.h' line='142' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='uu_avl_teardown' mangled-name='uu_avl_teardown' filepath='../../include/libuutil.h' line='348' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='nvlist_next_nvpair' mangled-name='nvlist_next_nvpair' filepath='../../include/sys/nvpair.h' line='242' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
>>>>>>> 9592cab4e... WIP Direct IO
    </function-decl>
    <pointer-type-def type-id='type-id-21' size-in-bits='64' id='type-id-111'/>
    <function-decl name='uu_avl_teardown' filepath='../../include/libuutil.h' line='348' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-18'/>
<<<<<<< HEAD
      <parameter type-id='type-id-111'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <pointer-type-def type-id='type-id-46' size-in-bits='64' id='type-id-112'/>
    <function-decl name='nvlist_free' filepath='../../include/sys/nvpair.h' line='152' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-112'/>
      <return type-id='type-id-20'/>
=======
      <parameter type-id='type-id-68'/>
      <return type-id='type-id-6'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='libzfs_crypto.c' comp-dir-path='/home/nabijaczleweli/store/code/zfs/lib/libzfs' language='LANG_C99'>
    <function-decl name='zfs_crypto_rewrap' mangled-name='zfs_crypto_rewrap' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_crypto.c' line='1387' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_crypto_rewrap'>
      <parameter type-id='type-id-84' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_crypto.c' line='1387' column='1'/>
      <parameter type-id='type-id-22' name='raw_props' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_crypto.c' line='1387' column='1'/>
      <parameter type-id='type-id-5' name='inheritkey' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_crypto.c' line='1387' column='1'/>
=======
      <return type-id='type-id-52'/>
=======
    <function-decl name='zfs_ioctl' mangled-name='zfs_ioctl' filepath='../../include/libzfs.h' line='454' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
>>>>>>> c48db4d89... WIP Direct IO
    </function-decl>
    <function-decl name='zcmd_read_dst_nvlist' mangled-name='zcmd_read_dst_nvlist' filepath='../../include/libzfs_impl.h' line='180' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='zcmd_free_nvlists' mangled-name='zcmd_free_nvlists' filepath='../../include/libzfs_impl.h' line='181' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvlist_free' mangled-name='nvlist_free' filepath='../../include/sys/nvpair.h' line='152' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvlist_exists' mangled-name='nvlist_exists' filepath='../../include/sys/nvpair.h' line='238' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvlist_lookup_nvlist' mangled-name='nvlist_lookup_nvlist' filepath='../../include/sys/nvpair.h' line='214' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='libspl_assertf' mangled-name='libspl_assertf' filepath='../../lib/libspl/include/assert.h' line='40' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='no_memory' mangled-name='no_memory' filepath='../../include/libzfs_impl.h' line='143' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvlist_dup' mangled-name='nvlist_dup' filepath='../../include/sys/nvpair.h' line='156' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvpair_name' mangled-name='nvpair_name' filepath='../../include/sys/nvpair.h' line='244' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='zfs_strdup' mangled-name='zfs_strdup' filepath='../../include/libzfs_impl.h' line='142' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvpair_value_nvlist' mangled-name='nvpair_value_nvlist' filepath='../../include/sys/nvpair.h' line='258' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='dcgettext' mangled-name='dcgettext' filepath='/usr/include/libintl.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='zfs_standard_error' mangled-name='zfs_standard_error' filepath='../../include/libzfs_impl.h' line='145' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='uu_avl_teardown' mangled-name='uu_avl_teardown' filepath='../../include/libuutil.h' line='376' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvlist_next_nvpair' mangled-name='nvlist_next_nvpair' filepath='../../include/sys/nvpair.h' line='242' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-110'>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-43'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-113'>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-43'/>
      <return type-id='type-id-6'/>
    </function-type>
  </abi-instr>
<<<<<<< HEAD
  <abi-instr version='1.0' address-size='64' path='libzfs_crypto.c' comp-dir-path='/home/colm/src/zfs/zfs/lib/libzfs' language='LANG_C99'>
    <function-decl name='zfs_crypto_rewrap' mangled-name='zfs_crypto_rewrap' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_crypto.c' line='1387' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_crypto_rewrap'>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_crypto.c' line='1387' column='1'/>
      <parameter type-id='type-id-22' name='raw_props' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_crypto.c' line='1387' column='1'/>
      <parameter type-id='type-id-5' name='inheritkey' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_crypto.c' line='1387' column='1'/>
>>>>>>> 28d08db2d... WIP Direct IO
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_crypto_unload_key' mangled-name='zfs_crypto_unload_key' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_crypto.c' line='1251' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_crypto_unload_key'>
      <parameter type-id='type-id-84' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_crypto.c' line='1251' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_crypto_load_key' mangled-name='zfs_crypto_load_key' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_crypto.c' line='1083' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_crypto_load_key'>
      <parameter type-id='type-id-84' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_crypto.c' line='1083' column='1'/>
      <parameter type-id='type-id-5' name='noop' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_crypto.c' line='1083' column='1'/>
      <parameter type-id='type-id-23' name='alt_keylocation' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_crypto.c' line='1083' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_crypto_attempt_load_keys' mangled-name='zfs_crypto_attempt_load_keys' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_crypto.c' line='1048' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_crypto_attempt_load_keys'>
      <parameter type-id='type-id-17' name='hdl' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_crypto.c' line='1048' column='1'/>
      <parameter type-id='type-id-23' name='fsname' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_crypto.c' line='1048' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_crypto_clone_check' mangled-name='zfs_crypto_clone_check' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_crypto.c' line='982' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_crypto_clone_check'>
      <parameter type-id='type-id-17' name='hdl' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_crypto.c' line='982' column='1'/>
      <parameter type-id='type-id-84' name='origin_zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_crypto.c' line='982' column='1'/>
      <parameter type-id='type-id-23' name='parent_name' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_crypto.c' line='983' column='1'/>
      <parameter type-id='type-id-22' name='props' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_crypto.c' line='983' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <pointer-type-def type-id='type-id-24' size-in-bits='64' id='type-id-98'/>
    <typedef-decl name='uint_t' type-id='type-id-43' filepath='../../lib/libspl/include/sys/stdtypes.h' line='33' column='1' id='type-id-99'/>
    <pointer-type-def type-id='type-id-99' size-in-bits='64' id='type-id-100'/>
    <function-decl name='zfs_crypto_create' mangled-name='zfs_crypto_create' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_crypto.c' line='810' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_crypto_create'>
      <parameter type-id='type-id-17' name='hdl' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_crypto.c' line='810' column='1'/>
      <parameter type-id='type-id-23' name='parent_name' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_crypto.c' line='810' column='1'/>
      <parameter type-id='type-id-22' name='props' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_crypto.c' line='810' column='1'/>
      <parameter type-id='type-id-22' name='pool_props' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_crypto.c' line='811' column='1'/>
      <parameter type-id='type-id-5' name='stdin_available' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_crypto.c' line='811' column='1'/>
      <parameter type-id='type-id-98' name='wkeydata_out' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_crypto.c' line='811' column='1'/>
      <parameter type-id='type-id-100' name='wkeylen_out' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_crypto.c' line='812' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
<<<<<<< HEAD
    <function-decl name='zfs_crypto_get_encryption_root' mangled-name='zfs_crypto_get_encryption_root' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_crypto.c' line='779' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_crypto_get_encryption_root'>
      <parameter type-id='type-id-84' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_crypto.c' line='779' column='1'/>
      <parameter type-id='type-id-96' name='is_encroot' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_crypto.c' line='779' column='1'/>
      <parameter type-id='type-id-23' name='buf' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_crypto.c' line='780' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_name_to_prop' mangled-name='zfs_name_to_prop' filepath='../../include/sys/fs/zfs.h' line='313' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='zfs_error_aux' mangled-name='zfs_error_aux' filepath='../../include/libzfs_impl.h' line='135' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='fnvlist_alloc' mangled-name='fnvlist_alloc' filepath='../../include/sys/nvpair.h' line='276' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
=======
    <function-decl name='zfs_crypto_get_encryption_root' mangled-name='zfs_crypto_get_encryption_root' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_crypto.c' line='779' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_crypto_get_encryption_root'>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_crypto.c' line='779' column='1'/>
      <parameter type-id='type-id-114' name='is_encroot' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_crypto.c' line='779' column='1'/>
      <parameter type-id='type-id-23' name='buf' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_crypto.c' line='780' column='1'/>
=======
  <abi-instr version='1.0' address-size='64' path='libzfs_crypto.c' comp-dir-path='/home/behlendo/src/git/zfs/lib/libzfs' language='LANG_C99'>
    <function-decl name='zfs_crypto_rewrap' mangled-name='zfs_crypto_rewrap' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_crypto.c' line='1393' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_crypto_rewrap'>
      <parameter type-id='type-id-104' name='zhp' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_crypto.c' line='1393' column='1'/>
      <parameter type-id='type-id-22' name='raw_props' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_crypto.c' line='1393' column='1'/>
      <parameter type-id='type-id-5' name='inheritkey' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_crypto.c' line='1393' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_crypto_unload_key' mangled-name='zfs_crypto_unload_key' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_crypto.c' line='1257' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_crypto_unload_key'>
      <parameter type-id='type-id-104' name='zhp' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_crypto.c' line='1257' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_crypto_load_key' mangled-name='zfs_crypto_load_key' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_crypto.c' line='1089' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_crypto_load_key'>
      <parameter type-id='type-id-104' name='zhp' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_crypto.c' line='1089' column='1'/>
      <parameter type-id='type-id-5' name='noop' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_crypto.c' line='1089' column='1'/>
      <parameter type-id='type-id-23' name='alt_keylocation' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_crypto.c' line='1089' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_crypto_attempt_load_keys' mangled-name='zfs_crypto_attempt_load_keys' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_crypto.c' line='1054' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_crypto_attempt_load_keys'>
      <parameter type-id='type-id-17' name='hdl' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_crypto.c' line='1054' column='1'/>
      <parameter type-id='type-id-23' name='fsname' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_crypto.c' line='1054' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_crypto_clone_check' mangled-name='zfs_crypto_clone_check' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_crypto.c' line='988' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_crypto_clone_check'>
      <parameter type-id='type-id-17' name='hdl' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_crypto.c' line='988' column='1'/>
      <parameter type-id='type-id-104' name='origin_zhp' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_crypto.c' line='988' column='1'/>
      <parameter type-id='type-id-23' name='parent_name' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_crypto.c' line='989' column='1'/>
      <parameter type-id='type-id-22' name='props' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_crypto.c' line='989' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <pointer-type-def type-id='type-id-24' size-in-bits='64' id='type-id-118'/>
    <typedef-decl name='uint_t' type-id='type-id-66' filepath='../../lib/libspl/include/sys/stdtypes.h' line='33' column='1' id='type-id-119'/>
    <pointer-type-def type-id='type-id-119' size-in-bits='64' id='type-id-120'/>
    <function-decl name='zfs_crypto_create' mangled-name='zfs_crypto_create' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_crypto.c' line='816' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_crypto_create'>
      <parameter type-id='type-id-17' name='hdl' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_crypto.c' line='816' column='1'/>
      <parameter type-id='type-id-23' name='parent_name' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_crypto.c' line='816' column='1'/>
      <parameter type-id='type-id-22' name='props' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_crypto.c' line='816' column='1'/>
      <parameter type-id='type-id-22' name='pool_props' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_crypto.c' line='817' column='1'/>
      <parameter type-id='type-id-5' name='stdin_available' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_crypto.c' line='817' column='1'/>
      <parameter type-id='type-id-118' name='wkeydata_out' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_crypto.c' line='817' column='1'/>
      <parameter type-id='type-id-120' name='wkeylen_out' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_crypto.c' line='818' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_crypto_get_encryption_root' mangled-name='zfs_crypto_get_encryption_root' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_crypto.c' line='785' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_crypto_get_encryption_root'>
      <parameter type-id='type-id-104' name='zhp' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_crypto.c' line='785' column='1'/>
      <parameter type-id='type-id-116' name='is_encroot' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_crypto.c' line='785' column='1'/>
      <parameter type-id='type-id-23' name='buf' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_crypto.c' line='786' column='1'/>
>>>>>>> c48db4d89... WIP Direct IO
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='__builtin___snprintf_chk' mangled-name='__snprintf_chk' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='zfs_name_to_prop' mangled-name='zfs_name_to_prop' filepath='../../include/sys/fs/zfs.h' line='314' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='zfs_error_aux' mangled-name='zfs_error_aux' filepath='../../include/libzfs_impl.h' line='138' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='fnvlist_alloc' mangled-name='fnvlist_alloc' filepath='../../include/sys/nvpair.h' line='276' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
>>>>>>> 28d08db2d... WIP Direct IO
    </function-decl>
<<<<<<< HEAD
    <function-decl name='zfs_valid_proplist' mangled-name='zfs_valid_proplist' filepath='../../include/libzfs.h' line='488' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='snprintf' mangled-name='snprintf' filepath='/usr/include/stdio.h' line='354' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='zfs_parent_name' mangled-name='zfs_parent_name' filepath='../../include/libzfs.h' line='814' column='1' visibility='default' binding='global' size-in-bits='64'>
<<<<<<< HEAD
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='lzc_change_key' mangled-name='lzc_change_key' filepath='../../include/libzfs_core.h' line='64' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
=======
      <return type-id='type-id-52'/>
=======
    <function-decl name='zfs_valid_proplist' mangled-name='zfs_valid_proplist' filepath='../../include/libzfs.h' line='487' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='zfs_parent_name' mangled-name='zfs_parent_name' filepath='../../include/libzfs.h' line='810' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
>>>>>>> c48db4d89... WIP Direct IO
    </function-decl>
    <function-decl name='lzc_change_key' mangled-name='lzc_change_key' filepath='../../include/libzfs_core.h' line='64' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
>>>>>>> 28d08db2d... WIP Direct IO
    </function-decl>
<<<<<<< HEAD
    <function-decl name='zfs_prop_to_name' mangled-name='zfs_prop_to_name' filepath='../../include/libzfs.h' line='491' column='1' visibility='default' binding='global' size-in-bits='64'>
<<<<<<< HEAD
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='nvlist_lookup_uint64' mangled-name='nvlist_lookup_uint64' filepath='../../include/sys/nvpair.h' line='212' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='nvlist_lookup_string' mangled-name='nvlist_lookup_string' filepath='../../include/sys/nvpair.h' line='213' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='nvlist_add_uint64' mangled-name='nvlist_add_uint64' filepath='../../include/sys/nvpair.h' line='178' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='nvlist_add_string' mangled-name='nvlist_add_string' filepath='../../include/sys/nvpair.h' line='179' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='lzc_unload_key' mangled-name='lzc_unload_key' filepath='../../include/libzfs_core.h' line='63' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='lzc_load_key' mangled-name='lzc_load_key' filepath='../../include/libzfs_core.h' line='62' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
=======
      <return type-id='type-id-52'/>
=======
    <function-decl name='zfs_prop_to_name' mangled-name='zfs_prop_to_name' filepath='../../include/libzfs.h' line='490' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
>>>>>>> c48db4d89... WIP Direct IO
    </function-decl>
    <function-decl name='nvlist_lookup_uint64' mangled-name='nvlist_lookup_uint64' filepath='../../include/sys/nvpair.h' line='212' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvlist_lookup_string' mangled-name='nvlist_lookup_string' filepath='../../include/sys/nvpair.h' line='213' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvlist_add_uint64' mangled-name='nvlist_add_uint64' filepath='../../include/sys/nvpair.h' line='178' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvlist_add_string' mangled-name='nvlist_add_string' filepath='../../include/sys/nvpair.h' line='179' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='lzc_unload_key' mangled-name='lzc_unload_key' filepath='../../include/libzfs_core.h' line='63' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='lzc_load_key' mangled-name='lzc_load_key' filepath='../../include/libzfs_core.h' line='62' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
>>>>>>> 28d08db2d... WIP Direct IO
    </function-decl>
<<<<<<< HEAD
    <function-decl name='zfs_handle_dup' mangled-name='zfs_handle_dup' filepath='../../include/libzfs.h' line='468' column='1' visibility='default' binding='global' size-in-bits='64'>
<<<<<<< HEAD
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='printf' mangled-name='printf' filepath='/usr/include/stdio.h' line='332' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
=======
      <return type-id='type-id-52'/>
=======
    <function-decl name='__printf_chk' mangled-name='__printf_chk' filepath='/usr/include/x86_64-linux-gnu/bits/stdio2.h' line='90' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
>>>>>>> c48db4d89... WIP Direct IO
    </function-decl>
    <function-decl name='zfs_handle_dup' mangled-name='zfs_handle_dup' filepath='../../include/libzfs.h' line='467' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
>>>>>>> 28d08db2d... WIP Direct IO
    </function-decl>
<<<<<<< HEAD
    <function-decl name='zfs_iter_filesystems' mangled-name='zfs_iter_filesystems' filepath='../../include/libzfs.h' line='616' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='calloc' mangled-name='calloc' filepath='/usr/include/stdlib.h' line='541' column='1' visibility='default' binding='global' size-in-bits='64'>
<<<<<<< HEAD
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='__builtin_memcpy' mangled-name='memcpy' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='regexec' mangled-name='regexec' filepath='/usr/include/regex.h' line='643' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='fileno' mangled-name='fileno' filepath='/usr/include/stdio.h' line='792' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='isatty' mangled-name='isatty' filepath='/usr/include/unistd.h' line='779' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='__getdelim' mangled-name='__getdelim' filepath='/usr/include/stdio.h' line='609' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='sigemptyset' mangled-name='sigemptyset' filepath='/usr/include/signal.h' line='196' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='sigaction' mangled-name='sigaction' filepath='/usr/include/signal.h' line='240' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='fputc' mangled-name='fputc' filepath='/usr/include/stdio.h' line='527' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='fflush' mangled-name='fflush' filepath='/usr/include/stdio.h' line='218' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='tcgetattr' mangled-name='tcgetattr' filepath='/usr/include/termios.h' line='66' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='tcsetattr' mangled-name='tcsetattr' filepath='/usr/include/termios.h' line='70' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='__builtin_putchar' mangled-name='putchar' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='getpid' mangled-name='getpid' filepath='/usr/include/unistd.h' line='628' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='kill' mangled-name='kill' filepath='/usr/include/signal.h' line='112' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='__ctype_b_loc' mangled-name='__ctype_b_loc' filepath='/usr/include/ctype.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
=======
      <return type-id='type-id-52'/>
=======
    <function-decl name='zfs_iter_filesystems' mangled-name='zfs_iter_filesystems' filepath='../../include/libzfs.h' line='615' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='__open_alias' mangled-name='open64' filepath='/usr/include/x86_64-linux-gnu/bits/fcntl2.h' line='32' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='__read_alias' mangled-name='read' filepath='/usr/include/x86_64-linux-gnu/bits/unistd.h' line='25' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='close' mangled-name='close' filepath='/usr/include/unistd.h' line='353' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
>>>>>>> c48db4d89... WIP Direct IO
    </function-decl>
    <function-decl name='__builtin_memcpy' mangled-name='memcpy' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='calloc' mangled-name='calloc' filepath='/usr/include/stdlib.h' line='542' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='regexec' mangled-name='regexec' filepath='/usr/include/regex.h' line='643' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='fileno' mangled-name='fileno' filepath='/usr/include/stdio.h' line='786' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='isatty' mangled-name='isatty' filepath='/usr/include/unistd.h' line='779' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='__builtin_putchar' mangled-name='putchar' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='__getdelim' mangled-name='__getdelim' filepath='/usr/include/stdio.h' line='603' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='sigemptyset' mangled-name='sigemptyset' filepath='/usr/include/signal.h' line='196' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='sigaction' mangled-name='sigaction' filepath='/usr/include/signal.h' line='240' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='fputc' mangled-name='fputc' filepath='/usr/include/stdio.h' line='521' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='fflush' mangled-name='fflush' filepath='/usr/include/stdio.h' line='218' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='tcgetattr' mangled-name='tcgetattr' filepath='/usr/include/termios.h' line='66' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='tcsetattr' mangled-name='tcsetattr' filepath='/usr/include/termios.h' line='70' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='getpid' mangled-name='getpid' filepath='/usr/include/unistd.h' line='628' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='kill' mangled-name='kill' filepath='/usr/include/signal.h' line='112' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='__ctype_b_loc' mangled-name='__ctype_b_loc' filepath='/usr/include/ctype.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
>>>>>>> 28d08db2d... WIP Direct IO
    </function-decl>
<<<<<<< HEAD
    <function-decl name='zpool_get_features' mangled-name='zpool_get_features' filepath='../../include/libzfs.h' line='413' column='1' visibility='default' binding='global' size-in-bits='64'>
<<<<<<< HEAD
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='zpool_get_prop_int' mangled-name='zpool_get_prop_int' filepath='../../include/libzfs.h' line='329' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='malloc' mangled-name='malloc' filepath='/usr/include/stdlib.h' line='539' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='fread' mangled-name='fread' filepath='/usr/include/stdio.h' line='652' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='ferror' mangled-name='ferror' filepath='/usr/include/stdio.h' line='767' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='fopen' mangled-name='fopen64' filepath='/usr/include/stdio.h' line='257' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='fclose' mangled-name='fclose' filepath='/usr/include/stdio.h' line='213' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='sscanf' mangled-name='sscanf' filepath='/usr/include/stdio.h' line='399' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='__builtin_memmove' mangled-name='memmove' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='PKCS5_PBKDF2_HMAC_SHA1' mangled-name='PKCS5_PBKDF2_HMAC_SHA1' filepath='/usr/include/openssl/evp.h' line='1087' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
=======
      <return type-id='type-id-52'/>
=======
    <function-decl name='zpool_get_features' mangled-name='zpool_get_features' filepath='../../include/libzfs.h' line='412' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
>>>>>>> c48db4d89... WIP Direct IO
    </function-decl>
    <function-decl name='zpool_get_prop_int' mangled-name='zpool_get_prop_int' filepath='../../include/libzfs.h' line='329' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='__fread_alias' mangled-name='fread' filepath='/usr/include/x86_64-linux-gnu/bits/stdio2.h' line='271' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='malloc' mangled-name='malloc' filepath='/usr/include/stdlib.h' line='539' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='ferror' mangled-name='ferror' filepath='/usr/include/stdio.h' line='761' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='fopen' mangled-name='fopen64' filepath='/usr/include/stdio.h' line='257' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='fclose' mangled-name='fclose' filepath='/usr/include/stdio.h' line='213' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='sscanf' mangled-name='__isoc99_sscanf' filepath='/usr/include/stdio.h' line='412' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='__builtin_memmove' mangled-name='memmove' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='PKCS5_PBKDF2_HMAC_SHA1' mangled-name='PKCS5_PBKDF2_HMAC_SHA1' filepath='/usr/include/openssl/evp.h' line='1087' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='__builtin_strcpy' mangled-name='strcpy' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-51'/>
>>>>>>> 28d08db2d... WIP Direct IO
    </function-decl>
    <function-decl name='read' mangled-name='read' filepath='/usr/include/unistd.h' line='360' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='open' mangled-name='open64' filepath='/usr/include/fcntl.h' line='171' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='close' mangled-name='close' filepath='/usr/include/unistd.h' line='353' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-67'/>
    </function-decl>
  </abi-instr>
<<<<<<< HEAD
  <abi-instr version='1.0' address-size='64' path='libzfs_dataset.c' comp-dir-path='/home/nabijaczleweli/store/code/zfs/lib/libzfs' language='LANG_C99'>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='../../include/sys/fs/zfs.h' line='1439' column='1' id='type-id-101'>
=======
<<<<<<< HEAD
  <abi-instr version='1.0' address-size='64' path='libzfs_dataset.c' comp-dir-path='/home/colm/src/zfs/zfs/lib/libzfs' language='LANG_C99'>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='../../include/sys/fs/zfs.h' line='1439' column='1' id='type-id-119'>
=======
  <abi-instr version='1.0' address-size='64' path='libzfs_dataset.c' comp-dir-path='/home/behlendo/src/git/zfs/lib/libzfs' language='LANG_C99'>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='../../include/sys/fs/zfs.h' line='1446' column='1' id='type-id-121'>
>>>>>>> c48db4d89... WIP Direct IO
>>>>>>> 28d08db2d... WIP Direct IO
      <underlying-type type-id='type-id-7'/>
      <enumerator name='ZFS_WAIT_DELETEQ' value='0'/>
      <enumerator name='ZFS_WAIT_NUM_ACTIVITIES' value='1'/>
    </enum-decl>
<<<<<<< HEAD
    <typedef-decl name='zfs_wait_activity_t' type-id='type-id-101' filepath='../../include/sys/fs/zfs.h' line='1442' column='1' id='type-id-102'/>
    <function-decl name='zfs_wait_status' mangled-name='zfs_wait_status' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='5546' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_wait_status'>
      <parameter type-id='type-id-84' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='5546' column='1'/>
      <parameter type-id='type-id-102' name='activity' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='5546' column='1'/>
      <parameter type-id='type-id-96' name='missing' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='5547' column='1'/>
      <parameter type-id='type-id-96' name='waited' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='5547' column='1'/>
=======
<<<<<<< HEAD
    <typedef-decl name='zfs_wait_activity_t' type-id='type-id-119' filepath='../../include/sys/fs/zfs.h' line='1442' column='1' id='type-id-120'/>
    <function-decl name='zfs_wait_status' mangled-name='zfs_wait_status' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='5546' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_wait_status'>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='5546' column='1'/>
      <parameter type-id='type-id-120' name='activity' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='5546' column='1'/>
      <parameter type-id='type-id-114' name='missing' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='5547' column='1'/>
      <parameter type-id='type-id-114' name='waited' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='5547' column='1'/>
>>>>>>> 28d08db2d... WIP Direct IO
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zvol_volsize_to_reservation' mangled-name='zvol_volsize_to_reservation' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='5490' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zvol_volsize_to_reservation'>
      <parameter type-id='type-id-18' name='zph' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='5490' column='1'/>
      <parameter type-id='type-id-26' name='volsize' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='5490' column='1'/>
      <parameter type-id='type-id-22' name='props' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='5491' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='zfs_get_holds' mangled-name='zfs_get_holds' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='5232' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_holds'>
      <parameter type-id='type-id-84' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='5232' column='1'/>
      <parameter type-id='type-id-97' name='nvl' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='5232' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_set_fsacl' mangled-name='zfs_set_fsacl' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='5178' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_set_fsacl'>
      <parameter type-id='type-id-84' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='5178' column='1'/>
      <parameter type-id='type-id-5' name='un' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='5178' column='1'/>
      <parameter type-id='type-id-22' name='nvl' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='5178' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_get_fsacl' mangled-name='zfs_get_fsacl' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='5111' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_fsacl'>
      <parameter type-id='type-id-84' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='5111' column='1'/>
      <parameter type-id='type-id-97' name='nvl' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='5111' column='1'/>
      <return type-id='type-id-6'/>
>>>>>>> 9592cab4e... WIP Direct IO
    </function-decl>
    <pointer-type-def type-id='type-id-28' size-in-bits='64' id='type-id-113'/>
    <function-decl name='zpool_get_config' mangled-name='zpool_get_config' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_config.c' line='220' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_get_config'>
      <parameter type-id='type-id-24' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_config.c' line='220' column='1'/>
      <parameter type-id='type-id-113' name='oldconfig' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_config.c' line='220' column='1'/>
      <return type-id='type-id-28'/>
>>>>>>> 41ceb90a6... WIP Direct IO
    </function-decl>
    <function-decl name='zpool_get_features' mangled-name='zpool_get_features' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_get_features'>
      <parameter type-id='type-id-11' name='zhp'/>
      <return type-id='type-id-15'/>
    </function-decl>
<<<<<<< HEAD
    <function-decl name='nvlist_exists' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-84'/>
      <return type-id='type-id-50'/>
=======
<<<<<<< HEAD
    <function-decl name='nvlist_exists' filepath='../../include/sys/nvpair.h' line='238' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-112'/>
      <parameter type-id='type-id-89'/>
      <return type-id='type-id-13'/>
>>>>>>> 41ceb90a6... WIP Direct IO
    </function-decl>
    <pointer-type-def type-id='type-id-16' size-in-bits='64' id='type-id-106'/>
    <function-decl name='zpool_refresh_stats' mangled-name='zpool_refresh_stats' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_refresh_stats'>
      <parameter type-id='type-id-11' name='zhp'/>
      <parameter type-id='type-id-106' name='missing'/>
      <return type-id='type-id-8'/>
    </function-decl>
<<<<<<< HEAD
    <pointer-type-def type-id='type-id-104' size-in-bits='64' id='type-id-107'/>
    <function-decl name='nvlist_lookup_nvlist' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-107'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <class-decl name='zfs_cmd' size-in-bits='109952' is-struct='yes' visibility='default' id='type-id-108'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zc_name' type-id='type-id-109' visibility='default'/>
=======
    <pointer-type-def type-id='type-id-112' size-in-bits='64' id='type-id-115'/>
    <function-decl name='nvlist_lookup_nvlist' filepath='../../include/sys/nvpair.h' line='214' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-112'/>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-115'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <class-decl name='zfs_cmd' size-in-bits='109952' is-struct='yes' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='477' column='1' id='type-id-116'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zc_name' type-id='type-id-117' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='478' column='1'/>
=======
<<<<<<< HEAD
    <function-decl name='zfs_hold' mangled-name='zfs_hold' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4899' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_hold'>
      <parameter type-id='type-id-84' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4899' column='1'/>
      <parameter type-id='type-id-86' name='snapname' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4899' column='1'/>
      <parameter type-id='type-id-86' name='tag' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4899' column='1'/>
      <parameter type-id='type-id-5' name='recursive' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4900' column='1'/>
      <parameter type-id='type-id-6' name='cleanup_fd' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4900' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='../../include/sys/fs/zfs.h' line='192' column='1' id='type-id-103'>
=======
    <function-decl name='zfs_hold' mangled-name='zfs_hold' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4899' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_hold'>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4899' column='1'/>
      <parameter type-id='type-id-104' name='snapname' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4899' column='1'/>
      <parameter type-id='type-id-104' name='tag' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4899' column='1'/>
      <parameter type-id='type-id-5' name='recursive' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4900' column='1'/>
      <parameter type-id='type-id-6' name='cleanup_fd' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4900' column='1'/>
=======
    <typedef-decl name='zfs_wait_activity_t' type-id='type-id-121' filepath='../../include/sys/fs/zfs.h' line='1449' column='1' id='type-id-122'/>
    <function-decl name='zfs_wait_status' mangled-name='zfs_wait_status' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='5547' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_wait_status'>
      <parameter type-id='type-id-104' name='zhp' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='5547' column='1'/>
      <parameter type-id='type-id-122' name='activity' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='5547' column='1'/>
      <parameter type-id='type-id-116' name='missing' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='5548' column='1'/>
      <parameter type-id='type-id-116' name='waited' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='5548' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zvol_volsize_to_reservation' mangled-name='zvol_volsize_to_reservation' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='5491' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zvol_volsize_to_reservation'>
      <parameter type-id='type-id-18' name='zph' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='5491' column='1'/>
      <parameter type-id='type-id-27' name='volsize' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='5491' column='1'/>
      <parameter type-id='type-id-22' name='props' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='5492' column='1'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='zfs_get_holds' mangled-name='zfs_get_holds' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='5233' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_holds'>
      <parameter type-id='type-id-104' name='zhp' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='5233' column='1'/>
      <parameter type-id='type-id-117' name='nvl' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='5233' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_set_fsacl' mangled-name='zfs_set_fsacl' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='5179' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_set_fsacl'>
      <parameter type-id='type-id-104' name='zhp' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='5179' column='1'/>
      <parameter type-id='type-id-5' name='un' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='5179' column='1'/>
      <parameter type-id='type-id-22' name='nvl' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='5179' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_get_fsacl' mangled-name='zfs_get_fsacl' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='5112' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_fsacl'>
      <parameter type-id='type-id-104' name='zhp' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='5112' column='1'/>
      <parameter type-id='type-id-117' name='nvl' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='5112' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_release' mangled-name='zfs_release' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='5031' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_release'>
      <parameter type-id='type-id-104' name='zhp' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='5031' column='1'/>
      <parameter type-id='type-id-106' name='snapname' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='5031' column='1'/>
      <parameter type-id='type-id-106' name='tag' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='5031' column='1'/>
      <parameter type-id='type-id-5' name='recursive' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='5032' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_hold_nvl' mangled-name='zfs_hold_nvl' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='4932' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_hold_nvl'>
      <parameter type-id='type-id-104' name='zhp' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='4932' column='1'/>
      <parameter type-id='type-id-6' name='cleanup_fd' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='4932' column='1'/>
      <parameter type-id='type-id-22' name='holds' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='4932' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_hold' mangled-name='zfs_hold' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='4900' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_hold'>
      <parameter type-id='type-id-104' name='zhp' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='4900' column='1'/>
      <parameter type-id='type-id-106' name='snapname' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='4900' column='1'/>
      <parameter type-id='type-id-106' name='tag' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='4900' column='1'/>
      <parameter type-id='type-id-5' name='recursive' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='4901' column='1'/>
      <parameter type-id='type-id-6' name='cleanup_fd' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='4901' column='1'/>
>>>>>>> c48db4d89... WIP Direct IO
      <return type-id='type-id-6'/>
    </function-decl>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='../../include/sys/fs/zfs.h' line='193' column='1' id='type-id-123'>
>>>>>>> 28d08db2d... WIP Direct IO
      <underlying-type type-id='type-id-7'/>
      <enumerator name='ZFS_PROP_USERUSED' value='0'/>
      <enumerator name='ZFS_PROP_USERQUOTA' value='1'/>
      <enumerator name='ZFS_PROP_GROUPUSED' value='2'/>
      <enumerator name='ZFS_PROP_GROUPQUOTA' value='3'/>
      <enumerator name='ZFS_PROP_USEROBJUSED' value='4'/>
      <enumerator name='ZFS_PROP_USEROBJQUOTA' value='5'/>
      <enumerator name='ZFS_PROP_GROUPOBJUSED' value='6'/>
      <enumerator name='ZFS_PROP_GROUPOBJQUOTA' value='7'/>
      <enumerator name='ZFS_PROP_PROJECTUSED' value='8'/>
      <enumerator name='ZFS_PROP_PROJECTQUOTA' value='9'/>
      <enumerator name='ZFS_PROP_PROJECTOBJUSED' value='10'/>
      <enumerator name='ZFS_PROP_PROJECTOBJQUOTA' value='11'/>
      <enumerator name='ZFS_NUM_USERQUOTA_PROPS' value='12'/>
    </enum-decl>
<<<<<<< HEAD
    <typedef-decl name='zfs_userquota_prop_t' type-id='type-id-103' filepath='../../include/sys/fs/zfs.h' line='206' column='1' id='type-id-104'/>
    <typedef-decl name='__uid_t' type-id='type-id-43' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='144' column='1' id='type-id-105'/>
    <typedef-decl name='uid_t' type-id='type-id-105' filepath='/usr/include/x86_64-linux-gnu/sys/types.h' line='79' column='1' id='type-id-106'/>
    <pointer-type-def type-id='type-id-107' size-in-bits='64' id='type-id-108'/>
    <typedef-decl name='zfs_userspace_cb_t' type-id='type-id-108' filepath='../../include/libzfs.h' line='738' column='1' id='type-id-109'/>
    <function-decl name='zfs_userspace' mangled-name='zfs_userspace' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4819' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_userspace'>
      <parameter type-id='type-id-84' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4819' column='1'/>
      <parameter type-id='type-id-104' name='type' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4819' column='1'/>
      <parameter type-id='type-id-109' name='func' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4820' column='1'/>
      <parameter type-id='type-id-68' name='arg' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4820' column='1'/>
=======
<<<<<<< HEAD
    <typedef-decl name='zfs_userquota_prop_t' type-id='type-id-121' filepath='../../include/sys/fs/zfs.h' line='206' column='1' id='type-id-122'/>
    <typedef-decl name='__uid_t' type-id='type-id-64' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='144' column='1' id='type-id-123'/>
    <typedef-decl name='uid_t' type-id='type-id-123' filepath='/usr/include/x86_64-linux-gnu/sys/types.h' line='79' column='1' id='type-id-124'/>
    <pointer-type-def type-id='type-id-125' size-in-bits='64' id='type-id-126'/>
    <typedef-decl name='zfs_userspace_cb_t' type-id='type-id-126' filepath='../../include/libzfs.h' line='738' column='1' id='type-id-127'/>
    <function-decl name='zfs_userspace' mangled-name='zfs_userspace' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4819' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_userspace'>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4819' column='1'/>
      <parameter type-id='type-id-122' name='type' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4819' column='1'/>
      <parameter type-id='type-id-127' name='func' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4820' column='1'/>
      <parameter type-id='type-id-42' name='arg' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4820' column='1'/>
>>>>>>> 28d08db2d... WIP Direct IO
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_smb_acl_rename' mangled-name='zfs_smb_acl_rename' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4811' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_smb_acl_rename'>
      <parameter type-id='type-id-17' name='hdl' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4811' column='1'/>
      <parameter type-id='type-id-23' name='dataset' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4811' column='1'/>
      <parameter type-id='type-id-23' name='path' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4811' column='1'/>
      <parameter type-id='type-id-23' name='oldname' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4812' column='1'/>
      <parameter type-id='type-id-23' name='newname' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4812' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_smb_acl_purge' mangled-name='zfs_smb_acl_purge' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4804' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_smb_acl_purge'>
      <parameter type-id='type-id-17' name='hdl' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4804' column='1'/>
      <parameter type-id='type-id-23' name='dataset' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4804' column='1'/>
      <parameter type-id='type-id-23' name='path' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4804' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_smb_acl_remove' mangled-name='zfs_smb_acl_remove' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4796' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_smb_acl_remove'>
      <parameter type-id='type-id-17' name='hdl' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4796' column='1'/>
      <parameter type-id='type-id-23' name='dataset' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4796' column='1'/>
      <parameter type-id='type-id-23' name='path' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4797' column='1'/>
      <parameter type-id='type-id-23' name='resource' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4797' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_smb_acl_add' mangled-name='zfs_smb_acl_add' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4788' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_smb_acl_add'>
      <parameter type-id='type-id-17' name='hdl' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4796' column='1'/>
      <parameter type-id='type-id-23' name='dataset' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4796' column='1'/>
      <parameter type-id='type-id-23' name='path' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4797' column='1'/>
      <parameter type-id='type-id-23' name='resource' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4797' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_prune_proplist' mangled-name='zfs_prune_proplist' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4706' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prune_proplist'>
      <parameter type-id='type-id-84' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4706' column='1'/>
      <parameter type-id='type-id-24' name='props' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4706' column='1'/>
      <return type-id='type-id-67'/>
    </function-decl>
<<<<<<< HEAD
    <class-decl name='zprop_list' size-in-bits='448' is-struct='yes' visibility='default' filepath='../../include/libzfs.h' line='536' column='1' id='type-id-110'>
=======
    <class-decl name='zprop_list' size-in-bits='448' is-struct='yes' visibility='default' filepath='../../include/libzfs.h' line='536' column='1' id='type-id-128'>
=======
    <typedef-decl name='zfs_userquota_prop_t' type-id='type-id-123' filepath='../../include/sys/fs/zfs.h' line='207' column='1' id='type-id-124'/>
    <typedef-decl name='__uid_t' type-id='type-id-66' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='146' column='1' id='type-id-125'/>
    <typedef-decl name='uid_t' type-id='type-id-125' filepath='/usr/include/x86_64-linux-gnu/sys/types.h' line='79' column='1' id='type-id-126'/>
    <pointer-type-def type-id='type-id-127' size-in-bits='64' id='type-id-128'/>
    <typedef-decl name='zfs_userspace_cb_t' type-id='type-id-128' filepath='../../include/libzfs.h' line='734' column='1' id='type-id-129'/>
    <function-decl name='zfs_userspace' mangled-name='zfs_userspace' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='4820' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_userspace'>
      <parameter type-id='type-id-104' name='zhp' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='4820' column='1'/>
      <parameter type-id='type-id-124' name='type' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='4820' column='1'/>
      <parameter type-id='type-id-129' name='func' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='4821' column='1'/>
      <parameter type-id='type-id-43' name='arg' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='4821' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_smb_acl_rename' mangled-name='zfs_smb_acl_rename' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='4812' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_smb_acl_rename'>
      <parameter type-id='type-id-17' name='hdl' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='4812' column='1'/>
      <parameter type-id='type-id-23' name='dataset' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='4812' column='1'/>
      <parameter type-id='type-id-23' name='path' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='4812' column='1'/>
      <parameter type-id='type-id-23' name='oldname' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='4813' column='1'/>
      <parameter type-id='type-id-23' name='newname' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='4813' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_smb_acl_purge' mangled-name='zfs_smb_acl_purge' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='4805' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_smb_acl_purge'>
      <parameter type-id='type-id-17' name='hdl' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='4805' column='1'/>
      <parameter type-id='type-id-23' name='dataset' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='4805' column='1'/>
      <parameter type-id='type-id-23' name='path' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='4805' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_smb_acl_remove' mangled-name='zfs_smb_acl_remove' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='4797' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_smb_acl_remove'>
      <parameter type-id='type-id-17' name='hdl' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='4797' column='1'/>
      <parameter type-id='type-id-23' name='dataset' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='4797' column='1'/>
      <parameter type-id='type-id-23' name='path' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='4798' column='1'/>
      <parameter type-id='type-id-23' name='resource' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='4798' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_smb_acl_add' mangled-name='zfs_smb_acl_add' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='4789' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_smb_acl_add'>
      <parameter type-id='type-id-17' name='hdl' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='4797' column='1'/>
      <parameter type-id='type-id-23' name='dataset' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='4797' column='1'/>
      <parameter type-id='type-id-23' name='path' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='4798' column='1'/>
      <parameter type-id='type-id-23' name='resource' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='4798' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_prune_proplist' mangled-name='zfs_prune_proplist' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='4707' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prune_proplist'>
      <parameter type-id='type-id-104' name='zhp' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='4707' column='1'/>
      <parameter type-id='type-id-24' name='props' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='4707' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <class-decl name='zprop_list' size-in-bits='448' is-struct='yes' visibility='default' filepath='../../include/libzfs.h' line='535' column='1' id='type-id-130'>
>>>>>>> c48db4d89... WIP Direct IO
>>>>>>> 28d08db2d... WIP Direct IO
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pl_prop' type-id='type-id-6' visibility='default' filepath='../../include/libzfs.h' line='537' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pl_user_prop' type-id='type-id-23' visibility='default' filepath='../../include/libzfs.h' line='538' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
<<<<<<< HEAD
        <var-decl name='pl_next' type-id='type-id-111' visibility='default' filepath='../../include/libzfs.h' line='539' column='1'/>
=======
<<<<<<< HEAD
        <var-decl name='pl_next' type-id='type-id-129' visibility='default' filepath='../../include/libzfs.h' line='539' column='1'/>
=======
        <var-decl name='pl_next' type-id='type-id-131' visibility='default' filepath='../../include/libzfs.h' line='538' column='1'/>
>>>>>>> c48db4d89... WIP Direct IO
>>>>>>> 28d08db2d... WIP Direct IO
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='pl_all' type-id='type-id-5' visibility='default' filepath='../../include/libzfs.h' line='540' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
<<<<<<< HEAD
        <var-decl name='pl_width' type-id='type-id-32' visibility='default' filepath='../../include/libzfs.h' line='541' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='pl_recvd_width' type-id='type-id-32' visibility='default' filepath='../../include/libzfs.h' line='542' column='1'/>
=======
<<<<<<< HEAD
        <var-decl name='pl_width' type-id='type-id-43' visibility='default' filepath='../../include/libzfs.h' line='541' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='pl_recvd_width' type-id='type-id-43' visibility='default' filepath='../../include/libzfs.h' line='542' column='1'/>
=======
        <var-decl name='pl_width' type-id='type-id-44' visibility='default' filepath='../../include/libzfs.h' line='540' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='pl_recvd_width' type-id='type-id-44' visibility='default' filepath='../../include/libzfs.h' line='541' column='1'/>
>>>>>>> c48db4d89... WIP Direct IO
>>>>>>> 28d08db2d... WIP Direct IO
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='pl_fixed' type-id='type-id-5' visibility='default' filepath='../../include/libzfs.h' line='543' column='1'/>
      </data-member>
    </class-decl>
<<<<<<< HEAD
    <pointer-type-def type-id='type-id-110' size-in-bits='64' id='type-id-111'/>
    <typedef-decl name='zprop_list_t' type-id='type-id-110' filepath='../../include/libzfs.h' line='544' column='1' id='type-id-112'/>
    <pointer-type-def type-id='type-id-112' size-in-bits='64' id='type-id-113'/>
    <pointer-type-def type-id='type-id-113' size-in-bits='64' id='type-id-114'/>
    <function-decl name='zfs_expand_proplist' mangled-name='zfs_expand_proplist' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4609' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_expand_proplist'>
      <parameter type-id='type-id-84' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4609' column='1'/>
      <parameter type-id='type-id-114' name='plp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4609' column='1'/>
      <parameter type-id='type-id-5' name='received' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4609' column='1'/>
      <parameter type-id='type-id-5' name='literal' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4610' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_get_user_props' mangled-name='zfs_get_user_props' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4590' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_user_props'>
      <parameter type-id='type-id-84' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4590' column='1'/>
=======
<<<<<<< HEAD
    <pointer-type-def type-id='type-id-128' size-in-bits='64' id='type-id-129'/>
    <typedef-decl name='zprop_list_t' type-id='type-id-128' filepath='../../include/libzfs.h' line='544' column='1' id='type-id-130'/>
    <pointer-type-def type-id='type-id-130' size-in-bits='64' id='type-id-131'/>
    <pointer-type-def type-id='type-id-131' size-in-bits='64' id='type-id-132'/>
    <function-decl name='zfs_expand_proplist' mangled-name='zfs_expand_proplist' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4609' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_expand_proplist'>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4609' column='1'/>
      <parameter type-id='type-id-132' name='plp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4609' column='1'/>
      <parameter type-id='type-id-5' name='received' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4609' column='1'/>
      <parameter type-id='type-id-5' name='literal' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4610' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_get_user_props' mangled-name='zfs_get_user_props' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4590' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_user_props'>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4590' column='1'/>
>>>>>>> 28d08db2d... WIP Direct IO
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_get_recvd_props' mangled-name='zfs_get_recvd_props' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4581' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_recvd_props'>
      <parameter type-id='type-id-84' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4581' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_get_all_props' mangled-name='zfs_get_all_props' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4575' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_all_props'>
      <parameter type-id='type-id-84' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4590' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
<<<<<<< HEAD
    <class-decl name='renameflags' size-in-bits='32' is-struct='yes' visibility='default' filepath='../../include/libzfs.h' line='650' column='1' id='type-id-115'>
=======
    <class-decl name='renameflags' size-in-bits='32' is-struct='yes' visibility='default' filepath='../../include/libzfs.h' line='650' column='1' id='type-id-133'>
=======
    <pointer-type-def type-id='type-id-130' size-in-bits='64' id='type-id-131'/>
    <typedef-decl name='zprop_list_t' type-id='type-id-130' filepath='../../include/libzfs.h' line='543' column='1' id='type-id-132'/>
    <pointer-type-def type-id='type-id-132' size-in-bits='64' id='type-id-133'/>
    <pointer-type-def type-id='type-id-133' size-in-bits='64' id='type-id-134'/>
    <function-decl name='zfs_expand_proplist' mangled-name='zfs_expand_proplist' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='4610' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_expand_proplist'>
      <parameter type-id='type-id-104' name='zhp' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='4610' column='1'/>
      <parameter type-id='type-id-134' name='plp' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='4610' column='1'/>
      <parameter type-id='type-id-5' name='received' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='4610' column='1'/>
      <parameter type-id='type-id-5' name='literal' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='4611' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_get_user_props' mangled-name='zfs_get_user_props' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='4591' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_user_props'>
      <parameter type-id='type-id-104' name='zhp' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='4591' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_get_recvd_props' mangled-name='zfs_get_recvd_props' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='4582' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_recvd_props'>
      <parameter type-id='type-id-104' name='zhp' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='4582' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_get_all_props' mangled-name='zfs_get_all_props' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='4576' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_all_props'>
      <parameter type-id='type-id-104' name='zhp' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='4591' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <class-decl name='renameflags' size-in-bits='32' is-struct='yes' visibility='default' filepath='../../include/libzfs.h' line='649' column='1' id='type-id-135'>
>>>>>>> c48db4d89... WIP Direct IO
>>>>>>> 28d08db2d... WIP Direct IO
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='recursive' type-id='type-id-6' visibility='default' filepath='../../include/libzfs.h' line='652' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30'>
        <var-decl name='nounmount' type-id='type-id-6' visibility='default' filepath='../../include/libzfs.h' line='655' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='29'>
        <var-decl name='forceunmount' type-id='type-id-6' visibility='default' filepath='../../include/libzfs.h' line='658' column='1'/>
      </data-member>
    </class-decl>
<<<<<<< HEAD
    <typedef-decl name='renameflags_t' type-id='type-id-115' filepath='../../include/libzfs.h' line='659' column='1' id='type-id-116'/>
    <function-decl name='zfs_rename' mangled-name='zfs_rename' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4373' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_rename'>
      <parameter type-id='type-id-84' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4373' column='1'/>
      <parameter type-id='type-id-86' name='target' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4373' column='1'/>
      <parameter type-id='type-id-116' name='flags' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4373' column='1'/>
=======
<<<<<<< HEAD
    <typedef-decl name='renameflags_t' type-id='type-id-133' filepath='../../include/libzfs.h' line='659' column='1' id='type-id-134'/>
    <function-decl name='zfs_rename' mangled-name='zfs_rename' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4373' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_rename'>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4373' column='1'/>
      <parameter type-id='type-id-104' name='target' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4373' column='1'/>
      <parameter type-id='type-id-134' name='flags' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4373' column='1'/>
>>>>>>> 28d08db2d... WIP Direct IO
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_rollback' mangled-name='zfs_rollback' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4273' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_rollback'>
      <parameter type-id='type-id-84' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4273' column='1'/>
      <parameter type-id='type-id-84' name='snap' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4273' column='1'/>
      <parameter type-id='type-id-5' name='force' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4273' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_snapshot' mangled-name='zfs_snapshot' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4172' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_snapshot'>
      <parameter type-id='type-id-17' name='hdl' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4172' column='1'/>
      <parameter type-id='type-id-86' name='path' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4172' column='1'/>
      <parameter type-id='type-id-5' name='recursive' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4172' column='1'/>
      <parameter type-id='type-id-22' name='props' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4173' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_snapshot_nvl' mangled-name='zfs_snapshot_nvl' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4092' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_snapshot_nvl'>
      <parameter type-id='type-id-17' name='hdl' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4092' column='1'/>
      <parameter type-id='type-id-22' name='snaps' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4092' column='1'/>
      <parameter type-id='type-id-22' name='props' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4092' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_promote' mangled-name='zfs_promote' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4008' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_promote'>
      <parameter type-id='type-id-84' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4008' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_clone' mangled-name='zfs_clone' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3922' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_clone'>
      <parameter type-id='type-id-84' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3922' column='1'/>
      <parameter type-id='type-id-86' name='target' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3922' column='1'/>
      <parameter type-id='type-id-22' name='props' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3922' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_destroy_snaps_nvl' mangled-name='zfs_destroy_snaps_nvl' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3875' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_destroy_snaps_nvl'>
      <parameter type-id='type-id-17' name='hdl' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3875' column='1'/>
      <parameter type-id='type-id-22' name='snaps' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3875' column='1'/>
      <parameter type-id='type-id-5' name='defer' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3875' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_destroy_snaps' mangled-name='zfs_destroy_snaps' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3851' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_destroy_snaps'>
      <parameter type-id='type-id-84' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3851' column='1'/>
      <parameter type-id='type-id-23' name='snapname' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3851' column='1'/>
      <parameter type-id='type-id-5' name='defer' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3851' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_destroy' mangled-name='zfs_destroy' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3783' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_destroy'>
      <parameter type-id='type-id-84' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3783' column='1'/>
      <parameter type-id='type-id-5' name='defer' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3783' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_create' mangled-name='zfs_create' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3608' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_create'>
      <parameter type-id='type-id-17' name='hdl' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3608' column='1'/>
      <parameter type-id='type-id-86' name='path' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3608' column='1'/>
      <parameter type-id='type-id-20' name='type' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3608' column='1'/>
      <parameter type-id='type-id-22' name='props' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3609' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_create_ancestors' mangled-name='zfs_create_ancestors' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3571' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_create_ancestors'>
      <parameter type-id='type-id-17' name='hdl' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3571' column='1'/>
      <parameter type-id='type-id-86' name='path' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3571' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='create_parents' mangled-name='create_parents' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3497' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='create_parents'>
      <parameter type-id='type-id-17' name='hdl' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3497' column='1'/>
      <parameter type-id='type-id-23' name='target' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3497' column='1'/>
      <parameter type-id='type-id-6' name='prefixlen' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3497' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_parent_name' mangled-name='zfs_parent_name' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3376' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_parent_name'>
      <parameter type-id='type-id-84' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3376' column='1'/>
      <parameter type-id='type-id-23' name='buf' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3376' column='1'/>
      <parameter type-id='type-id-32' name='buflen' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3376' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <qualified-type-def type-id='type-id-83' const='yes' id='type-id-117'/>
    <pointer-type-def type-id='type-id-117' size-in-bits='64' id='type-id-118'/>
    <function-decl name='zfs_get_type' mangled-name='zfs_get_type' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3330' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_type'>
      <parameter type-id='type-id-118' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3330' column='1'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='zfs_get_pool_name' mangled-name='zfs_get_pool_name' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3321' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_pool_name'>
      <parameter type-id='type-id-118' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3321' column='1'/>
      <return type-id='type-id-86'/>
    </function-decl>
    <function-decl name='zfs_get_name' mangled-name='zfs_get_name' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3312' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_name'>
      <parameter type-id='type-id-118' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3321' column='1'/>
      <return type-id='type-id-86'/>
    </function-decl>
    <function-decl name='zfs_prop_get_written' mangled-name='zfs_prop_get_written' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3287' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_written'>
      <parameter type-id='type-id-84' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3287' column='1'/>
      <parameter type-id='type-id-86' name='propname' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3287' column='1'/>
      <parameter type-id='type-id-23' name='propbuf' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3288' column='1'/>
      <parameter type-id='type-id-6' name='proplen' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3288' column='1'/>
      <parameter type-id='type-id-5' name='literal' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3288' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <pointer-type-def type-id='type-id-26' size-in-bits='64' id='type-id-119'/>
    <function-decl name='zfs_prop_get_written_int' mangled-name='zfs_prop_get_written_int' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3252' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_written_int'>
      <parameter type-id='type-id-84' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3252' column='1'/>
      <parameter type-id='type-id-86' name='propname' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3252' column='1'/>
      <parameter type-id='type-id-119' name='propvalue' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3253' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_prop_get_userquota' mangled-name='zfs_prop_get_userquota' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3216' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_userquota'>
      <parameter type-id='type-id-84' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3216' column='1'/>
      <parameter type-id='type-id-86' name='propname' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3216' column='1'/>
      <parameter type-id='type-id-23' name='propbuf' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3217' column='1'/>
      <parameter type-id='type-id-6' name='proplen' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3217' column='1'/>
      <parameter type-id='type-id-5' name='literal' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3217' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
<<<<<<< HEAD
    <function-decl name='zfs_prop_get_userquota_int' mangled-name='zfs_prop_get_userquota_int' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3206' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_userquota_int'>
      <parameter type-id='type-id-84' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3206' column='1'/>
      <parameter type-id='type-id-86' name='propname' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3206' column='1'/>
      <parameter type-id='type-id-119' name='propvalue' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3207' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='../../include/sys/fs/zfs.h' line='259' column='1' id='type-id-120'>
=======
    <function-decl name='zfs_prop_get_userquota_int' mangled-name='zfs_prop_get_userquota_int' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='3206' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_userquota_int'>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='3206' column='1'/>
      <parameter type-id='type-id-104' name='propname' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='3206' column='1'/>
      <parameter type-id='type-id-137' name='propvalue' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='3207' column='1'/>
=======
    <typedef-decl name='renameflags_t' type-id='type-id-135' filepath='../../include/libzfs.h' line='658' column='1' id='type-id-136'/>
    <function-decl name='zfs_rename' mangled-name='zfs_rename' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='4374' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_rename'>
      <parameter type-id='type-id-104' name='zhp' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='4374' column='1'/>
      <parameter type-id='type-id-106' name='target' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='4374' column='1'/>
      <parameter type-id='type-id-136' name='flags' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='4374' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_rollback' mangled-name='zfs_rollback' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='4274' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_rollback'>
      <parameter type-id='type-id-104' name='zhp' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='4274' column='1'/>
      <parameter type-id='type-id-104' name='snap' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='4274' column='1'/>
      <parameter type-id='type-id-5' name='force' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='4274' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_snapshot' mangled-name='zfs_snapshot' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='4173' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_snapshot'>
      <parameter type-id='type-id-17' name='hdl' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='4173' column='1'/>
      <parameter type-id='type-id-106' name='path' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='4173' column='1'/>
      <parameter type-id='type-id-5' name='recursive' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='4173' column='1'/>
      <parameter type-id='type-id-22' name='props' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='4174' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_snapshot_nvl' mangled-name='zfs_snapshot_nvl' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='4093' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_snapshot_nvl'>
      <parameter type-id='type-id-17' name='hdl' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='4093' column='1'/>
      <parameter type-id='type-id-22' name='snaps' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='4093' column='1'/>
      <parameter type-id='type-id-22' name='props' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='4093' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_promote' mangled-name='zfs_promote' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='4009' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_promote'>
      <parameter type-id='type-id-104' name='zhp' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='4009' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_clone' mangled-name='zfs_clone' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='3923' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_clone'>
      <parameter type-id='type-id-104' name='zhp' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='3923' column='1'/>
      <parameter type-id='type-id-106' name='target' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='3923' column='1'/>
      <parameter type-id='type-id-22' name='props' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='3923' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_destroy_snaps_nvl' mangled-name='zfs_destroy_snaps_nvl' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='3876' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_destroy_snaps_nvl'>
      <parameter type-id='type-id-17' name='hdl' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='3876' column='1'/>
      <parameter type-id='type-id-22' name='snaps' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='3876' column='1'/>
      <parameter type-id='type-id-5' name='defer' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='3876' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_destroy_snaps' mangled-name='zfs_destroy_snaps' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='3852' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_destroy_snaps'>
      <parameter type-id='type-id-104' name='zhp' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='3852' column='1'/>
      <parameter type-id='type-id-23' name='snapname' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='3852' column='1'/>
      <parameter type-id='type-id-5' name='defer' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='3852' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_destroy' mangled-name='zfs_destroy' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='3784' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_destroy'>
      <parameter type-id='type-id-104' name='zhp' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='3784' column='1'/>
      <parameter type-id='type-id-5' name='defer' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='3784' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_create' mangled-name='zfs_create' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='3609' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_create'>
      <parameter type-id='type-id-17' name='hdl' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='3609' column='1'/>
      <parameter type-id='type-id-106' name='path' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='3609' column='1'/>
      <parameter type-id='type-id-20' name='type' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='3609' column='1'/>
      <parameter type-id='type-id-22' name='props' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='3610' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_create_ancestors' mangled-name='zfs_create_ancestors' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='3572' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_create_ancestors'>
      <parameter type-id='type-id-17' name='hdl' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='3572' column='1'/>
      <parameter type-id='type-id-106' name='path' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='3572' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='create_parents' mangled-name='create_parents' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='3498' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='create_parents'>
      <parameter type-id='type-id-17' name='hdl' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='3498' column='1'/>
      <parameter type-id='type-id-23' name='target' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='3498' column='1'/>
      <parameter type-id='type-id-6' name='prefixlen' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='3498' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_parent_name' mangled-name='zfs_parent_name' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='3377' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_parent_name'>
      <parameter type-id='type-id-104' name='zhp' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='3377' column='1'/>
      <parameter type-id='type-id-23' name='buf' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='3377' column='1'/>
      <parameter type-id='type-id-44' name='buflen' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='3377' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <qualified-type-def type-id='type-id-103' const='yes' id='type-id-137'/>
    <pointer-type-def type-id='type-id-137' size-in-bits='64' id='type-id-138'/>
    <function-decl name='zfs_get_type' mangled-name='zfs_get_type' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='3331' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_type'>
      <parameter type-id='type-id-138' name='zhp' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='3331' column='1'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='zfs_get_pool_name' mangled-name='zfs_get_pool_name' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='3322' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_pool_name'>
      <parameter type-id='type-id-138' name='zhp' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='3322' column='1'/>
      <return type-id='type-id-106'/>
    </function-decl>
    <function-decl name='zfs_get_name' mangled-name='zfs_get_name' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='3313' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_name'>
      <parameter type-id='type-id-138' name='zhp' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='3322' column='1'/>
      <return type-id='type-id-106'/>
    </function-decl>
    <function-decl name='zfs_prop_get_written' mangled-name='zfs_prop_get_written' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='3288' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_written'>
      <parameter type-id='type-id-104' name='zhp' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='3288' column='1'/>
      <parameter type-id='type-id-106' name='propname' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='3288' column='1'/>
      <parameter type-id='type-id-23' name='propbuf' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='3289' column='1'/>
      <parameter type-id='type-id-6' name='proplen' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='3289' column='1'/>
      <parameter type-id='type-id-5' name='literal' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='3289' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <pointer-type-def type-id='type-id-27' size-in-bits='64' id='type-id-139'/>
    <function-decl name='zfs_prop_get_written_int' mangled-name='zfs_prop_get_written_int' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='3253' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_written_int'>
      <parameter type-id='type-id-104' name='zhp' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='3253' column='1'/>
      <parameter type-id='type-id-106' name='propname' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='3253' column='1'/>
      <parameter type-id='type-id-139' name='propvalue' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='3254' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_prop_get_userquota' mangled-name='zfs_prop_get_userquota' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='3217' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_userquota'>
      <parameter type-id='type-id-104' name='zhp' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='3217' column='1'/>
      <parameter type-id='type-id-106' name='propname' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='3217' column='1'/>
      <parameter type-id='type-id-23' name='propbuf' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='3218' column='1'/>
      <parameter type-id='type-id-6' name='proplen' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='3218' column='1'/>
      <parameter type-id='type-id-5' name='literal' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='3218' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_prop_get_userquota_int' mangled-name='zfs_prop_get_userquota_int' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='3207' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_userquota_int'>
      <parameter type-id='type-id-104' name='zhp' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='3207' column='1'/>
      <parameter type-id='type-id-106' name='propname' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='3207' column='1'/>
      <parameter type-id='type-id-139' name='propvalue' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='3208' column='1'/>
>>>>>>> c48db4d89... WIP Direct IO
      <return type-id='type-id-6'/>
    </function-decl>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='../../include/sys/fs/zfs.h' line='260' column='1' id='type-id-140'>
>>>>>>> 28d08db2d... WIP Direct IO
      <underlying-type type-id='type-id-7'/>
      <enumerator name='ZPROP_SRC_NONE' value='1'/>
      <enumerator name='ZPROP_SRC_DEFAULT' value='2'/>
      <enumerator name='ZPROP_SRC_TEMPORARY' value='4'/>
      <enumerator name='ZPROP_SRC_LOCAL' value='8'/>
      <enumerator name='ZPROP_SRC_INHERITED' value='16'/>
      <enumerator name='ZPROP_SRC_RECEIVED' value='32'/>
    </enum-decl>
<<<<<<< HEAD
    <typedef-decl name='zprop_source_t' type-id='type-id-120' filepath='../../include/sys/fs/zfs.h' line='266' column='1' id='type-id-121'/>
    <pointer-type-def type-id='type-id-121' size-in-bits='64' id='type-id-122'/>
    <function-decl name='zfs_prop_get_numeric' mangled-name='zfs_prop_get_numeric' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3002' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_numeric'>
      <parameter type-id='type-id-84' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3002' column='1'/>
      <parameter type-id='type-id-2' name='prop' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3002' column='1'/>
      <parameter type-id='type-id-119' name='value' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3002' column='1'/>
      <parameter type-id='type-id-122' name='src' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3003' column='1'/>
      <parameter type-id='type-id-23' name='statbuf' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3003' column='1'/>
      <parameter type-id='type-id-32' name='statlen' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3003' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_prop_get_int' mangled-name='zfs_prop_get_int' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='2979' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_int'>
      <parameter type-id='type-id-84' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='2979' column='1'/>
      <parameter type-id='type-id-2' name='prop' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='2979' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='zfs_prop_get' mangled-name='zfs_prop_get' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='2604' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get'>
      <parameter type-id='type-id-84' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='2604' column='1'/>
      <parameter type-id='type-id-2' name='prop' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='2604' column='1'/>
      <parameter type-id='type-id-23' name='propbuf' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='2604' column='1'/>
      <parameter type-id='type-id-32' name='proplen' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='2604' column='1'/>
      <parameter type-id='type-id-122' name='src' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='2605' column='1'/>
      <parameter type-id='type-id-23' name='statbuf' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='2605' column='1'/>
      <parameter type-id='type-id-32' name='statlen' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='2605' column='1'/>
      <parameter type-id='type-id-5' name='literal' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='2605' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_get_clones_nvl' mangled-name='zfs_get_clones_nvl' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='2435' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_clones_nvl'>
      <parameter type-id='type-id-84' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='2435' column='1'/>
=======
<<<<<<< HEAD
    <typedef-decl name='zprop_source_t' type-id='type-id-138' filepath='../../include/sys/fs/zfs.h' line='266' column='1' id='type-id-139'/>
    <pointer-type-def type-id='type-id-139' size-in-bits='64' id='type-id-140'/>
    <function-decl name='zfs_prop_get_numeric' mangled-name='zfs_prop_get_numeric' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='3002' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_numeric'>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='3002' column='1'/>
      <parameter type-id='type-id-2' name='prop' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='3002' column='1'/>
      <parameter type-id='type-id-137' name='value' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='3002' column='1'/>
      <parameter type-id='type-id-140' name='src' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='3003' column='1'/>
      <parameter type-id='type-id-23' name='statbuf' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='3003' column='1'/>
      <parameter type-id='type-id-43' name='statlen' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='3003' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_prop_get_int' mangled-name='zfs_prop_get_int' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='2979' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_int'>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='2979' column='1'/>
      <parameter type-id='type-id-2' name='prop' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='2979' column='1'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='zfs_prop_get' mangled-name='zfs_prop_get' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='2604' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get'>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='2604' column='1'/>
      <parameter type-id='type-id-2' name='prop' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='2604' column='1'/>
      <parameter type-id='type-id-23' name='propbuf' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='2604' column='1'/>
      <parameter type-id='type-id-43' name='proplen' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='2604' column='1'/>
      <parameter type-id='type-id-140' name='src' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='2605' column='1'/>
      <parameter type-id='type-id-23' name='statbuf' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='2605' column='1'/>
      <parameter type-id='type-id-43' name='statlen' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='2605' column='1'/>
      <parameter type-id='type-id-5' name='literal' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='2605' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_get_clones_nvl' mangled-name='zfs_get_clones_nvl' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='2435' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_clones_nvl'>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='2435' column='1'/>
>>>>>>> 28d08db2d... WIP Direct IO
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_prop_get_recvd' mangled-name='zfs_prop_get_recvd' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='2348' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_recvd'>
      <parameter type-id='type-id-84' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='2348' column='1'/>
      <parameter type-id='type-id-86' name='propname' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='2348' column='1'/>
      <parameter type-id='type-id-23' name='propbuf' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='2348' column='1'/>
      <parameter type-id='type-id-32' name='proplen' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='2349' column='1'/>
      <parameter type-id='type-id-5' name='literal' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='2349' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_prop_inherit' mangled-name='zfs_prop_inherit' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='1926' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_inherit'>
      <parameter type-id='type-id-84' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='1926' column='1'/>
      <parameter type-id='type-id-86' name='propname' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='1926' column='1'/>
      <parameter type-id='type-id-5' name='received' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='1926' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_prop_set_list' mangled-name='zfs_prop_set_list' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='1744' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_set_list'>
      <parameter type-id='type-id-84' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='1744' column='1'/>
      <parameter type-id='type-id-22' name='props' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='1744' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_prop_set' mangled-name='zfs_prop_set' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='1713' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_set'>
      <parameter type-id='type-id-84' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='1713' column='1'/>
      <parameter type-id='type-id-86' name='propname' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='1713' column='1'/>
      <parameter type-id='type-id-86' name='propval' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='1713' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_valid_proplist' mangled-name='zfs_valid_proplist' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='1004' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_valid_proplist'>
      <parameter type-id='type-id-17' name='hdl' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='1004' column='1'/>
      <parameter type-id='type-id-20' name='type' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='1004' column='1'/>
      <parameter type-id='type-id-22' name='nvl' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='1004' column='1'/>
      <parameter type-id='type-id-26' name='zoned' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='1005' column='1'/>
      <parameter type-id='type-id-84' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='1005' column='1'/>
      <parameter type-id='type-id-18' name='zpool_hdl' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='1005' column='1'/>
      <parameter type-id='type-id-5' name='key_params_ok' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='1006' column='1'/>
      <parameter type-id='type-id-86' name='errbuf' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='1006' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <pointer-type-def type-id='type-id-6' size-in-bits='64' id='type-id-123'/>
    <function-decl name='zfs_spa_version' mangled-name='zfs_spa_version' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='967' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_spa_version'>
      <parameter type-id='type-id-84' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='967' column='1'/>
      <parameter type-id='type-id-123' name='spa_version' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='967' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='libzfs_mnttab_remove' mangled-name='libzfs_mnttab_remove' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='947' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_mnttab_remove'>
      <parameter type-id='type-id-17' name='hdl' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='947' column='1'/>
      <parameter type-id='type-id-86' name='fsname' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='947' column='1'/>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='libzfs_mnttab_add' mangled-name='libzfs_mnttab_add' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='917' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_mnttab_add'>
      <parameter type-id='type-id-17' name='hdl' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='917' column='1'/>
      <parameter type-id='type-id-86' name='special' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='917' column='1'/>
      <parameter type-id='type-id-86' name='mountp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='918' column='1'/>
      <parameter type-id='type-id-86' name='mntopts' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='918' column='1'/>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='libzfs_mnttab_cache' mangled-name='libzfs_mnttab_cache' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='866' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_mnttab_cache'>
      <parameter type-id='type-id-17' name='hdl' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='866' column='1'/>
      <parameter type-id='type-id-5' name='enable' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='866' column='1'/>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='libzfs_mnttab_fini' mangled-name='libzfs_mnttab_fini' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='848' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_mnttab_fini'>
      <parameter type-id='type-id-17' name='hdl' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='848' column='1'/>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='libzfs_mnttab_init' mangled-name='libzfs_mnttab_init' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='800' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_mnttab_init'>
      <parameter type-id='type-id-17' name='hdl' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='800' column='1'/>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='zfs_close' mangled-name='zfs_close' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='772' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_close'>
      <parameter type-id='type-id-84' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='772' column='1'/>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='zfs_open' mangled-name='zfs_open' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='683' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_open'>
      <parameter type-id='type-id-17' name='hdl' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='683' column='1'/>
      <parameter type-id='type-id-86' name='path' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='683' column='1'/>
      <parameter type-id='type-id-6' name='types' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='683' column='1'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='make_bookmark_handle' mangled-name='make_bookmark_handle' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='618' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='make_bookmark_handle'>
      <parameter type-id='type-id-84' name='parent' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='618' column='1'/>
      <parameter type-id='type-id-86' name='path' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='618' column='1'/>
      <parameter type-id='type-id-22' name='bmark_props' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='619' column='1'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='zfs_bookmark_exists' mangled-name='zfs_bookmark_exists' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='587' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_bookmark_exists'>
      <parameter type-id='type-id-86' name='path' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='587' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
<<<<<<< HEAD
    <function-decl name='zfs_handle_dup' mangled-name='zfs_handle_dup' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='540' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_handle_dup'>
      <parameter type-id='type-id-84' name='zhp_orig' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='540' column='1'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <class-decl name='zfs_cmd' size-in-bits='109952' is-struct='yes' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='477' column='1' id='type-id-124'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zc_name' type-id='type-id-125' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='478' column='1'/>
=======
    <function-decl name='zfs_handle_dup' mangled-name='zfs_handle_dup' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='540' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_handle_dup'>
      <parameter type-id='type-id-102' name='zhp_orig' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='540' column='1'/>
      <return type-id='type-id-102'/>
=======
    <typedef-decl name='zprop_source_t' type-id='type-id-140' filepath='../../include/sys/fs/zfs.h' line='267' column='1' id='type-id-141'/>
    <pointer-type-def type-id='type-id-141' size-in-bits='64' id='type-id-142'/>
    <function-decl name='zfs_prop_get_numeric' mangled-name='zfs_prop_get_numeric' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='3003' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_numeric'>
      <parameter type-id='type-id-104' name='zhp' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='3003' column='1'/>
      <parameter type-id='type-id-2' name='prop' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='3003' column='1'/>
      <parameter type-id='type-id-139' name='value' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='3003' column='1'/>
      <parameter type-id='type-id-142' name='src' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='3004' column='1'/>
      <parameter type-id='type-id-23' name='statbuf' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='3004' column='1'/>
      <parameter type-id='type-id-44' name='statlen' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='3004' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_prop_get_int' mangled-name='zfs_prop_get_int' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='2980' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_int'>
      <parameter type-id='type-id-104' name='zhp' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='2980' column='1'/>
      <parameter type-id='type-id-2' name='prop' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='2980' column='1'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='zfs_get_clones_nvl' mangled-name='zfs_get_clones_nvl' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='2436' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_clones_nvl'>
      <parameter type-id='type-id-104' name='zhp' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='2436' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_prop_get_recvd' mangled-name='zfs_prop_get_recvd' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='2349' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_recvd'>
      <parameter type-id='type-id-104' name='zhp' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='2349' column='1'/>
      <parameter type-id='type-id-106' name='propname' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='2349' column='1'/>
      <parameter type-id='type-id-23' name='propbuf' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='2349' column='1'/>
      <parameter type-id='type-id-44' name='proplen' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='2350' column='1'/>
      <parameter type-id='type-id-5' name='literal' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='2350' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_prop_inherit' mangled-name='zfs_prop_inherit' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='1927' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_inherit'>
      <parameter type-id='type-id-104' name='zhp' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='1927' column='1'/>
      <parameter type-id='type-id-106' name='propname' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='1927' column='1'/>
      <parameter type-id='type-id-5' name='received' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='1927' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_prop_set_list' mangled-name='zfs_prop_set_list' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='1745' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_set_list'>
      <parameter type-id='type-id-104' name='zhp' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='1745' column='1'/>
      <parameter type-id='type-id-22' name='props' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='1745' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_prop_set' mangled-name='zfs_prop_set' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='1714' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_set'>
      <parameter type-id='type-id-104' name='zhp' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='1714' column='1'/>
      <parameter type-id='type-id-106' name='propname' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='1714' column='1'/>
      <parameter type-id='type-id-106' name='propval' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='1714' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_valid_proplist' mangled-name='zfs_valid_proplist' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='1005' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_valid_proplist'>
      <parameter type-id='type-id-17' name='hdl' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='1005' column='1'/>
      <parameter type-id='type-id-20' name='type' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='1005' column='1'/>
      <parameter type-id='type-id-22' name='nvl' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='1005' column='1'/>
      <parameter type-id='type-id-27' name='zoned' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='1006' column='1'/>
      <parameter type-id='type-id-104' name='zhp' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='1006' column='1'/>
      <parameter type-id='type-id-18' name='zpool_hdl' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='1006' column='1'/>
      <parameter type-id='type-id-5' name='key_params_ok' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='1007' column='1'/>
      <parameter type-id='type-id-106' name='errbuf' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='1007' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <pointer-type-def type-id='type-id-6' size-in-bits='64' id='type-id-143'/>
    <function-decl name='zfs_spa_version' mangled-name='zfs_spa_version' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='968' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_spa_version'>
      <parameter type-id='type-id-104' name='zhp' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='968' column='1'/>
      <parameter type-id='type-id-143' name='spa_version' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='968' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='libzfs_mnttab_remove' mangled-name='libzfs_mnttab_remove' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='948' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_mnttab_remove'>
      <parameter type-id='type-id-17' name='hdl' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='948' column='1'/>
      <parameter type-id='type-id-106' name='fsname' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='948' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='libzfs_mnttab_add' mangled-name='libzfs_mnttab_add' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='918' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_mnttab_add'>
      <parameter type-id='type-id-17' name='hdl' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='918' column='1'/>
      <parameter type-id='type-id-106' name='special' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='918' column='1'/>
      <parameter type-id='type-id-106' name='mountp' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='919' column='1'/>
      <parameter type-id='type-id-106' name='mntopts' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='919' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='libzfs_mnttab_cache' mangled-name='libzfs_mnttab_cache' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='866' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_mnttab_cache'>
      <parameter type-id='type-id-17' name='hdl' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='866' column='1'/>
      <parameter type-id='type-id-5' name='enable' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='866' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='libzfs_mnttab_fini' mangled-name='libzfs_mnttab_fini' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='848' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_mnttab_fini'>
      <parameter type-id='type-id-17' name='hdl' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='848' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='libzfs_mnttab_init' mangled-name='libzfs_mnttab_init' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='801' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_mnttab_init'>
      <parameter type-id='type-id-17' name='hdl' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='801' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='zfs_close' mangled-name='zfs_close' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='773' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_close'>
      <parameter type-id='type-id-104' name='zhp' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='773' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='zfs_open' mangled-name='zfs_open' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='684' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_open'>
      <parameter type-id='type-id-17' name='hdl' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='684' column='1'/>
      <parameter type-id='type-id-106' name='path' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='684' column='1'/>
      <parameter type-id='type-id-6' name='types' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='684' column='1'/>
      <return type-id='type-id-104'/>
    </function-decl>
    <function-decl name='make_bookmark_handle' mangled-name='make_bookmark_handle' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='619' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='make_bookmark_handle'>
      <parameter type-id='type-id-104' name='parent' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='619' column='1'/>
      <parameter type-id='type-id-106' name='path' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='619' column='1'/>
      <parameter type-id='type-id-22' name='bmark_props' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='620' column='1'/>
      <return type-id='type-id-104'/>
    </function-decl>
    <function-decl name='zfs_bookmark_exists' mangled-name='zfs_bookmark_exists' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='588' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_bookmark_exists'>
      <parameter type-id='type-id-106' name='path' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='588' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zfs_handle_dup' mangled-name='zfs_handle_dup' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='541' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_handle_dup'>
      <parameter type-id='type-id-104' name='zhp_orig' filepath='/home/behlendo/src/git/zfs/lib/libzfs/libzfs_dataset.c' line='541' column='1'/>
      <return type-id='type-id-104'/>
>>>>>>> c48db4d89... WIP Direct IO
    </function-decl>
    <class-decl name='zfs_cmd' size-in-bits='109952' is-struct='yes' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='477' column='1' id='type-id-144'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zc_name' type-id='type-id-145' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='478' column='1'/>
>>>>>>> 28d08db2d... WIP Direct IO
>>>>>>> 9592cab4e... WIP Direct IO
>>>>>>> 41ceb90a6... WIP Direct IO
      </data-member>
      <data-member access='public' layout-offset-in-bits='32768'>
        <var-decl name='zc_nvlist_src' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32832'>
        <var-decl name='zc_nvlist_src_size' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32896'>
        <var-decl name='zc_nvlist_dst' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32960'>
        <var-decl name='zc_nvlist_dst_size' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33024'>
        <var-decl name='zc_nvlist_dst_filled' type-id='type-id-16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33056'>
        <var-decl name='zc_pad2' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33088'>
        <var-decl name='zc_history' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33152'>
<<<<<<< HEAD
        <var-decl name='zc_value' type-id='type-id-110' visibility='default'/>
=======
<<<<<<< HEAD
        <var-decl name='zc_value' type-id='type-id-118' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='491' column='1'/>
=======
<<<<<<< HEAD
        <var-decl name='zc_value' type-id='type-id-126' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='491' column='1'/>
=======
        <var-decl name='zc_value' type-id='type-id-146' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='491' column='1'/>
>>>>>>> 28d08db2d... WIP Direct IO
>>>>>>> 9592cab4e... WIP Direct IO
>>>>>>> 41ceb90a6... WIP Direct IO
      </data-member>
      <data-member access='public' layout-offset-in-bits='98688'>
        <var-decl name='zc_string' type-id='type-id-12' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='100736'>
        <var-decl name='zc_guid' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='100800'>
        <var-decl name='zc_nvlist_conf' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='100864'>
        <var-decl name='zc_nvlist_conf_size' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='100928'>
        <var-decl name='zc_cookie' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='100992'>
        <var-decl name='zc_objset_type' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101056'>
        <var-decl name='zc_perm_action' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101120'>
